{
    "days": {
        "2025-08-01": {
            "date": "2025-08-01",
            "posts": [
                {
                    "reddit_id": "1mer72f",
                    "created_utc": 1754037793.0,
                    "date": "2025-08-01",
                    "title": "Here's the Average Stock Market Return in the Last 10 Years and Wall Street's Surprising Forecast for 2025 @themotleyfool #stocks $^GSPC $BRK.A $META $MSFT $GOOGL $AAPL $TSLA $AMZN $BRK.B $C $JPM $GS $MS $WFC $NVDA $DB $AVGO $BCS $OPY $UBS $EVR $GOOG $XYZ $TTD $DDOG $SFB",
                    "title_key": "here s the average stock market return in the last 10 years and wall street s surprising forecast for 2025 @themotleyfool #stocks $^gspc $brk a $meta $msft $googl $aapl $tsla $amzn $brk b $c $jpm $gs $ms $wfc $nvda $db $avgo $bcs $opy $ubs $evr $goog $xyz $ttd $ddog $sfb",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.7149999999999999,
                    "post_polarity": 0.18333333333333332,
                    "post_subjectivity": 3.8999999999999995,
                    "comments_weighted_polarity": 0.7149999999999999,
                    "combined_sentiment": 0.7149999999999999
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 0.7149999999999999
        },
        "2025-08-02": {
            "date": "2025-08-02",
            "posts": [
                {
                    "reddit_id": "1mfmc3b",
                    "created_utc": 1754126807.0,
                    "date": "2025-08-02",
                    "title": "What to Watch With Conagra (CAG) Before Investing @themotleyfool #stocks $CAG $^GSPC",
                    "title_key": "what to watch with conagra cag before investing @themotleyfool #stocks $cag $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1mflpqs",
                    "created_utc": 1754124276.0,
                    "date": "2025-08-02",
                    "title": "'A gamechanger': Economists react to weak July jobs report as rate cut bets surge",
                    "title_key": "a gamechanger economists react to weak july jobs report as rate cut bets surge",
                    "body": "Wall Street strategists are sharply recalibrating their economic outlooks after Friday's July jobs report showed weaker-than-expected hiring and staggering downward revisions to prior months' data, suggesting the labor market may be losing steam at a quicker pace than previously thought.\n\n\n\nThe US economy added just 73,000 jobs in July, far below the 104,000 expected by economists. But the bigger surprise came from revisions to the May and June figures, which collectively erased 258,000 jobs. This marked the largest two-month downward revision since May 2020.\n\n\n\nSarah House, senior economist at Wells Fargo, called the July jobs report \"a dud\" in a client note titled \"July and the No Good, Very Bad Jobs Report.\"\n\n\n\n\"The 'solid' state of the labor market described by the FOMC earlier this week looks more questionable after the July employment report,\" she said, citing broad-based hiring weakness in cyclically sensitive sectors like manufacturing, retail, and professional services.\n\n\n\nDespite persistent strength in healthcare hiring, she added, \"the pace \\[of job growth\\] has lurched lower to just 35K\" over the past three months when factoring in revisions.\n\nSteve Sosnick, chief strategist at Interactive Brokers, bluntly told Yahoo Finance that the July numbers were simply \"not good. There's no way to sugarcoat that. The two-month revision is just staggering. It basically wipes out two months of what we thought were healthy job gains.\"\n\n\n\nCiti economist Veronica Clark agreed, telling Yahoo Finance, \"It's not so much this July number, but the massive downward revisions to the June number that we had last month. ... This definitely does look like a labor market that is weakening.\"\n\n\n\nMeanwhile, Heather Long, chief economist at Navy Federal Credit Union, called the report a \"gamechanger\" in a post on X, echoing others in saying \"the labor market now looks a lot weaker than expected.\"\n\n\n\nThe unemployment rate ticked up to 4.2% in July, in line with expectations and still near historic lows. But as Clark pointed out, \"that happened despite the labor force participation rate falling more,\" a shift some economists have linked to President Trump's immigration crackdown.\n\n\n\nAhead of the report, there were growing concerns that increased deportations were reducing labor supply and keeping the jobless rate artificially low.\n\n\n\nSeptember rate cut odds surge\n\nThe revised data has added urgency to calls for rate cuts from the Federal Reserve, with market pricing shifting notably in the aftermath.\n\n\n\n\"We still anticipate that the Fed starts to cut in September with consecutive cuts thereafter leading to about 100 basis points of cuts in total,\" said Leslie Falcone, head of taxable fixed income strategy at UBS Global Wealth Management.\n\n\n\nFalcone noted that while the Fed had already turned more cautious, the scale of the revisions surprised even the most dovish forecasters. \"Some of these revisions are much more than what people expected. ... I do think that this is a bit on the weaker side. And it does put cuts back on the table.\"\n\n\n\nTraders seem to agree. Following the report, the probability of a September rate cut surged to about 80%, up from just 38% the day prior, according to the CME FedWatch Tool.\n\nEarlier this week, Fed governors Michelle Bowman and Christopher Waller broke from the majority of FOMC officials, dissenting against the decision to hold interest rates steady after warning that the labor market was weaker than initial data had indicated.\n\n\n\nThat warning appeared prescient on Friday as markets tumbled following the report. The tech-heavy Nasdaq (\\^IXIC) fell over 2% by midmorning, the Dow (DOW) shed nearly 600 points, and the S&P 500 (\\^GSPC) dropped around 1.6%. Meanwhile, bond prices surged on increased rate cut bets, sending the yield on the 10-year Treasury (\\^TNX) down 11 basis points to around 4.2%.\n\n\n\nAdding to labor market concerns, escalating trade tensions were also top of mind for investors as Trump hiked tariff rates on several US trading partners, including a surprise 39% tariff on Switzerland.\n\n\n\n\"The market had sort of put tariffs in the rearview mirror and assumed that the labor market was okay,\" Sosnick said. \"Well, both of those assumptions have been overturned quite dramatically this morning.\"\n\n\n\nThe strategist warned markets appear to be entering a \"reckoning period,\" explaining, \"We're not seeing a lot of reflexive dip buying. ... That, to me, tells me that the psychology, at least as of this particular moment, is a bit more tenuous than it was.\"",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.27018899695294785,
                    "post_polarity": 0.05894841269841271,
                    "post_subjectivity": 4.583482142857142,
                    "comments_weighted_polarity": 0.31134449847647394,
                    "combined_sentiment": 0.31134449847647394
                }
            ],
            "post_count": 2,
            "average_combined_sentiment": 0.15567224923823697
        },
        "2025-08-03": {
            "date": "2025-08-03",
            "posts": [
                {
                    "reddit_id": "1mgs417",
                    "created_utc": 1754249313.0,
                    "date": "2025-08-03",
                    "title": "The S&P 500 Has Reached an All-Time High: Should You Invest Now or Wait for a Correction? @themotleyfool #stocks $^GSPC",
                    "title_key": "the s&p 500 has reached an all time high should you invest now or wait for a correction @themotleyfool #stocks $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.9376000000000001,
                    "post_polarity": 0.16,
                    "post_subjectivity": 5.86,
                    "comments_weighted_polarity": 0.9376000000000001,
                    "combined_sentiment": 0.9376000000000001
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 0.9376000000000001
        },
        "2025-08-04": {
            "date": "2025-08-04",
            "posts": [
                {
                    "reddit_id": "1mhveq3",
                    "created_utc": 1754355757.0,
                    "date": "2025-08-04",
                    "title": "Palantir stock surges after company reports first billion-dollar quarter",
                    "title_key": "palantir stock surges after company reports first billion dollar quarter",
                    "body": "Palantir (PLTR) stock surged in after-hours trading on Monday after the company reported second quarter results that beat analyst estimates across the board as its revenue topped $1 billion in a quarter for the first time.\n\n\n\n\"The growth rate of our business has accelerated radically,\" Palantir CEO Alex Karp said. \"Yet we see no reason to pause, to relent, here.\"\n\n\n\nShares in the defense technology giant were up more than 4% in after-hours trade on Monday.\n\n\n\nIn its second quarter, Palantir posted earnings per share of $0.16, beating consensus estimates of $0.14 and up 77% from the same quarter last year. Revenue came in at $1.004 billion, Palantir's first quarter surpassing the billion-dollar mark on a quarterly basis. The company's top line also beat analyst forecasts for $939.25 billion and was up 48% year over year.\n\n\n\nUS commercial revenue came in at $306 million, growing 93% year over year, while US government revenue for the quarter was $426 million, up 53% from the same quarter last year. Analysts had estimated that sales for the two sectors would come in at $273 million and $391 million, respectively.\n\nIn May, shares of Palantir fell 12% the day after its first quarter results as investors scrutinized the company's valuation and declining sales in its international commercial business, which sells software to businesses abroad, even as its first quarter revenue blew past Wall Street's forecasts.\n\n\n\nOn Monday, Palantir raised its 2025 full-year revenue guidance to $4.14-$4.15 billion, above Wall Street's estimate of $3.91 billion. The company also noted in its report that it closed $2.27 billion of total contract value in the quarter, up 140% from the same quarter last year.\n\n\n\nKarp attributed much of the company's success to Palantir's integration of AI technology into its offerings.\n\n\n\n\"It has been a steep and upward climb — an ascent that is a reflection of the remarkable confluence of the arrival of language models, the chips necessary to power them, and our software infrastructure,\" Karp said in a letter to shareholders, \"one that allows organizations to tether the power of artificial intelligence to objects and relationships in the real world.\"\n\n\n\n\"For a startup, even one only a thousandth of our size, this growth rate would be striking, the talk of the town,\" Karp said. \"For a business of our scale, however, it is, we continue to believe, nearly without precedent or comparison.\"\n\n\n\n\"This was a phenomenal quarter ... We are guiding to the highest sequential quarterly revenue growth in our company's history,\" Karp said.\n\nIn another boon to the company's US government business, Palantir announced last week that it signed a deal rolling up contracts with the US Army for a value of up to $10 billion over the next decade.\n\n\n\nWedbush analyst Dan Ives, a noted Palantir bull, said the deal is “one of the largest ever DOD \\[Department of Defense\\] software contracts in US history.”\n\n\n\n\"Palantir remains one of our top tech names to own in 2025 and this deal represents another opportunity for PLTR to capitalize on while continuing to generate unprecedented traction for its entire portfolio across the federal and commercial landscapes,\" Ives wrote in a note to investors on Monday after the company published its earnings.\n\n\n\nPalantir stock is up more than 110% this year against the S&P 500's 7.4% gain.\n\n\n\nSome on Wall Street have concerns about Palantir's valuation, and shares currently trade at levels 24 times the historical market multiple of the S&P 500 (\\^GSPC).\n\n\n\n“We cannot rationalize why Palantir is the most expensive name in our software coverage,” RBC Capital Markets analyst Rishi Jaluria wrote in a note to clients before Palantir published its Q2 earnings. “Absent a substantial beat-and-raise quarter elevating the \\[near term\\] growth trajectory, valuation seems unsustainable.”\n\n\n\nPalantir delivered beat-and-raise results Monday.",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.5448834314169306,
                    "post_polarity": 0.1287234042553191,
                    "post_subjectivity": 4.232978723404256,
                    "comments_weighted_polarity": 1.1649417157084652,
                    "combined_sentiment": 1.1649417157084652
                },
                {
                    "reddit_id": "1mh86pc",
                    "created_utc": 1754297315.0,
                    "date": "2025-08-04",
                    "title": "Warren Buffett Sends Investors a $344 Billion Warning. History Says the Stock Market Will Do This Next. @themotleyfool #stocks $^GSPC $BRK.A $BRK.B",
                    "title_key": "warren buffett sends investors a $344 billion warning history says the stock market will do this next @themotleyfool #stocks $^gspc $brk a $brk b",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                }
            ],
            "post_count": 2,
            "average_combined_sentiment": 0.5824708578542326
        },
        "2025-08-05": {
            "date": "2025-08-05",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-06": {
            "date": "2025-08-06",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-07": {
            "date": "2025-08-07",
            "posts": [
                {
                    "reddit_id": "1mk3ki5",
                    "created_utc": 1754581475.0,
                    "date": "2025-08-07",
                    "title": "Market Digest (8/7): Review, Market Update, Earnings, and What's Moving?",
                    "title_key": "market digest 8/7 review market update earnings and what s moving",
                    "body": "Thanks again to all of you who posted while I took a couple of days away to celebrate my wife's birthday and decompress a bit from the markets.\n\nThat never means I'm not watching what is happening, researching or surveying. I always do. It's just who I am.\n\n**Review**\n\nWe remain in earnings mode though it's starting to wind down. We still have big earnings to come but that is toward the end of August, and beyond, with the likes of $NVDA $AVGO and some secondary names like $SNOW. What we get in between is a period of more quiet. This is the period I was most interested in for my $SQQQ short. I wanted to have it in place before we hit this week.\n\nThere hasn't been much economic news to move the markets. We're continuing to operate within this tight range of \"should we or should we not\" on rates and it's getting a bit more precarious. The dissenting votes from the Fed have been interesting and not so unexpected when you think about it politically. In fact, I heard a guest interview yesterday talking about how the Fed has always been politicized and that it's going to continue to be, that it's not independent as much as we'd all like it to be. I thought it was great to see that feeling out in the open and simply be okay that it's the \"what is\" of the situation.\n\nIt is what it is, and it's only going to get worse with the current Admin. And, hey, maybe that could work in our favor. I'll try to keep an open mind though I do like the thought of an independent Fed.\n\nOther than earnings, this week has settled back into a slow decline off the peak of information, politics, economic news, and big tech earnings. I think that is why August may be usher in a bit of a slide.\n\n**Market Update**\n\nVolatility is declining, we're bouncing within a tighter and tighter range. We could escape to the upside or slip below support at any time. And either of these moves should bring a short period of more of the same for the very near term. Until otherwise convinced, I see us moving lower as the market resets after earnings. I'm still looking for about an 8% decline on the S&P. \n\nThat said, tech has continued to look surprisingly good. Trump's recent announcement related to companies building IN the U.S. is moving those stocks. It makes sense as companies are now free to start making plans to avoid the tariffs rather than need to produce to get the benefit. That's big! And the big names are moving on it.\n\nWhen looking at the S&P, it's clear what is happening as it relates to the narrowing channel: \n\n[S&P 6 Mos.](https://preview.redd.it/qcsuo7ouylhf1.png?width=1035&format=png&auto=webp&s=3a99e04a190f997a1a02b5f0fdea507b327f0280)\n\nYou don't have to be an expert to see that we've climbed the mountain and now we have smaller peaks and valleys within the new elevation that we're at. What's to come? It's too foggy and there's no way to tell for sure, you know how I'm positioning for the short term.\n\nThere just isn't much more to say about this. Here we are, let's just watch and adjust as we need to.\n\nWe're in a bit of a waiting game as it relates to rates. With no *planned* adjustment in August, we have to wait until the Fed's September meeting. In our current state, that is a lot of time to pass. \n\n**Earnings**\n\nI have not researched the following for accuracy but it seems reasonable. I don't have any reason to reason to believe Google's \"AI Overview\" is incorrect here. I simply wanted to know how earnings have been. This is what I got:\n\nPositive surprises and growth\n\n* **Q2 2025:** 66% of S&P 500 companies have reported Q2 earnings, with 82% exceeding mean EPS estimates. This is higher than both the 5-year (78%) and 10-year (75%) averages.\n* **Overall Exceeding Expectations:** Aggregated earnings have surpassed estimates by 8.0%, although this is slightly below the 5-year average (9.1%) but above the 10-year average (6.9%).\n* **Projected Growth:** Analysts predict a 9.9% year-over-year earnings growth for the full year 2025. This is above previous expectations, with estimates increasing over the past six months.\n* **Sectoral Strength:** Information Technology, Health Care, and Financials are leading the growth, while Energy is facing a decline. [According to FactSet Insight](https://insight.factset.com/analysts-project-sp-500-to-report-double-digit-earnings-growth-for-2024-and-2025), for 2025, all eleven sectors are predicted to report (year-over-year) earnings growth.\n* **Technological Drivers:** Strong demand, particularly in Artificial Intelligence (AI), is driving earnings growth in the technology sector, [notes Robertson Stephens](https://rscapital.com/2025/06/17/corporate-earnings-off-to-a-solid-start-in-2025/). \n\nBetter than I expected to be completely honest. But, not completely unexpected. \n\nEconomies turn slowly, very rarely adheres to Newton's Third Law of Motion which states that every action has an equal and opposite reaction. Thankfully, I suppose, economies do not follow the laws of physics. In some ways, I find physics easier to figure out. But that's not to say that Newton couldn't apply some of this law to economics. Whether looking at prices, inflation, the Fed, Trump social posts, etc., all these 'forces' do have reactions tied to them, they just aren't immediate, nor are they necessarily equal.\n\nBut make no mistake, the actions and reactions do exist. But over a slower and elongated time frame. This is why I tend to be more patient when forming longer term views. Us Americans tend to have a bit of ADD when it comes to market events. We move on very quickly when news and events happen. We're willing to wait a bit to see what transpires, but when it doesn't happen quickly, we forget and move on. I've always been very successful in leveraging that aspect of people and the psychology of it in modern day markets.\n\nThe counter-trend trade as I like to call it. You've heard me write about it when discussing what I think may be setting up for the near-term future. \n\nSo, in that vein, things have looked great this Q for earnings. But I still think the storm clouds are about to arrive and that we're going to see choppy waters for the remainder of the year. Is it ordained? No. Do I think we're going to see it? Yes.\n\nCompanies continue to try and cut back on expense while streamlining in an attempt to hold prices steady into the current tariff cycle, but the dam is buckling. In some cases, water is already over the top, but rest assured, more is coming. Big ticket items are about to get much bigger. Things are going to get more expensive. That's the incongruency of Trump's economic zealots who suggested with tariffs that they do not increase inflation all the while Trump has been saying to decrease rates now because of the potential impact of tariffs. \n\nInflation is here, and the wave is going to get bigger. That's about as much of an absolute you'll get from me. Normally I like to stay rather amoebic and ambiguous with the understanding that all our crystal balls are foggy and when you don't think they are, you'll pay the price due to lack of humility.\n\n **What's Moving (Random Shots)**\n\nI'm going away from the term 'Random Shots' here for this post because it's not so random as I survey what has been going on over the past couple of days. I guess that could apply to every post. I'll go back to Random Shots tomorrow.\n\nEarnings, earnings and more earnings.  And we've seen some interesting moves.\n\nLet's talk about AI:\n\nIt would be too much to just start listing all the AI names and talk about each of their moves so let's just settle on, they're moving higher. A combination of earnings and today's news that Trump will stay tariff related increases to chip companies who start plans to invest in the US, and we continue to have fertile soil.\n\nThe big names are moving higher with new ATH's being seen. In many cases, while not an ATH, at least a 52WH.\n\nContinuing to climb and press higher are names such as $NVDA $AVGO $GOOGL, $AAPL $TSM. Even $AMZN $MSFT $AMD have looked good but had earnings related events that moved the names in interesting ways. MSFT shot higher then backed off but the trend is in place. $AMZN disappointed but the softness is now being bought. $AMD had a soft report, and took a dive but is rallying back today. As far as $MRVL $QCOM $MU, it's a bit of a holding pattern. QCOM is looking very intriguing as phone chips come under scrutiny. My other favorite stock that hit a poor current is $ARM.\n\nSpecial shout-out to my $PLTR holders. Congrats! Man did I miss that one when I had it queued up in the $30s the second time around and didn't pull the trigger. I actually owned it around $25 as well. Oops.\n\nAI Energy - This space continues to look great. I'm holding ground here with $VST and $CEG. $TLN has been awesome as has $GEV. Nothing wrong with any of these four.\n\n$AAPL - Amazing how what was cast aside, yet again, bounces back, yet again. The barrage of bad news, analyst opinion and negative forecasts dissipated very quickly on this name and it's rallying again.\n\n$GOOGL - See Apple above. It will hit headwinds again at some point on search, break-up talk and AI concerns. Mark my words.\n\n$FIG - The recent IPO was spectacular. It took off well above my willingness to chase it. The IPO is looking a little bit like $CRWV in price action. I'm still waiting but I think I will be in this one. I was hoping for something in the $65-$75 range. Had a brief chance and I made need to put a bit of a placeholder trade on even if it's a bit higher than I like here near $85.\n\n$AMGN - Hitting the skids again after earnings and just a poor pharma environment. I still own it and will continue to do so. A 3.34% yield is plenty to own this name.\n\n$AMD - It has had quite the rebirth over the past couple of months after no analyst was positive on the company. But lo and behold, I guess two months can entirely change the prospects of a company and their model. Tongue firmly in cheek. It dipped on softish earnings that were still fine but it's almost back to highs. I am considering trimming this one out or even going flat on this move.\n\n$ANET - Holy Moly! I was on this one in a big way and new it was coming back with 2026 Calls at $60 as I recall. It's now at $138. I exited when the stock was in the $90s, satisfied with my gains. Should have held but the current environment had me looking at sweeping out nice gains.\n\n$BROS - The stock hit highs earlier this year and slowly retreated before the earnings lift today, up 18%. I haven't read the report yet but will. Obviously it's a good one.\n\nLet's talk a bit of retail. I generally don't like the group but will wade in on names that I like or have liked. I'm following $ULTA $LULU $TGT $DECK $CROX $NKE among a few others. I own $DECK but have been waiting to see where it's going. But $CROX is down big on their report, -26%. Wow. That is taking down the entire group. I have a very small piece of $LULU at a higher price but that's fine as it was a placeholder. I'm about to add another .5U on this name. As for $TGT. I'm holding with a good entry price and willing to wait due to yield. I never get over my skis on retail or restaurants.\n\n$EIX - I still think this is an interesting paid-to-wait play. I added all the way down into the $40s and I think time is going to heal this one eventually back up to $70. It has been firming up a bit.\n\n$LYB - My worse play in a while as I treated it as paid-to-wait but instead it was paid-for-pain. I've looked at the company and while it's not performing, I still find myself believing it's okay. Not great but even if they chopped their dividend in half, it's still okayish. I don't think they are going anywhere and will be around for awhile. I'm not expecting big moves here but would like to see it get back to $70. I'll probably add more shares simply for yield while waiting .... for more pain.\n\n$CRWD $PANW - The space is seeing rotation and CRWD especially is coming in. Quality company, both of them, and there's nothing wrong here. I'll keep buying as I can but am content to wait it out here and just sit on my shares.\n\n$NBIS - Look at that one go! Congrats to our holders here. I looked at it again recently, I think at $19 during the tariff tantrum. Should have bought a bit.\n\n$CRM $NOW - Like the security companies above, both of these names are coming in as AI rotation to chips takes hold over service. I'm getting closer to adding another small piece of CRM.\n\n$ONTO - Still watching. I perked up in the high $80s but it's popping up today again\n\n$RDDT - What a comeback! Knew it was going to happen and the earnings were great. That has sent it on quite the rally and it could eventually push to a new high. This is one of those early phase plays that you just buy and wait for 20 years in my estimation. I'm not planning on adding more shares as the weight is getting up there. \n\n[$RDDT 1-year](https://preview.redd.it/hcxoy4v69mhf1.png?width=1031&format=png&auto=webp&s=96b59002492275962e5d1e915fcb3d4a03b17688)\n\n$NEM - Pressing new highs again and continue to rise. I had conviction around $30 and am glad I held it. I can't do much with it since it's in my Bridge (taxable) account but I'll keep taking the, now, smaller dividend since it has doubled.\n\n$TOST - Earnings took it down almost 10% and I'm looking to add more, just waiting. I'm accumulating this name for the long haul. I haven't looked at their earnings but will be today.\n\n$TSM - Mentioned this already but as one of the top AI names (Tier 1 in my highlighted/sticky post), it's moving big since they already have operating fabs in the US with more to come. Trump's announcement plays into them very well.\n\n$UBER's earnings were okay but the stock isn't moving on the 'mostly boring' report\n\n$VRT continues to look good but is facing resistance. \n\n$PFE - Actually showed life, popping big on earnings. But traders/investors wouldn't allow it to keep all that move as they took the gains. It's still fine and it's a fine yield play at 7%. \n\nLet's talk about a few other names not on my watchlist:\n\n$INTC - Trump says the CEO needs to resign. Amazing that the Prez is getting into that game now. But INTC is dead to me. I don't care about the upside thesis, it's dead.\n\n$DUOL - We have a member in this one who just posted a couple days ago Congrats!! u/jeansandtshirt Looks like you're upgrading to three piece suit! Great call! This is exactly what it's about people. \n\n$LLY continues to come under pressure, now at the \"modest\" results of their GLP1. The yield just isn't enough for me to hazard a play in this space right now.\n\nMeh, that's all for now. \n\n**Final Word**\n\nHow about a final few words ...\n\nIt's good to be back. Please keep posting!\n\nTJ\n\n",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.5534594570317238,
                    "post_polarity": 0.10987820609490696,
                    "post_subjectivity": 5.037026692569725,
                    "comments_weighted_polarity": 0.8421143973526235,
                    "combined_sentiment": 0.8421143973526235
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 0.8421143973526235
        },
        "2025-08-08": {
            "date": "2025-08-08",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-09": {
            "date": "2025-08-09",
            "posts": [
                {
                    "reddit_id": "1mm3rre",
                    "created_utc": 1754783018.0,
                    "date": "2025-08-09",
                    "title": "2 Stocks Down 83% and 23% to Buy Right Now @themotleyfool #stocks $UPST $^GSPC $BRK.A $BRK.B $NU",
                    "title_key": "2 stocks down 83% and 23% to buy right now @themotleyfool #stocks $upst $^gspc $brk a $brk b $nu",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.3065702947845804,
                    "post_polarity": 0.06507936507936507,
                    "post_subjectivity": 4.710714285714285,
                    "comments_weighted_polarity": 0.3065702947845804,
                    "combined_sentiment": 0.3065702947845804
                },
                {
                    "reddit_id": "1mlpinp",
                    "created_utc": 1754746298.0,
                    "date": "2025-08-09",
                    "title": "The Best AI ETF to Invest $1,000 In Right Now @themotleyfool #stocks $QQQ $^GSPC",
                    "title_key": "the best ai etf to invest $1 000 in right now @themotleyfool #stocks $qqq $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 3.0604591836734687,
                    "post_polarity": 0.6428571428571428,
                    "post_subjectivity": 4.760714285714285,
                    "comments_weighted_polarity": 3.0604591836734687,
                    "combined_sentiment": 3.0604591836734687
                }
            ],
            "post_count": 2,
            "average_combined_sentiment": 1.6835147392290246
        },
        "2025-08-10": {
            "date": "2025-08-10",
            "posts": [
                {
                    "reddit_id": "1mmoh1q",
                    "created_utc": 1754846806.0,
                    "date": "2025-08-10",
                    "title": "This Magnificent Vanguard ETF Just Hit an All-Time High. Should You Invest Now or Wait? @themotleyfool #stocks $VOOG $^GSPC",
                    "title_key": "this magnificent vanguard etf just hit an all time high should you invest now or wait @themotleyfool #stocks $voog $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 4.599399999999999,
                    "post_polarity": 0.58,
                    "post_subjectivity": 7.93,
                    "comments_weighted_polarity": 4.599399999999999,
                    "combined_sentiment": 4.599399999999999
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 4.599399999999999
        },
        "2025-08-11": {
            "date": "2025-08-11",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-12": {
            "date": "2025-08-12",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-13": {
            "date": "2025-08-13",
            "posts": [
                {
                    "reddit_id": "1mph88t",
                    "created_utc": 1755120497.0,
                    "date": "2025-08-13",
                    "title": "Why Curaleaf Stock Rocked the Market Today @themotleyfool #stocks $CURLF $^GSPC",
                    "title_key": "why curaleaf stock rocked the market today @themotleyfool #stocks $curlf $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 0.0
        },
        "2025-08-14": {
            "date": "2025-08-14",
            "posts": [
                {
                    "reddit_id": "1mqbjqz",
                    "created_utc": 1755201849.0,
                    "date": "2025-08-14",
                    "title": "Even at an All-Time High, The Vanguard S&P 500 ETF Isn't as Expensive as It Seems @themotleyfool #stocks $VOO $^GSPC $NVDA $SPY $IVV",
                    "title_key": "even at an all time high the vanguard s&p 500 etf isn t as expensive as it seems @themotleyfool #stocks $voo $^gspc $nvda $spy $ivv",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": -1.1185999999999998,
                    "post_polarity": -0.16999999999999998,
                    "post_subjectivity": 6.58,
                    "comments_weighted_polarity": -1.1185999999999998,
                    "combined_sentiment": -1.1185999999999998
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": -1.1185999999999998
        },
        "2025-08-15": {
            "date": "2025-08-15",
            "posts": [
                {
                    "reddit_id": "1mre1wu",
                    "created_utc": 1755300509.0,
                    "date": "2025-08-15",
                    "title": "Stock Market Margin Debt Tops $1 Trillion: Is Warren Buffett's \"Casino\" Warning Starting to Bite? @themotleyfool #stocks $^GSPC",
                    "title_key": "stock market margin debt tops $1 trillion is warren buffett s casino warning starting to bite @themotleyfool #stocks $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.9,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1mqs019",
                    "created_utc": 1755247423.0,
                    "date": "2025-08-15",
                    "title": "This Is the 3rd Priciest Stock Market in 154 Years, Which Makes This High-Yield ETF a Genius Buy Right Now @themotleyfool #stocks $SCHD $^DJI $^GSPC $^IXIC $MO $CVX $PEP",
                    "title_key": "this is the 3rd priciest stock market in 154 years which makes this high yield etf a genius buy right now @themotleyfool #stocks $schd $^dji $^gspc $^ixic $mo $cvx $pep",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.48724489795918363,
                    "post_polarity": 0.14285714285714285,
                    "post_subjectivity": 3.4107142857142856,
                    "comments_weighted_polarity": 0.48724489795918363,
                    "combined_sentiment": 0.48724489795918363
                }
            ],
            "post_count": 2,
            "average_combined_sentiment": 0.24362244897959182
        },
        "2025-08-16": {
            "date": "2025-08-16",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-17": {
            "date": "2025-08-17",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-18": {
            "date": "2025-08-18",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-19": {
            "date": "2025-08-19",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-20": {
            "date": "2025-08-20",
            "posts": [],
            "post_count": 0,
            "average_combined_sentiment": 0.0
        },
        "2025-08-21": {
            "date": "2025-08-21",
            "posts": [
                {
                    "reddit_id": "1mwbt1q",
                    "created_utc": 1755784962.0,
                    "date": "2025-08-21",
                    "title": "If You'd Invested $1,000 in Bitcoin (BTC) 5 Years Ago, Here's How Much You'd Have Today @themotleyfool #stocks $BTC $^GSPC $QQQ $VOO",
                    "title_key": "if you d invested $1 000 in bitcoin btc 5 years ago here s how much you d have today @themotleyfool #stocks $btc $^gspc $qqq $voo",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.5599999999999999,
                    "post_polarity": 0.2,
                    "post_subjectivity": 2.8,
                    "comments_weighted_polarity": 0.5599999999999999,
                    "combined_sentiment": 0.5599999999999999
                }
            ],
            "post_count": 1,
            "average_combined_sentiment": 0.5599999999999999
        },
        "2025-08-22": {
            "date": "2025-08-22",
            "posts": [
                {
                    "reddit_id": "1mxud3p",
                    "created_utc": 1755931644.0,
                    "date": "2025-08-22",
                    "title": "Rate my pie",
                    "title_key": "rate my pie",
                    "body": "Longterm pie, 25+ years. Had SP500 instead of VWCE but feel like long term I prefer inner peace of not having 90 % bet on US market even when I get smaller profit potentionally. ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.07,
                    "post_polarity": -0.016666666666666666,
                    "post_subjectivity": 4.2,
                    "comments_weighted_polarity": -0.0010915953364816885,
                    "combined_sentiment": -0.0010915953364816885
                },
                {
                    "reddit_id": "1mxo0lu",
                    "created_utc": 1755911153.0,
                    "date": "2025-08-22",
                    "title": "Mid-2025 Market Update: Record Highs, AI Gains & What to Expect by Year End",
                    "title_key": "mid 2025 market update record highs ai gains & what to expect by year end",
                    "body": "Hey fellow investors—here’s a fresh snapshot of the stock market as of late August 2025, plus some educated projections for where things may be headed by year end:\n\n# Current Market Highlights\n\n1. **Markets Climb on Dovish Fed Tone** Fed Chair Jerome Powell’s dovish comments at Jackson Hole have sent the S&P 500, Dow Jones, and Nasdaq to new all-time highs, signaling a possible rate cut cycle ahead.[Investors](https://www.investors.com/news/dow-jones-hits-high-on-dovish-powell-after-ai-worries-walmart-woes/?utm_source=chatgpt.com)[The Times](https://www.thetimes.co.uk/article/fed-interest-rate-decision-today-jerome-powell-jf7v2zlzd?utm_source=chatgpt.com)\n2. **Bullish Year-End Targets Poured In**\n   * UBS raised its S&P 500 year-end target to **6,600**, up from 6,200 just two months ago—citing strong earnings, easing trade tensions, and Fed policy expectations.[Reuters](https://www.reuters.com/business/ubs-lifts-sp-500-annual-target-second-time-two-months-2025-08-22/?utm_source=chatgpt.com)\n   * Strategist Tom Lee echoes this view, suggesting **6,600** is achievable if the Fed cuts rates and manufacturing rebounds.[MarketWatch](https://www.marketwatch.com/story/strategist-tom-lee-says-the-s-p-500-can-reach-as-high-as-7-000-if-two-conditions-are-met-e1ef97d3?utm_source=chatgpt.com)\n3. **AI Could Fuel Massive Market Value Gains** Morgan Stanley estimates that AI could generate $920 billion in annual corporate gains, potentially boosting S&P 500 market capitalization by $13–$16 trillion—roughly a 22–27% upside.[Barron's](https://www.barrons.com/articles/morgan-stanley-on-ai-big-spending-big-value-creation-147c799e?utm_source=chatgpt.com)[Business Insider](https://www.businessinsider.com/stock-market-outlook-sp500-16-trillion-ai-productivity-job-cuts-2025-8?utm_source=chatgpt.com)\n4. **…and Even Bigger Potential Rises** Mary Ann Bartels of Sanctuary Wealth projects a 12% S&P 500 rally by year-end—**7,000**—if AI continues to drive gains and economic conditions improve.[Business Insider](https://www.businessinsider.com/ai-stock-boom-sp500-rally-big-tech-bull-market-2025-7?utm_source=chatgpt.com)\n5. **Cautious Views Persist** A Reuters poll of 35 strategists forecasts the S&P 500 could slip to **6,300** by year-end—down about 2.3%—due to tariff uncertainty and macroeconomic risks like stagflation.[Reuters](https://www.reuters.com/business/sp-500-seen-stalling-ai-rally-meets-tariff-jitters-reuters-poll-2025-08-19/?utm_source=chatgpt.com)\n\n# My Take: What Could Happen by Year-End (Dec 2025)\n\n|Scenario|Likely Outcome for S&P 500|Drivers & Risks|\n|:-|:-|:-|\n|**Bullish Base Case**|6,600 – 7,000|AI productivity boom, rate cuts, strong tech earnings|\n|**Moderate Case**|\\~6,500|[Investopedia](https://www.investopedia.com/what-to-expect-from-the-stock-market-in-the-second-half-of-2025-11764868?utm_source=chatgpt.com)Rangebound movement as high valuations limit upside |\n|**Downside Scenario**|\\~6,300|[Reuters](https://www.reuters.com/business/sp-500-seen-stalling-ai-rally-meets-tariff-jitters-reuters-poll-2025-08-19/?utm_source=chatgpt.com)Tariff shocks, disappointing Fed tone, or stall in global growth |\n\n**Upside traction** is supported by AI-driven earnings, easing Fed policy, and investor sentiment. **Yet**, valuation metrics are stretched, breadth is narrow, and geopolitical/trade volatility remains a real concern.\n\n# Quick Summary\n\n* **Bullish upside**: Potential boost to **6,600–7,000** fueled by AI and monetary easing.\n* **Neutral outlook**: Holding in the mid-6,000s range amid solid fundamentals and high valuations.\n* **Bearish scenario**: Slips toward **6,300** on negative macro shocks or policy missteps.\n\nStay diversified, keep an eye on tech and AI as potential market leaders, and monitor Fed signals and trade developments closely.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.024031894704622005,
                    "post_polarity": 0.003939393939393944,
                    "post_subjectivity": 6.10040404040404,
                    "comments_weighted_polarity": 0.024031894704622005,
                    "combined_sentiment": 0.024031894704622005
                },
                {
                    "reddit_id": "1mxlvug",
                    "created_utc": 1755905246.0,
                    "date": "2025-08-22",
                    "title": "ETF vs fond indiciels",
                    "title_key": "etf vs fond indiciels",
                    "body": "Bonjour j’ai commencer à m’intéresser à la bourse mais je suis coincé.\n\nJe ne comprend pas très bien la différence entre un fond indiciel et un etf. Ils suivent les 2 un indice boursier par exemple le sp500 et les 2 s’achètent.\n\nCependant de ce que j’ai pu lire et entendre je ne vois pas l’intérêt d’acheter un fond indiciel.\n\nSuis-je complètement perdu?\n\nMerci",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.33599126117389105,
                    "combined_sentiment": 0.33599126117389105
                },
                {
                    "reddit_id": "1mxjc0j",
                    "created_utc": 1755898880.0,
                    "date": "2025-08-22",
                    "title": "\"If you think 0% down is a good option, you're lacking in financial literacy\"",
                    "title_key": "if you think 0% down is a good option you re lacking in financial literacy",
                    "body": "**DISCLAIMER:** I checked my work where possible but there could be errors in my math. It's also possible that I've left out significant factors in the decision, and I make no claim to be an expert. Feel free to double check and I will make corrections if necessary. I used [this](https://www.calculator.net/mortgage-calculator.html) mortgage calculator and [this](https://www.investor.gov/financial-tools-calculators/calculators/compound-interest-calculator) compound interest calculator.\n\n***\n\n**EDIT:** I feel the need to clarify that 0% down with $0 in the bank is obviously a horrible idea.\n\n**EDIT 2:** A lot of people are taking issue with my use of 10% as the annual return of the stock market. That is the actual number, not adjusted for inflation, over the history of the SP500. I explicitly said that I was not adjusting for inflation, both for the 0-down argument and for the 15%-down argument. I actually gave it its own bolded paragraph, hoping that people would see that. Either way, if you re-run the numbers adjusted for inflation, it gets across the same point, that the stock market is (on average) a more profitable choice.\n\nI recently saw a comment on this sub saying that anyone who thinks 0% down is a favorable option lacks financial literacy. I decided to run the numbers to the best of my ability to see if that was true. I went into this believing that 0% down on a home loan was almost always going to make more sense financially than a large down-payment.\n\nTake a 30-year, fixed rate $650k mortgage at 7%, and a person with $100,000 saved up for this purchase. As a control, with 0% down payment, $0 invested, my calculator says total paid over the course of the loan is $1,556,807, of which $906,807 is interest. For investing returns, my numbers are 10% return compounded annually over 30 years, same term as the mortgage. I will address inflation, taxes, and other variables later on.\n\nI'll outline three scenarios:\n\n1) **$100k down payment (roughly 15%), $0 invested.** Total paid = $1,317,298, $767,298 in interest, **for a savings of roughly $140k**. If you need cash suddenly for an emergency, you can get a HELOC.\n\n2) **$0 down payment, $100k invested.** After 30 years, that becomes $1,744,940, so **a gain of $1.6 million**. No safety net for short term emergencies.\n\n3) **0% down payment, $50k invested, $50k held as cash for emergencies.** After 30 years, you have $872,470, for **a gain of $700k**.\n\nAt this point I was thinking that the ROI is so much greater with investing that all potential negatives are irrelevant, but I went ahead and went through them anyway.\n\n**PMI/Funding fees:** We'll go with 2% which seems to be the number that is the least in my favor. With $0 down, my calculator gives a cost of ~$164k, versus $60k if you put $100k down, so -$100k for my argument.\n\n**Inflation:** The investment returns are going to be negatively affected by inflation, but you could say the same about the money that you saved on interest. It becomes more relevant at this point to speak in terms of monthly savings rather than whole-term savings. $0 down = $4,324/mo, $100k down = $3,659/mo. At this point, I realized there was a fourth scenario. **If you diligently invest the $665 difference every single month for 30 years, you come out with $1,312,662**, AND you have the option of a HELOC as a safety net, AND you lowered your funding fee/PMI cost!\n\n**Taxes:** Though a higher yearly spend on mortgage interest is tax-deductible, the difference between my scenarios seems to be small enough that it's irrelevant, maybe $2k a year in favor of the $0 down approach. Investing the difference in monthly mortgage payment can also be deductible in some cases. However, what is significant is that you will need to pay taxes on your capital gains. That said, so long as you don't withdraw it all at once, investing still puts you far ahead.\n\nYour situation will have different numbers, but I think it is fair to conclude that:\n\n- 0% down is not automatically a bad idea, but comes with significant risk\n- A moderately sized down-payment gives you significant flexibility, and can still make a lot of money on the stock market if you are diligent with investing the savings\n\nWhat do you guys think?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.14097766533954123,
                    "post_polarity": 0.02763999118165786,
                    "post_subjectivity": 5.100496031746031,
                    "comments_weighted_polarity": 0.7591916303230546,
                    "combined_sentiment": 0.7591916303230546
                },
                {
                    "reddit_id": "1mxhhs4",
                    "created_utc": 1755894490.0,
                    "date": "2025-08-22",
                    "title": "ETF's for Fixed Incomes in TFSA",
                    "title_key": "etf s for fixed incomes in tfsa",
                    "body": "Long story short, my partner lost both of her parents and received an inheritance. She has a younger sister (early twenties) who is looking to do something with the money. So we called the Financial Advisor the family used, and they recommended a dog shit fund. 2.4% management fee and underperforms the market... yay!\n\n  \nWith that, we are going to self-direct the investments. I do all my own self-directed investing. I follow the basics: don't try to beat the market or time it, diversify, indexes are your friend, and keep fees low (so don't stress, we aren't optioning Tesla, on a Bitcoin margin lol). \n\nAsking for help with income ETFs. I have the list for Equities (SP500, Global, TSX60, Euro100, Emerging Market, etc.), but I would like to know if anyone has some good recommendations on fixed income, like a bond ETF. I know there is CASH and similar, but looking at some funds that would have gov't and corp bonds to add to the mix. \n\nThanks to anyone who shares a recommendation! ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.6642666666666668,
                    "post_polarity": 0.15666666666666668,
                    "post_subjectivity": 4.24,
                    "comments_weighted_polarity": 0.8993878492933003,
                    "combined_sentiment": 0.8993878492933003
                },
                {
                    "reddit_id": "1mxha7s",
                    "created_utc": 1755894006.0,
                    "date": "2025-08-22",
                    "title": "Taxa de ajustamento",
                    "title_key": "taxa de ajustamento",
                    "body": "Boas pessoal\n\nHá mais ou menos 5 meses comecei a investir 100€ por mês\nPretendo começar a investir mais, mas por enquanto para apalpar terreno sem perceber nada acho que já está um valor bastante bom \n\nEntretanto durante este tempo parece que descobri o pote de ouro no final do arco íris ( e é por isso que eu tou um pouco desconfiado)\n\nEste CFD que pelo o que eu percebi seria o SP500 dos dividendos altos e volatibilidade baixa parece me incrível, cada ação/participação custa entre 8 e 9€ e paga de dividendos 0,15€\n\nFazendo a simulação colocando 250€/mês durante 20anos, no final dos 20anos iria me gerar 3000€/mes, o que para a realidade em Portugal é um valor absurdo “sem fazer nada”\n\nA questão é que depois que o mês passa eu só recebo 70% do valor total dos dividendos que eu devia receber\n\nPorque os 30% são descontados em “taxa de ajustamento”?\nO que é essa taxa de ajustamento?\nEssa taxa de ajustamento são basicamente os impostos do governo que já são retirados automaticamente? Ou no final do ano no IRS eu teria de pagar 28% de imposto sobre os 70% que eu recebi de dividendos?\n\nDesde já agradeço por este Reddit que tenho tirado bastantes dúvidas convosco\nAbraço 💪",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 9.4375,
                    "comments_weighted_polarity": 0.34205128205128205,
                    "combined_sentiment": 0.34205128205128205
                },
                {
                    "reddit_id": "1mxgs9t",
                    "created_utc": 1755892834.0,
                    "date": "2025-08-22",
                    "title": "Affiancamento sp500 e chiarimenti",
                    "title_key": "affiancamento sp500 e chiarimenti",
                    "body": "Buonasera a tutti, investo principale nel sp500 e prossimamente vorrei affiancare un all world o un msci world, molti dicono che ci si sovraespone a gli usa e sono d'accordo, ma se entrambi i due etf  world si ribilanciano ogni 3 mesi, quale potrebbe essere il problema di una momentanea esposizione?. ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.546875,
                    "post_polarity": -0.125,
                    "post_subjectivity": 4.375,
                    "comments_weighted_polarity": -0.30100852272727274,
                    "combined_sentiment": -0.30100852272727274
                },
                {
                    "reddit_id": "1mxelzd",
                    "created_utc": 1755887799.0,
                    "date": "2025-08-22",
                    "title": "What are the downsides to taking out a mortgage sized personal loan at a low rate and then lumping it into SP500 all at once",
                    "title_key": "what are the downsides to taking out a mortgage sized personal loan at a low rate and then lumping it into sp500 all at once",
                    "body": "For example 500k with an average of 10% annual growth would yield around 3.3 million in 20 years.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.19999999999999998,
                    "post_polarity": -0.049999999999999996,
                    "post_subjectivity": 4.0,
                    "comments_weighted_polarity": 0.5896315457409722,
                    "combined_sentiment": 0.5896315457409722
                },
                {
                    "reddit_id": "1mxe9lk",
                    "created_utc": 1755887030.0,
                    "date": "2025-08-22",
                    "title": "Need advice, but I don't really have any strategy",
                    "title_key": "need advice but i don t really have any strategy",
                    "body": "I'm M31 single, I live in Poland and earn in PLN. I can invest \\~2000-3000 EUR monthly. I'm DCAing and also trying to keep some case for dips.\n\nFirstly my plan was to buy an apartment, so I saved my money on deposits in banks. After I decided delay apartment buy due to high prices and high mortgage interest rate. I wanted to stop my money from losing its value, because deposit in banks gave me less than inflation. I started to learn about stocks and bonds.\n\nSince I was sceptical about investments, I bought 70k EUR (in PLN) gov bonds (5.95% annually for 3 years) and stocks with current value 60k (currently it's +9%, mostly sp500, other etfs, gold, single stocks). Also I have 20k EUR on accounts with interest rate (1/2 emergency money and 1/2 cash for dips).\n\nNow i'm wondering if I have too much bonds and too much safety, so I probably need to take more risk in order to get better gains.\n\nSo my question is: should I move some money (1/3 or 2/3) from bonds to stocks (buy SP500 or all world etf) and take more risk for better gains?\n\nYou probably answer that it depends on my strategy/goals/plan, but I don't really know what my plans are. I feel like current time is very unstable, there can be a war or I may want to move to another country (I have some thoughts on that). Someday I probably want to buy an apartment somewhere, but I will buy if there will be low interest rate, so I should not spend all my money on a apartment. So currently I'm just saving money for better future and I want it to grow.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.696351561459493,
                    "post_polarity": 0.16587359307359306,
                    "post_subjectivity": 4.198085714285715,
                    "comments_weighted_polarity": 1.1101820056727707,
                    "combined_sentiment": 1.1101820056727707
                },
                {
                    "reddit_id": "1mx929t",
                    "created_utc": 1755875281.0,
                    "date": "2025-08-22",
                    "title": "Market Digest (8/22):  Game on! What am I doing? Random Shots",
                    "title_key": "market digest 8/22 game on what am i doing random shots",
                    "body": "Let's just dive in:\n\nPowell's two words of \"may warrant\" as it relates to a potential rate cut is sending markets higher materially.\n\n[https://www.cnbc.com/2025/08/22/powell-indicates-conditions-may-warrant-interest-rate-cuts-as-fed-proceeds-carefully.html](https://www.cnbc.com/2025/08/22/powell-indicates-conditions-may-warrant-interest-rate-cuts-as-fed-proceeds-carefully.html)\n\n[CNBC 8\\/22\\/25](https://preview.redd.it/fq04znjr1lkf1.png?width=937&format=png&auto=webp&s=927ae13780d66826b3c357e0bf6cd9a8ae677daa)\n\nThis would seem to indicate that we are, indeed, on the runway to at least a 25 bps reduction in Sept. Markets seem to be rallying on the potential that it could be 50 bps, or at least a sequence of multiple cuts. This clearly put all eyes on the economy, specifically a combination of jobs and inflation. I'll go as far as to say it's far more about the next jobs report.\n\nInflation could be a concern going forward and, depending on how you look at it, that could be good or bad for a potential rate cut. But the jobs report, if it craps the bed again like it did last month, could cause the Fed to be more aggressive in Sept. If it's simply soft, as one would likely predict, it could bring the multiple cut scenario more into focus.\n\nIn any case, markets are moving higher in a risk-on move after a period of 'sloppy' action.\n\n**What am I doing?**\n\nNothing different than I have been recently. I'm not chasing anything to the upside. I just don't have enough conviction in the valuation proposition of the market right now. That said, I like my balance and my weights and I'm not trimming further either. Today could be a trimming event for me if I was looking to further reduce weights, but I'm not inclined to do so until after I see $NVDA's numbers next week.\n\nPositions that were coming into range due to downside action have reversed course and are heading higher again in a big way. That takes most additions, or further units of an established position, off the table for now. Once again ... patience and I'll express my right to \"be quiet.\" \n\nI'll simply bask in the glow of a lot of green and my portfolios ripping.\n\nAs for my $SQQQ hedge. After being up over 100%, the $17s are now up 17%. The $18s are now down 40%. Such is the life of a hedge. It does make for an intriguing double-up opportunity on those $18s but I'll stay patient for now as it plays out.\n\n**Random Shots**\n\nGoing to keep this short because most everything is green.\n\n* $GOOGL up 2% this AM on the news of its big data center win from $META.  I thought this move would be at least 3%+. Given the rate news this AM, maybe more. \n* Interesting tidbit I read late last night was that the breadth of this rally hasn't been great. Stocks trading over their 200 DMA is something like 64% instead of the typical 75%, don't quote me on those numbers. That usually doesn't bode well for continuation of a rally.\n* But, considering that last note, the Russell 2000 is outperforming the S&P by a good margin over the last three months which means that there could be a catch-up trade forming\n\n[Russell 2000 vs. S&P500 - 3 mos. Chart](https://preview.redd.it/s6919tkg5lkf1.png?width=1603&format=png&auto=webp&s=2b66fbefe48531b9b7ccecf2cd0829dd78df2691)\n\n* Did you notice gold? My $NEM position is now pushing $71\n* $CRWV looking good today but I shouldn't even be singling them out. This is one of the few positions I'm in the middle of building\n* $RDDT bouncing back as well\n* $ONTO - You have to be quick. It gave me the briefest of windows to enter below $90 but I decided not to take it. Now $111\n* $LYB with a big 4% move today breaking out of a recent range. Guess some feel it's an interest rate play\n* On my losers list, it's headed by my hedge $SQQQ. That's fine.\n* Other losers are safety plays of $VZ and $ABBT. $ETR $BRK/B $AEP, the usual suspects when we see a risk-on rally.\n\nJust a short entry today, lots of tasks on the docket for today. Have a great Friday!\n\nTJ",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.3144637660540126,
                    "post_polarity": 0.06730571016285303,
                    "post_subjectivity": 4.672170686456401,
                    "comments_weighted_polarity": 0.7520366309198097,
                    "combined_sentiment": 0.7520366309198097
                }
            ],
            "post_count": 10,
            "average_combined_sentiment": 0.4510403981815948
        },
        "2025-08-23": {
            "date": "2025-08-23",
            "posts": [
                {
                    "reddit_id": "1my7q5p",
                    "created_utc": 1755970589.0,
                    "date": "2025-08-23",
                    "title": "My 17 stock portfolio list. Yesterday I was +17.94% YTD against the SP500 with only +8.31%. I hope I can finish the year beating SP500 and repeat it. I also have other investments in ETFs but this account is only about individual stocks.",
                    "title_key": "my 17 stock portfolio list yesterday i was +17 94% ytd against the sp500 with only +8 31% i hope i can finish the year beating sp500 and repeat it i also have other investments in etfs but this account is only about individual stocks",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.22636718749999998,
                    "post_polarity": -0.03125,
                    "post_subjectivity": 7.2437499999999995,
                    "comments_weighted_polarity": -0.22636718749999998,
                    "combined_sentiment": -0.22636718749999998
                },
                {
                    "reddit_id": "1mya9nu",
                    "created_utc": 1755976460.0,
                    "date": "2025-08-23",
                    "title": "Mă mut în SUA, ce se întâmplă cu brokerul?",
                    "title_key": "mă mut în sua ce se întâmplă cu brokerul",
                    "body": "După o perioadă de studiat în grupul asta, am luat decizia să investesc lunar la bursă, în sp500.\n\nDin ce am vazut,prin XTB ar fi cea mai bună variantă.\n\nEu la anul mă voi stabili în state, prin viză de muncă, ulterior greencard etc.\n\nPlănuiesc să investesc $8k , și apoi sa contribui lunar câte puțin. \n\nCum procedez cu brokerul? Va trebui să l schimb?\nCe se întâmplă cu acea sumă de bani? Trebuie transferați la un broker american? Sau pot continua tot prin xtb?\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.2519419117647059,
                    "combined_sentiment": 0.2519419117647059
                },
                {
                    "reddit_id": "1my82qn",
                    "created_utc": 1755971380.0,
                    "date": "2025-08-23",
                    "title": "La rivincita del World Value (IWVL)",
                    "title_key": "la rivincita del world value iwvl",
                    "body": "Signori,\nsembrerebbe che le large cap si siano un attimo fermate dopo periodi di crescita spventosi (Sp500, SWDA ecc).\n\nNell'ultimo mese però (Agosto 25) si è vista una rapida crescita sulle aziende sottovalutate +6,87% e credo saliranno ulterioremente vedendo il trend.\n\nSiamo entrati in quel periodo di ciclicità in cui le large cap andranno \"in pausa\" a favore delle value ?\n\nOppure è soltano una rondine che non fa primavera?\n\nAttualmente ho il 15% in portafoglio di IWVl  e sono molto soddisfatto. Pensavo addirittura di portarla al 25%. Voi che dite?\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.040816326530612,
                    "post_polarity": 0.21428571428571427,
                    "post_subjectivity": 4.857142857142857,
                    "comments_weighted_polarity": -0.0723960695389267,
                    "combined_sentiment": -0.0723960695389267
                },
                {
                    "reddit_id": "1my6i40",
                    "created_utc": 1755967791.0,
                    "date": "2025-08-23",
                    "title": "Investir dans le SP500",
                    "title_key": "investir dans le sp500",
                    "body": "Bonjour, J'ai 40 ans, l'hypothèque vient d'être remboursé en totalité. Moi et ma conjointe n'avons aucune dette. On vient d'accumuler 40k et je désire investir dans le VFV. Cependant, je me retiens parce que j'ai l'impression que le SP500 est surévalué. ChatGPT me conseil d'investir les fonds sur dix mois. Quels sont vos avis/expériences? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.2819635770975057,
                    "combined_sentiment": 0.2819635770975057
                },
                {
                    "reddit_id": "1mxyhwf",
                    "created_utc": 1755946959.0,
                    "date": "2025-08-23",
                    "title": "Revisión estrategia para FIRE",
                    "title_key": "revisión estrategia para fire",
                    "body": "Hola, en primer lugar muchas gracias por la información encontrada aquí, es de mucho valor.\n\nTras empezar en mediados 2024 en el mundo de la inversión y haber ido incrementando mis aportaciones necesito sobre todo consejos o posibles cambios en mi estrategia para lograr el FIRE ya que siempre viene bien opiniones fundamentadas de los demás.\nMi situación: 32 años, 115k salario bruto anual(incluyendo bonus):\n- 1 piso con hipoteca donde vivo al 2% fija valorado en 310k y me quedan 165k de hipoteca\n- Fondo Emergencia: 12k\n- Cartera inversión 48k distribuida:\n40% Vanguard Global Stock (MSCI world)\n20% Fidelity Global Tech\n10% Horos Value Internacional\n10% Hamco Global Value\n10% Bitcoin\n5% Xetra Gold (ETC Oro)\n5% Crowdlending en 4 plataformas y un\nPlan Pensión Indexado sp500 MyInvestor\n\nA parte tengo un coche valorado en 40k.\n\nEmpecé aportando 500€/mes para ir acostumbrandome a la volatilidad del mercado y tras varios cambios en la cartera actualmente hago DCA 3k/mes siguiendo la distribución de arriba, al PP los 1.5k de máximo a principios de año y los meses donde recibo el bonus y las pagas \"dobles\" mi intención es meterlo de golpe.\n\nLlevo apenas un 6% revalorarización en año y medio debido a cambios de estrategia, el par eur/usd y que la mayor parte de la cartera viene dada por las aportaciones de los últimos meses.\n\nMi principal objetivo en los proximos 5 años es la compra de un chalet, que dudo mucho que salga por menos de 600k, aunque me preocupa el descapitalizarme y perder la bola de nieve que haya acumulado estos años... Acepto consejos.\n\nMi idea en el futuro, contando con la familia con hijos y tal, me sentiría cómodo con un gasto mensual de 3k por lo que supone un FIRE de 1.5m€.\n\nAgradecería consejos sobre mi cartera, situación y \"plan de vida\". Muchas gracias",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.39700740740740736,
                    "combined_sentiment": 0.39700740740740736
                },
                {
                    "reddit_id": "1mxxbfi",
                    "created_utc": 1755942809.0,
                    "date": "2025-08-23",
                    "title": "Holy Grail - warum eigentlich so klein ?",
                    "title_key": "holy grail warum eigentlich so klein",
                    "body": "Interessehalber: der Holy Grail hat ein Fonds Volumen von um die 20 Milliarden. Im Vergleich mit zB sp500 ETF (650 mrd) ist das recht überschaubar.  Frage: warum ist das so wenig?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.009254918183489618,
                    "combined_sentiment": 0.009254918183489618
                },
                {
                    "reddit_id": "1mxz038",
                    "created_utc": 1755948614.0,
                    "date": "2025-08-23",
                    "title": "Dúvida sobre onde aplicar as poupanças",
                    "title_key": "dúvida sobre onde aplicar as poupanças",
                    "body": "Bom dia Redditors, o assunto me suscita dúvida acho que é auto explicativo pelo título.\nPara dar um contexto sou um jovem de 20 anos e ingressei recentemente num curso das forças de segurança portuguesas.\nMensalmente , líquidos consigo obter uns 743€, sendo que mal recebo, envio diretamente 250€ para gastos mensais e 150€ para investimentos (SP500& SP500 Inf. Tech.).\nNa conta da T212 tenho perto de 5K, na minha de poupanças para onde vão o excedente que não gasto tenho perto de 2K.\nSei que em início de vida é sempre complicado alavancar o dinheiro tenho em conta que também não tenho muito.\nMas desde sempre tive a ideia de o tornar mais rentável fora os investimento em ETFS, recentemente pensei em investir futuramente em imobiliário, mas que opiniões/conselhos tem vos para me dar?\nCaso saibam de dicas para encontrar uma segunda fonte de rendimento agradeço , sinto um pouco perdido nessa parte 😅\nObrigado e sucesso a todos nesta jornada!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -0.07821428571428572,
                    "combined_sentiment": -0.07821428571428572
                },
                {
                    "reddit_id": "1my7brm",
                    "created_utc": 1755969681.0,
                    "date": "2025-08-23",
                    "title": "Could Buying AGNC Investment Stock Today Set You Up for Life? @themotleyfool #stocks $AGNC $^GSPC",
                    "title_key": "could buying agnc investment stock today set you up for life @themotleyfool #stocks $agnc $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                }
            ],
            "post_count": 8,
            "average_combined_sentiment": 0.07039878396248703
        },
        "2025-08-24": {
            "date": "2025-08-24",
            "posts": [
                {
                    "reddit_id": "1mzbg6s",
                    "created_utc": 1756079481.0,
                    "date": "2025-08-24",
                    "title": "Top 10 Stocks that beat the S&P 500 last week.\n\nS&P 500 returned only 0.27% and these stocks beat it to its own game!",
                    "title_key": "top 10 stocks that beat the s&p 500 last week s&p 500 returned only 0 27% and these stocks beat it to its own game",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.7608000000000001,
                    "post_polarity": 0.12000000000000002,
                    "post_subjectivity": 6.34,
                    "comments_weighted_polarity": 0.9830051007941757,
                    "combined_sentiment": 0.9830051007941757
                },
                {
                    "reddit_id": "1mzcnix",
                    "created_utc": 1756082823.0,
                    "date": "2025-08-24",
                    "title": "Tax implications of selling then buying stocks in a retirement account?",
                    "title_key": "tax implications of selling then buying stocks in a retirement account",
                    "body": "I have a 457 retirement account that I’m able to actively manage myself. Currently I’ve just been putting a part of my check every two weeks into SPY and leaving it alone. I’m wanting to diversify out a bit beyond just the SP500. Is there a way to essentially “transfer” money from SPY into something else without incurring penalties or tax burdens? Or should I just adjust my contributions moving forward? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.4886979166666667,
                    "post_polarity": 0.09166666666666667,
                    "post_subjectivity": 5.33125,
                    "comments_weighted_polarity": 0.07860966251290019,
                    "combined_sentiment": 0.07860966251290019
                },
                {
                    "reddit_id": "1mz70wi",
                    "created_utc": 1756068450.0,
                    "date": "2025-08-24",
                    "title": "Markets Call: BitCoin, SP500, Long Bond Yield",
                    "title_key": "markets call bitcoin sp500 long bond yield",
                    "body": "[Markets Call: BitCoin, SP500, Long Bond Yield](https://www.linkedin.com/feed/update/urn:li:activity:7365481552627040256?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAAWorwB3QLDGxsNI_L4MUlYBYKlqZJO4rU)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.22999999999999998,
                    "post_polarity": -0.05,
                    "post_subjectivity": 4.6,
                    "comments_weighted_polarity": -0.22999999999999998,
                    "combined_sentiment": -0.22999999999999998
                },
                {
                    "reddit_id": "1mzjaea",
                    "created_utc": 1756104239.0,
                    "date": "2025-08-24",
                    "title": "Si pour vous le Sp500/nasdaq/world est une BULLE, vous investissez dans QUOI?",
                    "title_key": "si pour vous le sp500/nasdaq/world est une bulle vous investissez dans quoi",
                    "body": "Le débat c'est pas si c'est une bulle ou non mais pour ceux qui estiment qu'un nasdaq qui fait ×2 en 2 ans n'est pas normal et cache une decorrelation de la valeur réelle , vous investissez dans quoi? \nÀ mon avis si il y a une crise , les fonds d'investissements retireront leur placement de valeurs technologiques/luxes ( car plus spéculatives). Dans ce cas ils mettront leur argent où? Dans cet hypothèse ces valeurs la seront en positives sur un marché descendant.\n\nCordialement ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.0274999999999999,
                    "post_polarity": 0.15,
                    "post_subjectivity": 6.85,
                    "comments_weighted_polarity": 0.5952646497195369,
                    "combined_sentiment": 0.5952646497195369
                },
                {
                    "reddit_id": "1mz6ghk",
                    "created_utc": 1756067131.0,
                    "date": "2025-08-24",
                    "title": "Markets: Dow Jones makes New All Time High. S&P 500 and Nasdaq make recovery highs. Gold rises, Bitcoin falls. Treasury Yields fall.",
                    "title_key": "markets dow jones makes new all time high s&p 500 and nasdaq make recovery highs gold rises bitcoin falls treasury yields fall",
                    "body": "[https://marketchartpattern.substack.com/p/markets-dow-jones-makes-new-all-time](https://marketchartpattern.substack.com/p/markets-dow-jones-makes-new-all-time)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.8113628099173554,
                    "post_polarity": 0.1481818181818182,
                    "post_subjectivity": 5.475454545454546,
                    "comments_weighted_polarity": 0.8113628099173554,
                    "combined_sentiment": 0.8113628099173554
                },
                {
                    "reddit_id": "1mz6fkv",
                    "created_utc": 1756067072.0,
                    "date": "2025-08-24",
                    "title": "How Expensive is the S&P 500 ? on [22-août-2025]",
                    "title_key": "how expensive is the s&p 500 on 22 août 2025",
                    "body": "Hello everyone,\n\nI just published the latest weekly update on the S&P 500’s valuation — including the Price-to-Earnings (P/E) ratio and Earnings Per Share (EPS).\"\n\nYou'll get (for free) A detailed comparison of valuation metrics from 2016 to 2025 as well as two very unique data viz.\n\nFull analysis : [https://epargnebourse.fr/sp-500-per-eps.html](https://epargnebourse.fr/sp-500-per-eps.html) (available in English, German, French, …)\n\nhttps://preview.redd.it/bwhryhdz01lf1.png?width=1030&format=png&auto=webp&s=ee17ce94da51c5cab83d0c6bb6c20d81313a081f\n\nI encourage you to stay cautious as the SP 500 is now in an even riskier situation than it was on Feb 19th.\n\n\n\nWould love to hear your thoughts or feedback!\n\n\\#S&P 500, #SP500, #SPY, #pe ratio spy, #PE ratio S&P 500, PE ratio SP500, msci world\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.9602343750000002,
                    "post_polarity": 0.15937500000000002,
                    "post_subjectivity": 6.025,
                    "comments_weighted_polarity": 0.9602343750000002,
                    "combined_sentiment": 0.9602343750000002
                },
                {
                    "reddit_id": "1mz6cs3",
                    "created_utc": 1756066891.0,
                    "date": "2025-08-24",
                    "title": "Analyse du niveau de cherté du S&P 500 au 22-08-2025",
                    "title_key": "analyse du niveau de cherté du s&p 500 au 22 08 2025",
                    "body": "Hello, L'analyse hebdo du per, de la progression des EPS du S&P 500 est en ligne.\n\nVous trouverez une comparaison avec les données depuis 2016, ainsi qu'une synthèse très visuelle du risque actuel sur les marchés.\n\n**Si vous investissez sur le SP500 (etf SP500) ou même un ETF monde, vous devriez vous intéresser à ces données pour tirer votre propre conclusion**\n\n\n\nAnalyse complète ici : [https://epargnebourse.fr/sp-500-per-eps.html](https://epargnebourse.fr/sp-500-per-eps.html)\n\n\n\nhttps://preview.redd.it/067pts6e01lf1.png?width=1093&format=png&auto=webp&s=9c391db2c3a52640d3d823b0fbee8aaf1c2a80d3\n\n  \n\n\n\\#S&P 500, #SP500, #SPY, #pe ratio spy, #PE ratio S&P 500, PE ratio SP500, msci world\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -7.5,
                    "post_polarity": -0.75,
                    "post_subjectivity": 10.0,
                    "comments_weighted_polarity": -7.5,
                    "combined_sentiment": -7.5
                },
                {
                    "reddit_id": "1myzl17",
                    "created_utc": 1756051592.0,
                    "date": "2025-08-24",
                    "title": "Nasdaq and S&P Dive on AI Bubble Jitters",
                    "title_key": "nasdaq and s&p dive on ai bubble jitters",
                    "body": "Nasdaq and S&P Dive on AI Bubble Jitters\n\n\n\nWall Street faced a turbulent session today as mounting fears of an “AI bubble” drove heavy selling across tech stocks. The Nasdaq sank sharply, weighed down by big names in the artificial intelligence sector, while the S&P 500 also posted broad losses.\n\n\n\nInvestors are becoming increasingly cautious after months of rapid gains fueled by AI enthusiasm. Valuations in leading AI companies have skyrocketed, raising concerns that prices no longer reflect realistic growth prospects. Some analysts are even drawing comparisons to the dot-com bubble of the early 2000s.\n\n\n\nWhile long-term optimism for AI adoption remains strong, today’s pullback highlights how fragile investor confidence can be when hype outpaces fundamentals. Traders will now be watching closely for earnings reports and guidance from major tech firms to gauge whether momentum in AI stocks is sustainable or set for a deeper correction.\n\n\n\n\\#StockMarket #Nasdaq #SP500 #AIBubble #TechStocks #WallStreet #Investing #MarketNews #Finance\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.09116271219135803,
                    "post_polarity": 0.016203703703703703,
                    "post_subjectivity": 5.6260416666666675,
                    "comments_weighted_polarity": 0.09116271219135803,
                    "combined_sentiment": 0.09116271219135803
                },
                {
                    "reddit_id": "1myz3wu",
                    "created_utc": 1756050513.0,
                    "date": "2025-08-24",
                    "title": "401K Securities",
                    "title_key": "401k securities",
                    "body": "Does Epic’s 401K plan offer a security that matches the SP500? What index fund options are available for 401K portfolios?\n\nAlso: What are you putting your money in (maybe include age/life context/risk tolerance if you’re commenting)? I’m pretty young and have no dependents, so I plan to buy stock index funds pretty aggressively for the next few years. I think it’d be interesting to hear what some others are doing.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.9231250000000002,
                    "post_polarity": 0.17500000000000002,
                    "post_subjectivity": 5.275,
                    "comments_weighted_polarity": 0.5297795918997183,
                    "combined_sentiment": 0.5297795918997183
                },
                {
                    "reddit_id": "1myreez",
                    "created_utc": 1756028787.0,
                    "date": "2025-08-24",
                    "title": "Vos avis",
                    "title_key": "vos avis",
                    "body": "Bonjour, j'ai 25 ans et j'ai ouvert mon PEA il y a 3 ans. Je suis quelqu'un qui épargne beaucoup, donc je dirais que sur un salaire de 2,5k net il me reste 800-1000 euros tous les mois, sauf imprévu.... Cette année j'ai décidé de mettre 500 euros chaque mois sur mon PEA... J'ai aussi ouvert un LEP où j'ai déposé  7k euros sur les un peu plus de 15k euros qui dorment sur mon compte courant....\nJe me demande maintenant quelle est la meilleure façon d'investir dans mon PEA... Je suis une stratégie ETF qui me permet de me diversifier facilement avec de bons rendements. J'essaie d'atteindre une exposition d'environ 60 % aux États-Unis via le SP500, 20 % sur l'Europe via l'etf BNP et le reste, je ne le sais pas encore..... Au début j'ai investi dans le Nasdaq 100 et un autre ETF SP500 mais j'ai vite changé d'avis à cause des frais de gestion haha (je les ai gardé par défaut...mais maintenant il y a beaucoup de doublons...entre les garder ou les vendre je ne sais pas quelle est la meilleure approche)\nAussi, j'achète des ETF tous les 3-4 mois environ, je ne sais pas si c'est une bonne stratégie mais je me dis que j'ai moins de frais pour passer des ordres que si je les achetais tous les mois🤷‍♂️\n\nVoilà, n'hésitez pas à donner vos avis 🤝🙏",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.235,
                    "post_polarity": 0.1,
                    "post_subjectivity": 2.3499999999999996,
                    "comments_weighted_polarity": 0.9859615384615383,
                    "combined_sentiment": 0.9859615384615383
                },
                {
                    "reddit_id": "1myyy0y",
                    "created_utc": 1756050137.0,
                    "date": "2025-08-24",
                    "title": "SP500 - Volvimos a una burbuja",
                    "title_key": "sp500 volvimos a una burbuja",
                    "body": "Hablemos de la burbuja (porque, por supuesto, nunca somos nosotros quienes exageramos):\n\n**No es un delirio total... pero sí huele a burbuja.**\n\n1. **Valoraciones disparadas** El S&P 500 alcanzó un máximo histórico el 15 de agosto de 2025, cerrando en torno a 6468 puntos. Su relación precio-ventas (P/S) está en 3,19, muy por encima del promedio histórico de 1,88. Eso no es normal, es casi neurótico.\n2. **Concentración extrema** Tres gigantes (Nvidia, Microsoft y Apple) representan más del 21 % del índice. No es diversificación; es poner todos los huevos de fiesta en la misma canasta.\n3. **Indicadores clásicos gritando “¡alarma!”** El ratio Shiller CAPE (precio ajustado por ganancias de 10 años) está por las nubes, cerca de niveles previos a grandes caídas como 1929 o 1999. Albert Edwards, el tipo que adivinó la burbuja puntocom, está alertando de una “bubble total” que incluye acciones, vivienda y todo lo demás.\n4. **Advertencias de los expertos** SocGen señala que si el índice llega a 7500 (un 19 % más), entraríamos en terreno de burbuja tipo puntocom. Y Fed insinuó acercarse a recortes de tasas, lo que seguramente alimentaría aún más el fuego.\n5. **AI y exceso de entusiasmo justificándolo todo** La narrativa de la inteligencia artificial lo respalda todo: algunos dicen que es crecimiento real; otros, que es solo humo especulativo. Incluso el CEO de OpenAI advirtió sobre una burbuja en el sector.\n\nSí, vivimos en un mundo donde el S&P 500 parece una burbuja inflándose con aire caliente, concentración extrema y narrativa de IA como pegamento emocional. No es una explosión inminente... pero pocos se aventuran a decir que esto tenga una base sostenible.\n\nEdit:  \n[https://www.businessinsider.com/stock-market-crash-famed-market-bear-warns-of-everything-bubble-2025-7](https://www.businessinsider.com/stock-market-crash-famed-market-bear-warns-of-everything-bubble-2025-7)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -2.016084183673469,
                    "post_polarity": -0.2517857142857143,
                    "post_subjectivity": 8.007142857142856,
                    "comments_weighted_polarity": -0.3120435450299523,
                    "combined_sentiment": -0.3120435450299523
                },
                {
                    "reddit_id": "1myqsvw",
                    "created_utc": 1756026541.0,
                    "date": "2025-08-24",
                    "title": "Inversion, ingresos extras",
                    "title_key": "inversion ingresos extras",
                    "body": "Buenas, trabajo en remoto para una tecnologica, soy joven y vivo en casa de mis padres lo que me permite ahorrar unos 800€ al mes, tengo ya unos 4k ahorrados, y me gustaría saber cuál es la mejor forma de poder tener algo más en un futuro o el dinero que vaya ahorrando no pierda su valor por la inflación, amigos me han dicho que le meta dinero al SP500,¿Vosotros qué haríais en mi caso? Muchas gracias ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -0.9375,
                    "combined_sentiment": -0.9375
                },
                {
                    "reddit_id": "1myurul",
                    "created_utc": 1756039923.0,
                    "date": "2025-08-24",
                    "title": "Bolsa Brasileira Vs Top 10 Us stocks",
                    "title_key": "bolsa brasileira vs top 10 us stocks",
                    "body": "Investir no US é quase que obrigatório.\n\nO top 15 dos EUA individualmenre valem mais que toda bolsa brasileira em valor de mercado \n\nApenas a alphabet a 5 colocada no SP500 equivale a mais de três vezes o Ibovespa em valor de mercado.\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 2.75,
                    "post_polarity": 0.5,
                    "post_subjectivity": 5.5,
                    "comments_weighted_polarity": -0.03190406976744187,
                    "combined_sentiment": -0.03190406976744187
                },
                {
                    "reddit_id": "1mzebqg",
                    "created_utc": 1756087620.0,
                    "date": "2025-08-24",
                    "title": "Nvidia earnings set to test AI trade with stocks near record highs",
                    "title_key": "nvidia earnings set to test ai trade with stocks near record highs",
                    "body": "Stocks ended the week in rally mode after Federal Reserve Chair Jerome Powell opened the door for a September interest rate cut.\n\nIn the week ahead, earnings from Nvidia (NVDA) will see the world's largest company and AI leader test a summer rally that has stocks back near record highs.\n\nAfter slump earlier in the week, a massive surge following Powell's comments in Jackson Hole left the Dow Jones Industrial Average (\\^DJI) at a record high and other indexes roaring. The S&P 500 (\\^GSPC) rose 0.3% on the week, while the Nasdaq Composite (\\^IXIC) slipped 0.5%. The Dow gained 1.5%.\n\nNvidia's quarterly earnings release after the bell on Wednesday will be the week's key event, with updates on inflation, GDP growth, home sales, and consumer sentiment featuring on an economic calendar that will be busier than the earnings calendar.\n\nOutside of Nvidia, reports from Dell (DELL), Dick's Sporting Goods (DKS), Best Buy (BBY), Dollar General (DG), and Abercrombie & Fitch (ANF) will serve as the corporate highlights.\n\n  \nThe door has 'opened wider'\n\nDuring what was likely his final speech at the Jackson Hole Symposium as Fed chair, Jerome Powell told the audience the \"shifting balance of risks may warrant adjusting our policy stance.\" For investors, the words \"may warrant\" became a green light on rate cuts next month.\n\nMarkets rallied in kind.\n\nIn his speech, Powell highlighted that \"downside risks to employment are rising,\" while \"a reasonable base case is that the effects \\[of tariffs on inflation\\] will be relatively short-lived.\"\n\nJPMorgan's chief US economist, Michael Feroli, told clients in a note on Friday Powell's comments indicated the \"door to a September cut opened wider.\" And market pricing suggested as much — investors were placing 85% odds on Friday that Fed will cut interest rates by a quarter of a percentage point at its September meeting, per the CME FedWatch Tool.\n\nMy recent watchlist: LLY, META, NXST, TGNA, MAAS, GOOGL",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.4228762436224491,
                    "post_polarity": 0.08339285714285717,
                    "post_subjectivity": 5.070892857142857,
                    "comments_weighted_polarity": 1.1039381218112245,
                    "combined_sentiment": 1.1039381218112245
                },
                {
                    "reddit_id": "1myrq2u",
                    "created_utc": 1756029986.0,
                    "date": "2025-08-24",
                    "title": "Investing $1,000 in Each of These Growth Stocks Could Go a Long Way for Patient Investors @themotleyfool #stocks $ON $ASML $GOOGL $^IXIC $^GSPC $TSM $NVDA $LEU $GOOG",
                    "title_key": "investing $1 000 in each of these growth stocks could go a long way for patient investors @themotleyfool #stocks $on $asml $googl $^ixic $^gspc $tsm $nvda $leu $goog",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": -0.22999999999999998,
                    "post_polarity": -0.05,
                    "post_subjectivity": 4.6,
                    "comments_weighted_polarity": -0.22999999999999998,
                    "combined_sentiment": -0.22999999999999998
                }
            ],
            "post_count": 15,
            "average_combined_sentiment": -0.2068086034993058
        },
        "2025-08-25": {
            "date": "2025-08-25",
            "posts": [
                {
                    "reddit_id": "1n0eflj",
                    "created_utc": 1756189654.0,
                    "date": "2025-08-25",
                    "title": "S&P 500 Returns Over Nearly a Century: $1 → $668",
                    "title_key": "s&p 500 returns over nearly a century $1 → $668",
                    "body": "1. From 1928 to 2024, the S&P 500 delivered an inflation-adjusted annualized real return of 6.9%.\n2. A $1 investment grew to $668.33 by 2024, despite experiencing 15 recessions—an average of one every six years.\n3. Long-term investing in the S&P 500 has shown strong wealth-building potential, effectively navigating both inflation and economic cycles.\n\n**Data source: YCharts, Creative Planning**\n\npotential stocks for today? INHD, PLTR, CRCL, UNH, AIFU, AMD",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.4299382716049385,
                    "post_polarity": 0.20925925925925926,
                    "post_subjectivity": 6.833333333333334,
                    "comments_weighted_polarity": 1.4299382716049385,
                    "combined_sentiment": 1.4299382716049385
                },
                {
                    "reddit_id": "1n0a196",
                    "created_utc": 1756175025.0,
                    "date": "2025-08-25",
                    "title": "IBKR up 4% afterhours since inclusion in SP500 - Who got free referral stock?",
                    "title_key": "ibkr up 4% afterhours since inclusion in sp500 who got free referral stock",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 3.28,
                    "post_polarity": 0.4,
                    "post_subjectivity": 8.2,
                    "comments_weighted_polarity": 0.8868749999999997,
                    "combined_sentiment": 0.8868749999999997
                },
                {
                    "reddit_id": "1n074zl",
                    "created_utc": 1756167053.0,
                    "date": "2025-08-25",
                    "title": "#IBKR Interactive Brokers to be included in S&P500 on August 28, 2025",
                    "title_key": "#ibkr interactive brokers to be included in s&p500 on august 28 2025",
                    "body": "**BIG NEWS!** The S&P500 just announced a rebalance and **Interactive Brokers #IBKR** will be joining the S&P 500 on August 28th, replacing Walgreens Boots Alliance #WBA.\n\nThis is a MASSIVE win for #IBKR, but some investors were genuinely hoping for #HOOD or #SOFI to get the nod.\n\nSo why #IBKR? Its consistent profitability, strong balance sheet, and impressive market leadership likely made it the safer, more mature choice for the index.   \n  \nWhile #HOOD and #SOFI are exciting growth stories, #IBKR's established financials and global reach arguably fit the S&P 500's criteria for stability and scale better.\n\nCongratulations to #IBKR on this well-deserved inclusion! Could #HOOD or #SOFI be next?  \n  \nMoneyvize's AI-powered platform helps you instantly compare the fundamentals and growth trajectories of these fintech titans to understand the reasoning behind such pivotal market decisions. Analyze smarter! Login Now!  \n  \n\\#IBKR #WBA #HOOD #SOFI #SP500 #Investing #Fintech #AIPowered #Moneyvize #StocksinFocus #InteractiveBrokers  \nNot investment advice.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.5604688942751617,
                    "post_polarity": 0.2731359649122807,
                    "post_subjectivity": 5.713157894736843,
                    "comments_weighted_polarity": 1.5604688942751617,
                    "combined_sentiment": 1.5604688942751617
                },
                {
                    "reddit_id": "1n05hg0",
                    "created_utc": 1756162716.0,
                    "date": "2025-08-25",
                    "title": "See ya Walgreens!",
                    "title_key": "see ya walgreens",
                    "body": "Walgreens kicked out of the S&P 500!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -0.64,
                    "combined_sentiment": -0.64
                },
                {
                    "reddit_id": "1n047l7",
                    "created_utc": 1756159523.0,
                    "date": "2025-08-25",
                    "title": "Chase 5% savings promotions had ended for me. Which alternative?",
                    "title_key": "chase 5% savings promotions had ended for me which alternative",
                    "body": "Chase was great for the 6 month boosted savings itnerest but its ended and im at 2% interest now.  \nI've put most of my savings in the SP500 but would be nice to get some interest paid on the left over cash.   \nWhat savings account did you guys move to? I heard Trading212 is good at 4%",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 3.1875999999999998,
                    "post_polarity": 0.5199999999999999,
                    "post_subjectivity": 6.130000000000001,
                    "comments_weighted_polarity": 1.0803457315287226,
                    "combined_sentiment": 1.0803457315287226
                },
                {
                    "reddit_id": "1n00jdo",
                    "created_utc": 1756151098.0,
                    "date": "2025-08-25",
                    "title": "Analysis of the US 10-Year Yield and the US Yield Curve as of 22-08-2025",
                    "title_key": "analysis of the us 10 year yield and the us yield curve as of 22 08 2025",
                    "body": "Hello, \n\n\n\nThe weekly analysis of the US 10-year Treasury yield and the US yield curve is now online.\n\nYou’ll find a comparison of how rates and the yield curve have evolved, as well as the potential impacts on indices such as the S&P 500.\n\n**If you invest in the S&P 500 (SP500 ETF) or even a global ETF (msci world, ...), you should take a deep look at this data to draw your own conclusions.**\n\n\n\nFull analysis here: [https://epargnebourse.fr/taux-10-ans-us.html](https://epargnebourse.fr/taux-10-ans-us.html) (available in English, German, Spanish, Italian, French, ...\n\n\\#S&P500 #SP500 #SPY #10yrTbonds #yieldcurve #US10yr #msciworld\n\n\n\n\n\nhttps://preview.redd.it/t1bypd9ny7lf1.png?width=1070&format=png&auto=webp&s=cf6e41ce206855d9c2edecacdbfbde8b2fa22a42\n\n  \n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.2011242603550296,
                    "post_polarity": 0.04615384615384615,
                    "post_subjectivity": 4.357692307692308,
                    "comments_weighted_polarity": 0.2011242603550296,
                    "combined_sentiment": 0.2011242603550296
                },
                {
                    "reddit_id": "1n00i1q",
                    "created_utc": 1756151008.0,
                    "date": "2025-08-25",
                    "title": "Analyse du Taux 10 ans US et de la courbe des taux US au 22-08-2025",
                    "title_key": "analyse du taux 10 ans us et de la courbe des taux us au 22 08 2025",
                    "body": "Hello, \n\n\n\nL'analyse hebdo du taux US à 10 ans, et de la courbe des taux US est en ligne.\n\nVous trouverez une comparaison de l'évolution des taux et de la courbe des taux, ainsi que les impacts potentiels sur les indices dont le SP500.\n\n**Si vous investissez sur le SP500 (etf SP500) ou même un ETF monde, vous devriez vous intéresser à ces données pour tirer votre propre conclusion**\n\n\n\nAnalyse complète ici : [https://epargnebourse.fr/taux-10-ans-us.html](https://epargnebourse.fr/taux-10-ans-us.html)\n\nhttps://preview.redd.it/1xq6tzgky7lf1.png?width=1070&format=png&auto=webp&s=a80e0bd7e9bd4b9dc054aecf5f31968203ee5886\n\n  \n\n\n\n\n\\#S&P 500, #SP500, #SPY, #10yr Tbonds , #courbe des taux, #taux 10 ans US, #msci world\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -7.5,
                    "post_polarity": -0.75,
                    "post_subjectivity": 10.0,
                    "comments_weighted_polarity": -7.5,
                    "combined_sentiment": -7.5
                },
                {
                    "reddit_id": "1n025i9",
                    "created_utc": 1756154759.0,
                    "date": "2025-08-25",
                    "title": "Any thoughts on this Multi Factor Investing Portfolio for Roth IRA (25 year old)",
                    "title_key": "any thoughts on this multi factor investing portfolio for roth ira 25 year old",
                    "body": "Haven't actually invested in these yet. I would like to be more riskier in my Roth IRA and I've come across factor investing and really like the idea behind it. I understand the drawbacks and potential underperformances but I have a long investment horizon (30+ years) and think these factors can help bring a good return on my investments in the long run. Just curious what others have to say or maybe what can be changed/added. Currently my Roth IRA is a 2 fund portfolio with FSKAX/FTIHX.\n\nI've also added in data that compares to the sp500 index. This is assuming you were to invest $10,000 from 2019-present. I understand that this is too recent to really tell if this is a viable strategy but most of these funds only go back as far 2015-2019 so I can't see how they may have performed before those times sadly.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.38166666666666677,
                    "post_polarity": 0.06666666666666668,
                    "post_subjectivity": 5.7250000000000005,
                    "comments_weighted_polarity": 0.2705902213889831,
                    "combined_sentiment": 0.2705902213889831
                },
                {
                    "reddit_id": "1mzx3x9",
                    "created_utc": 1756143398.0,
                    "date": "2025-08-25",
                    "title": "Depotwechsel TR -> ING",
                    "title_key": "depotwechsel tr > ing",
                    "body": "Ich habe bei der ING meine Konten, und bei TR mein Depot, auf dem quasi nur der SP500 und eine Schrottaktie liegt. Gibt es aus Nachteile, Kosten oder andere Unannehmlichkeiten, wenn ich mein Depot zur ING übertrage?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.16,
                    "combined_sentiment": 0.16
                },
                {
                    "reddit_id": "1mzroym",
                    "created_utc": 1756131383.0,
                    "date": "2025-08-25",
                    "title": "SP500 e PAC SWDA",
                    "title_key": "sp500 e pac swda",
                    "body": "Ciao ragazzi attualmente data la possibilità ho intrapreso da marzo 2025 un PAC su SWDA di 200€ poi portato di recente a 1000€ adesso siamo intorno ai 6300€ ( ho fatto un PIC). Nel mio portafoglio ho 6300€ ad agosto 2025 su SWDA e 12000€ su S&P500 di Vanguard. Si lo sono molto sovraesposto su USA, la mia idea sarebbe di tenermi SWDA per un lungo periodo +20 anni e S&P500 intorno ai 15/20 anni. Siccome tra poco disporrò di una cifra intorno ai 20/25 K che erano di vecchi buoni postali la mia idea era di fare un PIC sul S&P500 e tenerlo là buono senza andare a togliere o aggiungere e infine quando avrei raggiunto un altro po di liquidità di diversificare tra un 5/7 anni.  attualmente preferisco mantenere questi due poi mi affiderei a un consulente indipendente. Come la valutereste come strategia ? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.546875,
                    "post_polarity": -0.125,
                    "post_subjectivity": 4.375,
                    "comments_weighted_polarity": -0.6713787774725275,
                    "combined_sentiment": -0.6713787774725275
                },
                {
                    "reddit_id": "1mznqq6",
                    "created_utc": 1756120800.0,
                    "date": "2025-08-25",
                    "title": "Αποταμίευση/επένδυση μικροποσών μηνιαίως",
                    "title_key": "αποταμίευση/επένδυση μικροποσών μηνιαίως",
                    "body": "Καλησπέρα σε όλους.\n\nΠροσεχώς 40 αλλά ακόμα αρχάριος στο θέμα, σκέφτομαι να ξεκινήσω (αργά απ'ο,τι φαίνεται) να βάζω κάποια χρήματα, μικροποσά 100-200 ευρώ το μήνα στην άκρη.\n\nΗ ιδέα της \"ασφαλούς\" επένδυσης σε κάτι τύπου SP500 μου φαίνεται κάπως καλύτερη συγκριτικά με τους διαθέσιμους HYSA όπως ο π.χ. της revolut.\n\nΠαρ'όλα αυτά, θα ήθελα τις απόψεις σας πανω στο θέμα, και ει δυνατόν τις προτιμήσεις σας σε κάποια εταιρία/ίδρυμα. Έχω ήδη λογαριασμό στην IBKR ο οποίος ακόμα δεν έχει απολύτως τίποτα βέβαια αλλά έχω ακούσει καλά λόγια και για την t212.\n\nΒασικό για μένα είναι επίσης να μπορώ να έχω πρόσβαση στα χρήματα ανά πάσα στιγμή, δεν θεωρώ πως είμαι τέρμα άνετος ώστε να τα πετάξω και να τα ξεχάσω, αν και προφανώς θα ήταν θεμιτό.\n\nΕυχαριστώ προκαταβολικά! ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1mzr8g7",
                    "created_utc": 1756130305.0,
                    "date": "2025-08-25",
                    "title": "Analiza rynku amerykańskiego",
                    "title_key": "analiza rynku amerykańskiego",
                    "body": "Znudzony tymi samymi wątkami na subie o portfel, dywersyfikacje i jak zacząć stwierdziłem, że podzielę się swoją analizą rynku. Krótko o mnie: na rynku od blisko dekady, zajmuje się tym każdego dnia,najpierw byłem etfiarzem, potem inwidualne akcje, od 5 lat ror wyższy niż głównych indeksów polskich/amerykańskich, ytd \\~+25%, ostatni rok +47% (w $).\n\n**Disclaimer:** \n\n1. jeżeli kupujesz etfy i robisz dca poniższa analiza nie będzie miała dla ciebie wartości. \n\n2. analiza dotyczy subiektywnie wybranych zestawów danych\n\nKażdy rynek cechuje się sezonowością, w przypadku rynku amerykańskiego średnio najlsilniejszymi kwartałami jest Q1 i Q4 a najsłabszymi Q2 i Q3. Pytanie, które poddam poniższej analizie brzmi: Czy obecnie uzasadniona jest mniejsza ekspozycja na rynek? Nie chodzi mi tutaj o dywersyfikacje geograficzną tylko ekspozycje w sensie 100% long (fully invested) -100%(fully short). Przeanalizowałem ostatnią dekadę szukając miejsc (lokalnych szczytów) po których miejsce miała korekta w trakcie trendu wzrostowego na **SPX** (sp500) stosując **stage analysis Weinsteina**, znalazłem 5 takich miejsc. 28.03.2024, 31.07.2023, 02.09.2020, 01.05.2019, 23.08.2016. \n\nZwracałem uwagę na: \n\n1. **NAAIM INDEX**: tygodniowa miara średniej ekspozycji na akcje wśród aktywnych menedżerów inwestycyjnych w NAAIM\n2.**% akcji powyżej 200d sma (MMTH w TV)**: dla części analityków technicznych, jeżeli akcje pozostają powyżej 200 dniowej zwykłej średniej kroczącej (około rok kalendarzowy) jest to uznawane za pozostawanie w trendzie wzrostowym\n3.**VIX**: to indeks rynkowy czasu stosowany do oceny nastrojów rynkowych i postrzeganego ryzyka. Reprezentując oczekiwaną zmienność indeksu S&P 500 w ciągu najbliższych 30 dni, VIX działa jak barometr strachu i niepewności.\n\n**Wnioski:**\nW szczycie przed korektą w analizowanych okresach NAAIM INDEX pokazywał wartości od wysokich 70 do 100, MMTH od 50 do \\~70. 4/5 korekt pojawiło się w Q2/Q3. VIX w 4/5 przypadków znajdował się w zasięgu 12.37-14.80 (oprócz 02.09.2020 covid- 26.57). Korekty trwały od 15 do 63 świec dziennych, spadek w tym czasie wynosił od \\~5% do 10%. Wzrosty po korektach trwały od 202 do 390 świec dziennych, wzrost w tym czasie wynosił od \\~15% do \\~34%.\n\n**Ostatnie dane za 22.08.2025: NAAIM INDEX: 98.15, MMTH:61.35, VIX: 14.21**  \n\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.10375000000000001,
                    "post_polarity": -0.025,
                    "post_subjectivity": 4.15,
                    "comments_weighted_polarity": 0.5344196428571429,
                    "combined_sentiment": 0.5344196428571429
                },
                {
                    "reddit_id": "1mzn6jx",
                    "created_utc": 1756118989.0,
                    "date": "2025-08-25",
                    "title": "Investiranje na revolut za pocetnike",
                    "title_key": "investiranje na revolut za pocetnike",
                    "body": "Pozdrav, imam revolut vec neko vrime ali se ne razumin u investiranje niti malo, sezona mi se blizu kraju pa imam neke novce sto bi volio uloziti (sp500, etf itd) tipa stavim 2-3 tisuce u startu pa ako ima opcija za postavljanje automatksi mjesecno storinjak eura na dugorocno.\n\nJel moze kakvih tipova od iskusnijih ljudi koji su vec odavno zakoracili u sve to.\n\nHvala",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.469824074074074,
                    "combined_sentiment": 0.469824074074074
                },
                {
                    "reddit_id": "1mzmrrf",
                    "created_utc": 1756117552.0,
                    "date": "2025-08-25",
                    "title": "Wie Geld anlegen?",
                    "title_key": "wie geld anlegen",
                    "body": "Hì zusammen, \n\nSind ne Kleine Familie und haben für 900k€ ein Einfamilienhaus gebaut. Es stehen noch 580k€ aus ( Kreditlaufzeit: 10j, 7j verbleiben noch) die mit mtl 3650€ bezahlt werden.\n\nSituation ist nun wie folgt:\nIch verkaufe steuerfrei ein Haus für 460k. \nAm Kapitalmarkt sind ~5% rendite in nem  etf realistisch, 25k€ könnte ich jährlich sondertilgen. \n\nSondertilgen (safe) vs. investieren (unsicher)..das ist hier die Frage....\nUnd wenn investieren dann 80% \nIn nen World und 20 % in Einzeltitel oder 100% Word bzw. 100% in nen SP500?\n\nWas sind eure Denkanstöße/\n IDEEN?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 2.75,
                    "post_polarity": 0.5,
                    "post_subjectivity": 5.5,
                    "comments_weighted_polarity": 0.18375,
                    "combined_sentiment": 0.18375
                }
            ],
            "post_count": 14,
            "average_combined_sentiment": -0.1452887629563197
        },
        "2025-08-26": {
            "date": "2025-08-26",
            "posts": [
                {
                    "reddit_id": "1n143km",
                    "created_utc": 1756258471.0,
                    "date": "2025-08-26",
                    "title": "Volatility Targeted Leveraged Portfolio Using Allocate Smartly – A Systematic trader view --Looking for Feedback!!",
                    "title_key": "volatility targeted leveraged portfolio using allocate smartly a systematic trader view looking for feedback",
                    "body": "I’m a systematic trader exploring tactical allocation and found Allocate Smartly very interesting from a quantitative perspective. I’ve built a model portfolio using 4 of their best META strategies, chosen for walk-forward optimization, which I consider the most robust way to backtest.\n\nPortfolio metrics:\n\n* Annualized return: 13.2%\n* Annualized volatility: 7.3%\n* Max end-of-month drawdown: 7.1%\n\nI modeled a $100,000 account leveraged to 15% volatility, an approach used by hedge funds like Bridgewater, who typically use futures for capital efficiency (harder with small accounts due to contract sizes).\n\n**Leverage calculations:**\n\nLeverage = 15 ÷ 7.3 ≈ 2.055×\n\nBorrowed ≈ $105,500\n\nGross leveraged return ≈ 27.1% p.a.\n\nMax Historical EOM drawdown ≈ 7.1 × 2.055 ≈ 14.5%\n\nBorrowing cost (5.8% margin rate for lower tiers from Interactive Brokers) ≈ 6.12% p.a.\n\n**Expected net return ≈ 21.0% p.a.**\n\nI haven't included Trading fees as Allocate Smartly states these are already included in their back tests.\n\n\\*\\* Coming from a systematic trading background, I am tempted to apply a 30% degradation factor ( As back tests are always somehow optimized even if walk forwarded):\n\n**70% of 21%=14.7% p.a.**\n\nIn reality some ETFs like SPY etc pay out dividends which are not computed in the model portfolios, therefore these may offset some of the borrowing costs, but this remains too hard to compute.\n\nSo here is my take on a systematic 15% target volatility portfolio. With monthly rebalancing, 150% the performance of SP500 and 30% its risk, even in events like the .com bubble and credit crunch crisis.\n\nI am sharing this to validate the approach and get some feedback. This is an open discussion so feel free to stress test the idea.\n\nWhat would be the risks of such a strategy when implemented live? I can think the obvious margin call if the drawdown deviated from the historical one. Solutions: don't go all in from the beginning but start with the original allocation and increase leverage to the target volatility at the first drawdown event.\n\nAny more thoughts?\n\nI am attaching the screenshot form the model portfolio I have modeled against the 60/40 benchmark, which was the starting point of the discussion ( not the leveraged model).\n\nhttps://preview.redd.it/i4vjp9k3tglf1.png?width=580&format=png&auto=webp&s=cd167ba7bc511fa080e932a36092b335679531b9\n\nhttps://preview.redd.it/2bb7hak3tglf1.png?width=1275&format=png&auto=webp&s=f144486c2adca5467b836d4f586533c0d24652c4\n\nhttps://preview.redd.it/zr53iak3tglf1.png?width=1273&format=png&auto=webp&s=e956b668e0e5800e1f8ed00dcf91140de6817a57",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.5459331931232686,
                    "post_polarity": 0.1279668248418248,
                    "post_subjectivity": 4.266208791208792,
                    "comments_weighted_polarity": 0.3862870024707981,
                    "combined_sentiment": 0.3862870024707981
                },
                {
                    "reddit_id": "1n11yy8",
                    "created_utc": 1756252544.0,
                    "date": "2025-08-26",
                    "title": "Fast food has lagged the SP500. Their comeback story... beverages?",
                    "title_key": "fast food has lagged the sp500 their comeback story beverages",
                    "body": "Fast‑food chains have struggled with fewer customer visits and sluggish sales since last year. \n\nThe reason for all this: price hikes and to a lesser extent, shifting consumer tastes.\n\nBut they have a comeback plan... beverages. \n\nIt makes sense when you think about it. Beverages have higher margins than food, require less labor to make, and have simpler supply chains (and longer shelf life in most cases).\n\nThere is plenty of room for growth. Many customers skip drinks when placing meal orders, so it’s an easy boost if they are enticed to add one. Bold flavors and attractive visuals could fuel spontaneous purchases.\n\n**## McDonald’s Leads the Charge**\n\nMcDonald's recently announced plans to test a range of cold coffees, fruity refreshers, crafted sodas, and energy drinks in 500 US restaurants, starting next month.\n\nMcDonald’s wants to lure customers at all times of the day—from the morning boost to evening. “We’re not just serving drinks—we’re creating new reasons to visit, new ways to enjoy, and new moments to savor,” said Buetikofer.\n\n[image](https://d2qkqhh60b0n0e.cloudfront.net/images/6e06c931-3660-4a8d-8368-c97de5554eda)\n\n**## Rivals Follow Quickly**\n\nJust a day after McDonald’s revealed its beverage expansion, Burger King followed with an announcement of its own—rolling out a summer lineup featuring lemonades and iced coffee topped with flavored cold foam.\n\nWendy’s joined in as well, adding cold brew with cold foam and fruit-flavored energy drinks to its seasonal menu. “Beverage innovation will be a key enabler of growth across multiple dayparts, especially breakfast and snacking occasions,” interim CEO Ken Cook told investors on a recent earnings call.\n\nTaco Bell has taken an even bolder step. Last December, it opened a “Live Más Café” inside a California location, offering more than 30 signature beverages, from caffeinated aguas frescas to churro-inspired frappes. The concept, the company explained, was designed around Gen Z’s appetite for customized drinks.\n\n[image](https://d2qkqhh60b0n0e.cloudfront.net/images/c588dd99-f176-4d80-9129-51db366bb4ee)\n\nSix months in, the test proved promising: sales at the café jumped 40%, prompting Taco Bell to announce plans for 30 more cafés by year’s end. On top of that, the chain rolled out a nationwide lineup of Refrescas, including a strawberry–passion fruit green tea and a pineapple–lime energy drink. The long-term target: $5 billion in beverage sales by 2030.\n\n**## The Risks**\n\nNovelty and social media buzz can drive short-term hype, but drinks are a “nice-to-have, not a must-have,” warns Neuberger Berman analyst Kevin McCarthy. When budgets tighten, they’re the first item cut.\n\nOperational complexity is another hurdle. Too many customizations can slow service—something even Starbucks had to confront by trimming its menu. “You don’t want to lose a burger customer because someone’s drink order is holding up the drive-thru,” notes BTIG analyst Peter Saleh.\n\nChains are aware of this. Wendy’s says its new energy drinks run through the existing soda fountain, while cold foam add-ins are simple to execute.\n\nMy takeaway from this, take a closer look at Wendy's. The stock is down 38% in the past year, I want to understand why and see if there's an opportunity there. More research to follow!\n\n\n-----\n\n[View the original post on Flank](<https://www.flankinvesting.com/p/e26f185e-ed1b-4061-806b-e7946e200e86?utm_source=reddit&utm_medium=flankinvesting&utm_campaign=n8n>)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.5668796861989996,
                    "post_polarity": 0.10410487857296366,
                    "post_subjectivity": 5.445274937828129,
                    "comments_weighted_polarity": 0.5668796861989996,
                    "combined_sentiment": 0.5668796861989996
                },
                {
                    "reddit_id": "1n11f3e",
                    "created_utc": 1756251081.0,
                    "date": "2025-08-26",
                    "title": "Potential boost to NAV for ULTY next week",
                    "title_key": "potential boost to nav for ulty next week",
                    "body": "https://x.com/Mr_Derivatives/status/1960484286534160671\n\nApparently Mr. Heisenberg thinks either HOOD or APP will be added to the SP500 next week, either way will have the potential to boost ULTY's NAV when it's announced.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.052300000000000006,
                    "post_polarity": 0.01,
                    "post_subjectivity": 5.23,
                    "comments_weighted_polarity": 0.6714983217592593,
                    "combined_sentiment": 0.6714983217592593
                },
                {
                    "reddit_id": "1n104zm",
                    "created_utc": 1756247755.0,
                    "date": "2025-08-26",
                    "title": "Alocar dinheiro em bitcoin",
                    "title_key": "alocar dinheiro em bitcoin",
                    "body": "Até hoje so estou a alocar dinheiro em ETF que replica o SP500, estou a pensar começar a locar algum em bitcoin, o que acham?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.2558823529411765,
                    "combined_sentiment": 0.2558823529411765
                },
                {
                    "reddit_id": "1n0zkww",
                    "created_utc": 1756246357.0,
                    "date": "2025-08-26",
                    "title": "Points d’amélioration PEA",
                    "title_key": "points d amélioration pea",
                    "body": "Voici mon PEA actuel. Il y a environ 2/5 de sp500, 1/5 de MSCI émergeant, 1/5 de Russell 2000 et 1/5 du reste. \n\nJ’ai pour projet de rééquilibrer en augmentant la part d’Europe. Pour cela je me demandais si c’était une bonne idée de supprimer le Japon.\nJe me demande également s’il ne serait pas plus simple de remplacer le sp500 par un msci world.\nJe ne sais pas trop quoi penser de Sanofi, le garder est-ce vraiment utile d’un point de vue défensif? Je l’ai surtout acheté car son cours me paraît actuellement assez bas.\nPour finir, je cherche une action éligible pea sous-évalué. J’en ai déjà plusieurs sous la main comme Reworld Media par exemple.\nJ’attends vos avis et d’autres suggestions !",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.34650793650793654,
                    "post_polarity": 0.10277777777777779,
                    "post_subjectivity": 3.3714285714285714,
                    "comments_weighted_polarity": -2.3211640211640208,
                    "combined_sentiment": -2.3211640211640208
                },
                {
                    "reddit_id": "1n0xsql",
                    "created_utc": 1756242115.0,
                    "date": "2025-08-26",
                    "title": "Allocation REER",
                    "title_key": "allocation reer",
                    "body": "Bonjour, \n\nJ'ai fait le transfert de mon REER qui était avec la Sunlife vers Wealthsimple, pour diminuer les frais annuels et avoir droit à 1% de remise avec WS. \n\nToutes mes actions détenues par la Sunlife ont été vendues (pas possible de transférer les actions), donc je me retrouve à devoir refaire complètement mon allocation avec le montant transféré. \n\nComment répartiriez-vous vos actions si vous deviez recommencer à 0 à partir en 2025? Je suis OK avec les risques du marché, à Sunlife j'avais 75% de mes actions environ qui trackait le SP500. Je suis dans la trentaine avec un fond de retraite public. ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.95,
                    "post_polarity": 0.16666666666666666,
                    "post_subjectivity": 5.7,
                    "comments_weighted_polarity": 1.577908163265306,
                    "combined_sentiment": 1.577908163265306
                },
                {
                    "reddit_id": "1n0un8i",
                    "created_utc": 1756234897.0,
                    "date": "2025-08-26",
                    "title": "Etf Sparpläne",
                    "title_key": "etf sparpläne",
                    "body": "Ich weiß, langweilig bla bla, mein Plan:\n\n1000€ ftse all world\n100€sp500\n100€ vaneck videogames&esport(Leidenschaft Gaming)\n\nWas sind eure long Term Invests bzw eure etfs falls ihr sie habt?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.22999999999999998,
                    "post_polarity": -0.05,
                    "post_subjectivity": 4.6,
                    "comments_weighted_polarity": 0.525,
                    "combined_sentiment": 0.525
                },
                {
                    "reddit_id": "1n0qn2y",
                    "created_utc": 1756225946.0,
                    "date": "2025-08-26",
                    "title": "Strategy for Investing in Regular Brokerage accounts?",
                    "title_key": "strategy for investing in regular brokerage accounts",
                    "body": "Right now I have VTI+VXUS in my ira, vanguard 2070 fund in 401k. I am not really investing in my regular brokerage account however with a lot of spare cash lying around in my high yield savings, so I'm looking to invest that money. Should I run the same VTI+VXUS holdings in my regular brokerage account as well, or try something else? Thinking about just going VT there, or try something a little riskier like other sp500 momentum etfs. I'm 22 if that matters",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.012940593929879637,
                    "post_polarity": 0.0036904761904761885,
                    "post_subjectivity": 3.5064835164835166,
                    "comments_weighted_polarity": 0.3256176502423314,
                    "combined_sentiment": 0.3256176502423314
                },
                {
                    "reddit_id": "1n0v2mm",
                    "created_utc": 1756235879.0,
                    "date": "2025-08-26",
                    "title": "Buying a bigger apartment/house with FIRE in mind",
                    "title_key": "buying a bigger apartment/house with fire in mind",
                    "body": "Hi all, \n\nMy partner and I (both 30yo) are considering buying a new apartment/house. We currently own an apartment in Amsterdam. This place suits us well, we do not need to move although the extra bedroom would be nice as we both work from home.\n\n  \nWe would like to FIRE within the next 20 years. If we FIRE we would move out of the Netherlands to a cheaper country and sell the apartment.\n\nDoes it make sense for us to get a bigger/better apartment to hopefully sell it for a bigger profit in the future or are we speculating too much and should just keep doing what we are doing? Would your answer change if we were to move out of the Netherlands (not necessarily FIRE) in 5,10 or 15 years?\n\nWould it make sense to invest the equity from our current place into ETFs and get a bigger second mortgage or just put it all into the new property? (still trying to understand the tax implications here)\n\n**Current property:**\n\n* Purchased in 2022. 85m2, early 2010s built, A label, 2 bedrooms, private parking space and erfpacht paid off.\n* Purchase price: €490k \n* Mortgage: €475k\n* Remaining mortgage: €435k \n* 30 years annuity mortgage with 1.76% interest rate fixed for 10y (1.61% now due to the lower tariefklassen)\n* Monthly cost: €1550 netto mortgage, €200 vve and €150 bills = **€1900 all in**\n* Estimated current value: €520-550k\n\n**Properties we are looking at:**\n\n* Apartment/House around 120m2, 3 bedrooms, newish, A label, roof terrace or garden and ideally low or paid off erfpacht.\n* Price around €700k\n\n**Finances:**\n\n* Combined income incl. bonus €155k brutto. €8.2k netto per month excluding bonus.\n* €95k invested in SP500 and Europe ETF.\n* €2k invested each month (+ a good chunk of the bonus once a year)\n* No other debt\n* €10k rainy day fund\n\nWe are meeting with a mortgage advisor to understand more regarding the mortgage implications like transferring our current mortgage, equity transfer to the new place and the bridging loan.\n\n  \nThank you for your suggestions!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.5844866420729622,
                    "post_polarity": 0.1223339160839161,
                    "post_subjectivity": 4.7777972027972035,
                    "comments_weighted_polarity": 0.7022069947528702,
                    "combined_sentiment": 0.7022069947528702
                },
                {
                    "reddit_id": "1n0pkqq",
                    "created_utc": 1756223516.0,
                    "date": "2025-08-26",
                    "title": "Beginner advice",
                    "title_key": "beginner advice",
                    "body": "Hey so i recently started investing in vanguard's sp500 ACC etf. \nNow im thinking about adding vanguard's developed market ACC etf. Since im new to this i dont want to make any risky choices. \nFor context, im from Europe so thats why i cant choose the FTSE all world ex. US, it doesnt have a acc option for here.\n Anyway my question is do you think that investing in these two funds (60% sp500, 40% developed markets) is a good choice for long term passive investing?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.7326738980716254,
                    "post_polarity": 0.1643939393939394,
                    "post_subjectivity": 4.456818181818182,
                    "comments_weighted_polarity": 0.6617446857645722,
                    "combined_sentiment": 0.6617446857645722
                },
                {
                    "reddit_id": "1n0l5uk",
                    "created_utc": 1756213155.0,
                    "date": "2025-08-26",
                    "title": "Nasvet za investicije",
                    "title_key": "nasvet za investicije",
                    "body": "Pozdrav, finančno ozaveščeni bralci tega subba\n\n\n\nLetos sem končal gimnazijo in v teh 4 letih pridnega dela prek študenca si prislužil nekaj dinarčkov, ki bi jih nekam vložil. Namreč, nekaj že imam v SP500, ampak me vseeno zanima kaj bi svetovali?\n\n\n\nHvala za odgovore vnaprej",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n0jpvg",
                    "created_utc": 1756209170.0,
                    "date": "2025-08-26",
                    "title": "A few shots",
                    "title_key": "a few shots",
                    "body": "Just a couple of the shots I took on my most recent roll, some Ilford Delta 100. Shot with Pentax Spotmatic SPII, Takumar 55mm F1.8, developed in Ilford ID11 and scanned with Fuji Frontier SP500. Adjusted black and white levels, removed some highlights and added a tiny bit of contrast, straightened and cleaned up",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.12261904761904763,
                    "post_polarity": 0.03333333333333334,
                    "post_subjectivity": 3.678571428571428,
                    "comments_weighted_polarity": 0.4313095238095238,
                    "combined_sentiment": 0.4313095238095238
                },
                {
                    "reddit_id": "1n0jd68",
                    "created_utc": 1756208094.0,
                    "date": "2025-08-26",
                    "title": "Minhas métricas nos EUA",
                    "title_key": "minhas métricas nos eua",
                    "body": "Eu sei que é muito pouco tempo para me achar o ~~warren buffet brasileiro~~ cara que bate o índice, mas queria ver o que acham dessas métricas, dados a partir de 2021 que foi quando comecei a investir nos EUA.\n\nA ideia é a mesma de sempre, uso sites como o finviz, simply wall street e seeking alpha para encontrar boas empresas, além de pegar algumas clássicas como as mag7, nunca vendo, só compro, diversifico o máximo possível não só para mitigar risco mas para tentar capturar mais convexidade, já peguei coisas como 200% em NFLX e PSIX, já tomei uns tombos também, mas nunca vendi. Segue:\n\nhttps://preview.redd.it/5hdke02qmclf1.png?width=1377&format=png&auto=webp&s=7dc86bfb7e59728b1ca86a671a0e428e1c1659b0\n\nhttps://preview.redd.it/e2e6pzrgmclf1.png?width=673&format=png&auto=webp&s=78a7eb9f90b8ce8dc6a5f6c21775ba2c955d2245\n\nEsses aqui confesso que não sabia analisar direito então pedi para a IA.\n\nResumo Geral\n\nO seu investimento parece ter uma forte inclinação para ações de grande capitalização e de crescimento, dadas as altas correlações com os três índices. A análise revela que:\n\n* O fundo consistentemente **gerou Alpha positivo** em todos os benchmarks, indicando uma gestão ativa que conseguiu superar as expectativas de retorno.\n* Em termos de risco, ele é **menos volátil que o QQQ**, mas **mais volátil que o mercado americano em geral (VTI e SPX)**.\n* O **melhor desempenho ajustado ao risco (Information Ratio) foi obtido quando comparado ao S&P 500**, sugerindo que, embora o risco assumido seja maior em relação a este índice, a recompensa em termos de retorno foi mais do que proporcional.\n\nEm suma, os dados indicam uma estratégia de investimento bem-sucedida durante o período analisado, que conseguiu superar consistentemente os principais benchmarks do mercado americano em uma base ajustada ao risco.\n\n**Carteira atual**:\n\nADBE, ALLT, AMZN, DIS, GCT, GOOGL, HD, INTC, KO, LKNCY, LX, META, MOH, MSFT, NFLX, NU, NVDA, PSIX, QQQM, RERE, TSLA, V, VOO, XERS, XP\n\n**Plot Twist**: Apesar de estar batendo o SP500 ainda estou reflexivo se está valendo a pena todo o estudo para encontrar novas ações para a carteira, comprando apenas 3 etfs: VOO, QQQ, SCHD eu estaria obtendo o mesmo retorno com muito menos trabalho.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -2.8428571428571434,
                    "post_polarity": -0.4,
                    "post_subjectivity": 7.107142857142858,
                    "comments_weighted_polarity": -0.03781512605042019,
                    "combined_sentiment": -0.03781512605042019
                },
                {
                    "reddit_id": "1n0kvz3",
                    "created_utc": 1756212422.0,
                    "date": "2025-08-26",
                    "title": "1675€ al mes, me meto en fondos indexados o no es para mi?",
                    "title_key": "1675€ al mes me meto en fondos indexados o no es para mi",
                    "body": "Hola, tengo 23 años y cobro lo que pone en el titulo, me da TOC el tema de la finlación y que el dinero guardado en un banco valga menos y etc etc.....no busco hacerme rico, solamente me gustaría compensar esa inflación........por lo que me informé un poco y leí sobre el sp500 y el msci World y tal...\n\n  \nMi pregunta es, es buena idea ponerme a meter, por ejemplo 50€ al mes en un fondo de msci World en, por ejemplo myInvestor? O eso es mas para gente que tiene mas dinero, es decir, no me vale la pena?\n\n  \nGraciaaaaaaaaas.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -0.018488372093023266,
                    "combined_sentiment": -0.018488372093023266
                },
                {
                    "reddit_id": "1n0iix0",
                    "created_utc": 1756205425.0,
                    "date": "2025-08-26",
                    "title": "What your backtesting SHOULD look like",
                    "title_key": "what your backtesting should look like",
                    "body": "I haven't seen much posts that go in-depth into results and metrics seem lack luster. These are really old backtest results from an ML system that I am still working on. I only backtest on out-of-sample data to prevent overfitting using a 70-30 train-test split. Results are colour-coded depending on if the ML model achieved results above a threshold so I don't waste time analysing a model that looks good but actually sucks. Just having winrate doesn't mean anything. What if your model takes big wins and lots of small losses? How do we know the model is profitable outside other market regimes? How often does drawdown spike? Maybe you're trading with a funded so how do you know that despite being profitable long-term you won't blow the account? My metrics aren't perfect but you guys should have this much, at the very least have a comparison between buy-and-holding an index because what's the point of an underperforming strategy if I could just hold the SP500 and call it a day?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.2500569580078125,
                    "post_polarity": 0.05765625,
                    "post_subjectivity": 4.337031250000001,
                    "comments_weighted_polarity": -1.0121499498982964,
                    "combined_sentiment": -1.0121499498982964
                },
                {
                    "reddit_id": "1n0fo7v",
                    "created_utc": 1756194524.0,
                    "date": "2025-08-26",
                    "title": "Just How Safe Is the Stock Market Right Now? History Has Good News for Investors. @themotleyfool #stocks $^GSPC",
                    "title_key": "just how safe is the stock market right now history has good news for investors @themotleyfool #stocks $^gspc",
                    "body": "[No Content]",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 2.925442176870748,
                    "post_polarity": 0.49523809523809526,
                    "post_subjectivity": 5.907142857142857,
                    "comments_weighted_polarity": 2.925442176870748,
                    "combined_sentiment": 2.925442176870748
                }
            ],
            "post_count": 16,
            "average_combined_sentiment": 0.35250994305436406
        },
        "2025-08-27": {
            "date": "2025-08-27",
            "posts": [
                {
                    "reddit_id": "1n1tzxw",
                    "created_utc": 1756330736.0,
                    "date": "2025-08-27",
                    "title": "Que Banco o broker aconsejaríais ?",
                    "title_key": "que banco o broker aconsejaríais",
                    "body": "Hola \nTengo una cuenta en Kutxabank ligada a vivienda habitual y una en CaixaBank a vivienda de inversión y una Bankinter que venía de evo que apenas uso. \n\nEn Kutxabank hago aportaciones periódicas a fondos de inversión de riesgo medio elevado\n\nTengo además otros fondos en una gestora de patrimonio por unos 40,000€, todo esto a largo plazo\n\nAhora lo que vaya a ahorrar excepto alguna aportación periódica lo quiero para una reforma en 4/5 años en los que estimo ahorrar 60,000€. De momento llevo unos 10,000€ y busco una plataforma que no sea la banca convencional nombrada para hacer depósitos a corto, o una cuenta remunerada (aunque las rentabilidades están muy bajas ya ) o bien un monetario. Me gustaría también que la misma plataforma me permita hacer compra\nEsporádica de acciones (5,000€) con comisiones bajas en usa o Europa, de forma independiente al objetivo de la reforma y los 60,000€\n\nAlguna recomendación sobre cómo ir moviendo ese dinero hasta llegar a los 60,000€? \n\nY algún valor / acción de sp500 a seguir para invertir a medio/Largo plazo ?\n\nGracias!!!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n1rclf",
                    "created_utc": 1756324586.0,
                    "date": "2025-08-27",
                    "title": "Why has Wendy's been pummeled?",
                    "title_key": "why has wendy s been pummeled",
                    "body": "Wendy's has not only lagged the SP500, but has also lagged the Restaurant and Fast Food industries but a significant margin.\n\nTheir stock is down 39% in the past year.\n\n[image](https://d2qkqhh60b0n0e.cloudfront.net/images/436e794f-d1ed-4f26-a600-d57b902542d6)\n\nFirst, they have an interim CEO. The outgoing CEO (Kirk Tanner) left in July of 2025... he moved over to the Hershey company, which he has more experience in consumer-packaged goods.\n\nMr. Tanner's tenure was not filled with glory. Same store sales (an ultra important metric for fast food companies), was fell 2.8% during his time as CEO.\n\nBefore Mr. Tanner departed, he released Wendy's blueprint for growth\n\nIn that document, they said their growth plan is:* Doubling down on our Fresh, Famous Food* Basically updating core menu items and introducing \"Frosty Fusions\" and more brand partnerships (like one announced with Takis)\n\n* Delivering an Exceptional Customer Experience* *yawn*- ok, don't see how this is a growth initiative. But they're talking about AI ordering at drive-throughs...\n\n* Accelerating Global Unit Growth* They want to expand to 300 net new stores in the US and scaling to 2,000 restaurants internationally by 2028\n\n* Investing in a New Financial Algorithm* Basically a note to investors that they are focusing on profitability. They put guidance that they want to growh revenue 5-6% annually over the long term. This is a good base case for projecting growth when I get to the valuation.\n\nWith all of this context, we still got to answer: why has the stock been taken to the woodshed?\n\nAfter a decent bit of research, these are the most prevalent reasons I could find:\n\n**1.&nbsp; Persistent Weak Same-Store Sales in the U.S.*** Wendy’s has seen a sharp decline in same-store sales—sales at locations open for at least 15 months. In Q2, same-store sales dropped **2.9% overall**, including a **3.6% decline in the U.S.** (vs. expected –2.2%)&nbsp;.\n* In Q1, the trend continued: weak U.S. traffic and rising costs hurt profitability, prompting a cut to full‑year outlook.\n\n**2.&nbsp;Macroeconomic Headwinds &amp; Consumer Tightening*** Inflation and cautious consumer spending have pressured discretionary dining, especially among lower-income customers. Breakfast has been particularly hard hit—often the first to go when budgets tighten .\n* Wendy’s is facing high costs for beef and labor, with 2025 guidance projecting commodity inflation of ~1% and wage inflation ~4%.\n\n**3.&nbsp;Strategic Missteps: Overwhelming Promotions*** Wendy’s interim CEO Ken Cook blamed poor U.S. sales on overly complex and confusing promotional campaigns—such as an overloaded “100 Days of Summer” program and a “Meal of Misfortune” tie‑in with Netflix’s *Wednesday*—which diluted effectiveness&nbsp; .\n\n**4.&nbsp;Leadership Change During a Tough Period*** In July, CEO **Kirk Tanner** abruptly left for Hershey, and CFO **Ken Cook** was named interim CEO. This leadership transition occurred amid declining sales and a nearly **31% drop in stock value year‑to‑date**&nbsp; .\n\n**5.&nbsp;Analysts Downgrades &amp; Lower Price Targets*** Loop Capital lowered its price target from $21 to **$16**, citing early Q3 sales declines (2.5–3%) below consensus expectations.\n\nI do think that this is an iconic fast food chain with a great brand, and it's a simple business, so I'm going to continue my research.\n\n\n-----\n\n[View the original post on Flank](<https://www.flankinvesting.com/p/ced8ad5b-51b8-476c-a91f-93b551c802cb?utm_source=reddit&utm_medium=flankinvesting&utm_campaign=n8n>)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.4680355403633875,
                    "post_polarity": 0.08395082904516867,
                    "post_subjectivity": 5.575115167851017,
                    "comments_weighted_polarity": -0.7909822298183061,
                    "combined_sentiment": -0.7909822298183061
                },
                {
                    "reddit_id": "1n1qp7u",
                    "created_utc": 1756323078.0,
                    "date": "2025-08-27",
                    "title": "HOOY - Timber...... No SP500 inclusion for HOOD... How far will it fall?",
                    "title_key": "hooy timber no sp500 inclusion for hood how far will it fall",
                    "body": "Looks like HOOD and HOOY are on the way down.\n\nHOOD's down almost 5%. How far will HOOY fall?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.1888888888888889,
                    "post_polarity": -0.027777777777777776,
                    "post_subjectivity": 6.800000000000001,
                    "comments_weighted_polarity": 0.8455840608240065,
                    "combined_sentiment": 0.8455840608240065
                },
                {
                    "reddit_id": "1n1oov7",
                    "created_utc": 1756318545.0,
                    "date": "2025-08-27",
                    "title": "Maybe a stupid question - How do I get less than 1 unit on papertrading on nasdaq, or sp500 ?",
                    "title_key": "maybe a stupid question how do i get less than 1 unit on papertrading on nasdaq or sp500",
                    "body": "I've been trading forex my whole life - I don't understand how one can trade with for example an account sized 100 dollars on demo if i have to buy at least 1 unit to even be able to enter the trade, is there a way to change this without setting my account balance to something unrealistic?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -1.108888888888889,
                    "post_polarity": -0.17777777777777778,
                    "post_subjectivity": 6.237500000000001,
                    "comments_weighted_polarity": 0.13809229736513282,
                    "combined_sentiment": 0.13809229736513282
                },
                {
                    "reddit_id": "1n1oatv",
                    "created_utc": 1756317686.0,
                    "date": "2025-08-27",
                    "title": "Opinions",
                    "title_key": "opinions",
                    "body": "I currently invest €400 per month distributed across 3 ETFs (SP500, Nasdaq100 emerging markets). Of those $400, I want to start investing $100 in Bitcoin ($25 per week). What do you think? I've been studying Bitcoin well and this is what I want.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 4.6,
                    "comments_weighted_polarity": 2.128437037037037,
                    "combined_sentiment": 2.128437037037037
                },
                {
                    "reddit_id": "1n1blnb",
                    "created_utc": 1756284004.0,
                    "date": "2025-08-27",
                    "title": "How is this portfolio looking like and is it useful to put in Alphabet, steady stocks as mcdonalds etc?",
                    "title_key": "how is this portfolio looking like and is it useful to put in alphabet steady stocks as mcdonalds etc",
                    "body": "I build this trading212 portfolio and i am thinking about adding alphabet and value stocks for the long run. But i am not so sure if thats the play for long term  >20+ years. Would love any recommendations\n\n55% in SP500 etf\n15% Russel 1000 growth etf\n15%. nasdaq etf\n10% world momentum etf\n5% Nuclear technologies etf\n\n\n ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.1806481481481481,
                    "post_polarity": 0.22777777777777777,
                    "post_subjectivity": 5.183333333333334,
                    "comments_weighted_polarity": 1.5694907407407408,
                    "combined_sentiment": 1.5694907407407408
                },
                {
                    "reddit_id": "1n1eji8",
                    "created_utc": 1756294447.0,
                    "date": "2025-08-27",
                    "title": "How would I go about retiring at 42 to a LCOL of city (info below)",
                    "title_key": "how would i go about retiring at 42 to a lcol of city info below",
                    "body": "I don't know that this is a \"chubby\" fire question , but I got berated on the standard fire board.\n\n43M / 42F; 2 young kids\n\n$1.25M taxable brokerage (almost all SP500 tracking)\n\n$1.1M 401Ks (all targeted retirement funds)\n\n$200K cash\n\n$500K cash when I retire or am let go\n\n$1.2M mortgage (crazy HCOL city that I hate but have to live here for work)\n\nIncome - Me $1.2M / Wife $250K (That income is like 4x what I was making 3 years ago and I think it'll keep up until the end of 2027, but after that who knows.)\n\nHere's my plan:\n\nWork until the end of 2027 (hopefully making my current income) and save like a mad man.\n\nSell my my house for $X.  I should make enough after expenses to buy a house for cash at $500K in like Chatanooga or something.  This is a huge X factor if the housing market crashes, but the $500K is a conservative net cash proceeds estimate based on the current market in my area.\n\nWhat would be the optimal means of achieving this and what would be a realistic expectation of annual pre-tax income?\n\nAnyway, long-winded question and feel free to downvote to hell.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.4452867965367965,
                    "post_polarity": -0.07299783549783549,
                    "post_subjectivity": 6.1,
                    "comments_weighted_polarity": 0.568895240541579,
                    "combined_sentiment": 0.568895240541579
                },
                {
                    "reddit_id": "1n1eith",
                    "created_utc": 1756294386.0,
                    "date": "2025-08-27",
                    "title": "EURO-DOLLAR is taking all my profits away",
                    "title_key": "euro dollar is taking all my profits away",
                    "body": "I’m investing in SP500 since beginning of this year. However, even though the ETF has increased around 10%, I’m still at a status-quo because the euro-dollar has risen as well.\n\nI have been buying the index in Euro (CSPX), thinking I would not be exposed to this effect. However, now it seems that I am. What is then the upside of buying in EURO, as I’m still exposed to this risk? And how would I avoid this?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.3566177392851652,
                    "combined_sentiment": 0.3566177392851652
                },
                {
                    "reddit_id": "1n1abjl",
                    "created_utc": 1756278892.0,
                    "date": "2025-08-27",
                    "title": "S&P 500 Stocks making new 52 week highs on 26 August 2025",
                    "title_key": "s&p 500 stocks making new 52 week highs on 26 august 2025",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.6942148760330578,
                    "post_polarity": 0.13636363636363635,
                    "post_subjectivity": 5.090909090909091,
                    "comments_weighted_polarity": 0.9675664108618653,
                    "combined_sentiment": 0.9675664108618653
                },
                {
                    "reddit_id": "1n1krjx",
                    "created_utc": 1756309867.0,
                    "date": "2025-08-27",
                    "title": "Plan to Semi-retire at age 38 with 300k",
                    "title_key": "plan to semi retire at age 38 with 300k",
                    "body": "Hi everyone, sorry for long post but wanted to get your thoughts if you think my plan is solid?  It is scary to do what I’m planning to do so I appreciate your patience and feedback.\n\nI just turn 37 and have about 270k today outside of my 401k.  (I do not want to include 401k since its not much and will not be touch until I’m 60+ when likely I will have higher cost of living but will recalculate and figure actual full retirement later in life).\n\nMy plan is that in 1 year, on my 38th birthday to quit (if I’m not laid off already).  I work in a lower level IT role that is being slowly eliminated by AI and offshoring so we are already being asked to learn and certify in other areas to pivot (but I’m too tired/unmotivated to study).  Also I don’t enjoy my job.\n\nBy my 38th birthday I an shooting to have 300k invested in SP500 index funds and 12k in cash/CDs, so total $312k, which I will then move to SE Asia (Mostly Da Nang, Vietnam but will also live in Chiang Mai, Thailand and Kuala Lumpur for some time.  (As a Viet Kieu, I will have visa that allows me to stay in vietnam for 6 months)\n\nThe $12k cash is to help me avoid drawing from the 300k the first year while i figure out and get comfortable seeing my investments and expenses going as expected.  Then the 2nd year I will start drawing the 4% on my 300k investment (SP500 Index Funds) to live on $1k or less per month.\n\nFor the first 6 months, I plan to only focus on setting healthier food, exercise and mindfulness routines (since I’m in a very bad state now) and recover mentally and physically.\n\nAfter that, then slowly, I will try to figure put how to start my own business/income.  My goal to make enough to move to Spain on their digital nomad visa, and then eventually be able to FIRE in a city with cost of living like London ultimately.   I am starting in SE Asia since I can’t really afford to be anywhere else that is as nice and safe for the same price. I think it may take me many years to figure out how to start my own business/income but I already have many ideas I’m excited to try. \n\nThe risks are :  \n\nI feel will struggle to find another job that pays as much if i change my mind given my industry’s trends and existing work experience and skills.  Also with age discrimination in tech, it will be hard to compete in lower level positions at my age.\n\nThe other risk is I will not be successful in starting a business at all, which is bad since I know I do not want to stay in SEAsia more than 2 years.\n\nI have no other safety net outside of myself, no family that would house me if i fail and have to go back to work in the states, which is why i absolutely want to leave the $300k principal untouched,  only live off its yield of $1k or less unless its an absolute emergency.\n\nWhat do you guys think?  Is this a good plan?  Any advice on how I should quantify or minimize the risks to feel more confident about my plan?  Thank you to anyone who read all of this.\n\n ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.49426403646431627,
                    "post_polarity": 0.09454178885630501,
                    "post_subjectivity": 5.227995391705069,
                    "comments_weighted_polarity": 0.47071232613874747,
                    "combined_sentiment": 0.47071232613874747
                }
            ],
            "post_count": 10,
            "average_combined_sentiment": 0.6254413622975968
        },
        "2025-08-28": {
            "date": "2025-08-28",
            "posts": [
                {
                    "reddit_id": "1n2ldhw",
                    "created_utc": 1756408421.0,
                    "date": "2025-08-28",
                    "title": "Roast my portfolio. A net worth analysis.",
                    "title_key": "roast my portfolio a net worth analysis",
                    "body": "I was inspired by a friend of mine to compare everything I've earned since I started working (after tax) to my net worth and portfolio.\n\nSo yesterday I started looking at my finances and decided to put everything in a sheet, and made a graph.\n\nHere it is:\n\nAugust and July have incomplete data so the graph looks like it drops to 0. It's not, not yet.\n\n[https://docs.google.com/spreadsheets/u/1/d/e/2PACX-1vRQy2wZuF6BMTNaBbHebmdY6Lyw4H-oBMiDwg2mj9O-B\\_ob8FD2zxeHo39-7WMyww/pubchart?oid=1728493384&format=interactive](https://docs.google.com/spreadsheets/u/1/d/e/2PACX-1vRQy2wZuF6BMTNaBbHebmdY6Lyw4H-oBMiDwg2mj9O-B_ob8FD2zxeHo39-7WMyww/pubchart?oid=1728493384&format=interactive)\n\nThoughts:\n\n* Yes, I know the risk is astronomical and my pension is fucking tiny :(\n* My ISAs are bad, I did not max them out every year and for a long time some of it was just Cash.\n* I had an income 120-150K most years, and I never salary sacrificed for pension. I put the data into Gemini and they said \"You have lost an estimated **£22,005.26** directly due to the £100,000 income tax trap.\" However I remained invested in the stock market (well, as the graph shows, only one stock). How bad of a play was it?\n* I **almost** reached 500K, but then Trump happened.\n* For a few months my net worth was higher than my total accumulated, un-invested, un-spent earnings.\n* Did I beat Sp500 by staying invested in a single stock? I calculated that too and the answer is \"Most times, by a bit\". Unfortunately I don't work for Nvidia.\n\nYour thoughts? Please roast but also please advise!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.25782206632653054,
                    "post_polarity": -0.05357142857142855,
                    "post_subjectivity": 4.812678571428572,
                    "comments_weighted_polarity": 0.28431310435286433,
                    "combined_sentiment": 0.28431310435286433
                },
                {
                    "reddit_id": "1n2cqpz",
                    "created_utc": 1756388964.0,
                    "date": "2025-08-28",
                    "title": "Conseil pour couple de quinquas, épargne (trop) liquide à placer",
                    "title_key": "conseil pour couple de quinquas épargne trop liquide à placer",
                    "body": "Bonjour,\n\nJ’ai découvert r/vosfinances il y a quelques mois et grace à vos conseils et le wiki j’ai pris conscience de l’inculture financière dans laquelle j’étais. J’ai besoin aujourd’hui de vos conseils pour réaménager mon portefeuille.\n\n**Voilà la situation**\n\nCouple H52 + F52,  mariés sous le régime de la communauté,  3 enfants majeurs dont un encore à charge. Objectif retraite dans 13 ans.\n\n**Revenus**\n\n* Revenus net imposable 2024 du foyer : 173000€\n* Revenus nets après impôts 2024 du foyer : 141000€\n* Dépenses du foyer en 2024 : 118000€, y compris l'épargne long terme (PEA + investissement locatif).\n\n**Immobiler**\n\nRP : propriétaire, remboursement de 2400 euros par mois. Reste encore 4 ans à payer. \n\nInvestissement locatif financé à 110% par emprunt (taux 0.9%):  Valeur d’achat 275k€.  Loyer 900 euros environs + crédit l’impôt de 4600 euros par an pendant 5 ans encore. Cash flow négatif de 400 euros par mois. \n\n**Epargne en place**\n\n* Livrets bancaires réglementés (2 livrets A et 2 LDDS) : 76700€ soit \\~ 8 mois de dépenses du foyer\n* Livret bancaire fiscalisé à 1.5% : 21600€\n* Dépôt à terme (2.6% en moyenne) : 12000€ - intérêts trimestriels nets réinvestis dans le PEA.\n\n* PEA (ETF World) : 7300€  - DCA sur PEA : 500 euros mensuel sur DCAM\n* PEA (ETF SP500) : 1300€  (investissement historique, pas de conviction particulière sur les US)\n\n* PEE (Fond actions employeur - capital garanti avec effet de levier - bloqué de 1 à 5 ans et non arbitrable) : 32200€\n* PEE (Fond action euro ISR, type MSCI EMU, bloqué encore 2 ans mais arbitrable) : 16300€\n* PEE (Fond monétaire ISR, disponible) : 87000€  \n\nMon PEE est assez limité et propose un fond action de mon employeur (entreprise du CAC 40), un fond action euro ISR, un fond monétaire et un fond obligataire euro ISR.\n\nMes investissements dans le PEE en actions de mon Employeur est fait sur des fonds spéciaux (une opération chaque année) où le capital investi est garanti (+4% annuel pour le dernier plan 2025) et la plue value éventuelle bénéficie d’un effet de levier important. C’est sans risque et peut être très rémunérateur. \n\nMes avoirs dans le fond monétaire du PEE sont disponibles est sont majoritairement le résultat des opérations d’actionnariat salarié des années 2020 et avant. C’est une situation assez recente et ces fond étaient il y a moins d’un an encore investis en actions.\n\n**Il est aisé d’observer que j’ai trop d’actifs monétaires.** \n\nJe fais donc appel à vos conseils pour réallouer tout ou partie de ces liquidités et pour mettre un plan en place pour l’avenir car dans 4 ans, notre revenu disponible va augmenter significativement avec la fin du prêt immo de la RP.  \n\n**Projets**\n\nJe n’ai pas de projet particulier court terme autre que le mariage de ma fille en 2027 (prévoir 20k),  la préparation de la retraite et une donation éventuelle aux enfants pour les aider dans leurs projets immobiliers. Il y aura une voiture à acheter au moment de la retraite (véhicule de fonction aujourd'hui).\n\nJe n’avais pas jusqu’à présent une grosse appétence au risque mais je me soigne. Suite à de mauvaise expériences, j’ai une certaine aversion pour les AV. \n\nJ'ai bien intégré qu'il va falloir charger un peu plus le PEA, mais dans quelle proportion et à quel rythme ? Lump sum ou sur 6 mois ? \n\nCompte tenu de mon âge et de la retraite qui approche (< 15 ans), je ne pense pas que 100% action soit très pertinent (mais peut-être que je me trompe). Je ne comprends pas bien la mécanique des fonds obligataires, j’y ai perdu des plumes en 2022 mais je me demande s’il ne faut pas néanmoins en mettre un peu dans mon portefeuille (et si oui sur quel support et quelle proportion). \n\nMerci d’avance pour vos conseils !",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.36693877551020415,
                    "post_polarity": 0.11071428571428572,
                    "post_subjectivity": 3.3142857142857145,
                    "comments_weighted_polarity": 0.0467055393586006,
                    "combined_sentiment": 0.0467055393586006
                },
                {
                    "reddit_id": "1n2j31l",
                    "created_utc": 1756403217.0,
                    "date": "2025-08-28",
                    "title": "Cook3d",
                    "title_key": "cook3d",
                    "body": "See a lot young ppl in this sub getting cooked with BMNR and doesn't understand how investing work.\n\nWhen SP500 dropped 31%, Yal didn't buy it as your core portfolio, \n\nWhen NVDA, AMD, PLTR, and iBIT, ETHA dropped hard, Yal didn't buy it either.\n\nWhen BMNR dropped to $30, yal didn't buy either. So what makes yal think you can handle volatility?\n\nIf yal (youngaters) are down bad 30-80%, yal better start look for that 2nd + 3rd jobs and be more reasonable with the $$ that yal put in the market.\n\nAlso, for the older ppl and took adv of cheap discount here. Congratz!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.3506341827364556,
                    "post_polarity": 0.07449494949494952,
                    "post_subjectivity": 4.706818181818182,
                    "comments_weighted_polarity": 0.5887135751453934,
                    "combined_sentiment": 0.5887135751453934
                },
                {
                    "reddit_id": "1n2c4h8",
                    "created_utc": 1756387418.0,
                    "date": "2025-08-28",
                    "title": "Consejos sobre que hacer con mi fondo de emergencia",
                    "title_key": "consejos sobre que hacer con mi fondo de emergencia",
                    "body": "Hola.\n\nHe conseguido tener un fondo de emergencia para cubrir 3 meses en caso de no tener nada.\n\nLa cosa es la siguiente, cual es el proximo paso, tengo como 3k invertidos en el sp500 y 165 en un etf de oro físico, que me recomendáis a parte de seguir ahorrando actualmente estoy ahorrando 500 al mes, aunque he terminado de pagar unos prestamos y estoy subiendo mi ahorro a 700.\n\n¿cuál es el siguiente paso? estoy pensando en montar un pequeño negocio relacionado con la consultoría de software, el mayor problema son los contactos que bueno, en resumen no tengo",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n2ccdj",
                    "created_utc": 1756387963.0,
                    "date": "2025-08-28",
                    "title": "M31 - Consiglio Portafolio ETF 110k euro",
                    "title_key": "m31 consiglio portafolio etf 110k euro",
                    "body": "Ciao a tutti, M31. Patrimonio attuale al netto del fondo d’emergenza e fondo pensione 50k + 60k in arrivo. Vivo con la mia ragazza (che guadagna molto più di me) in un appartamento di famiglia, non pago affitto/mutuo. La “speranza” di comprare un giorno la casa della vita c’è, ma senza troppo fretta (anche tra 5 anni). Per l’acquisto della casa abbiamo comunque la fortuna di avere delle famiglie che ci potrebbero aiutare MOLTO nell’acquisto. Risparmio circa 1k al mese (senza privarmi di nulla di ciò che è importante per me).\n\nAttualmente il mio portafoglio da 50k è questo (tutto in ETF/ETN):\n\n||\n||\n|51.25%|MSCI WORLD|\n|23.14%|S&P 500|\n|9.14%|FTSE ALL WORLD|\n|7.44%|NASDAQ 100|\n|4.81%|BITCOIN|\n|4.22%|AI & BIG DATA|\n\n \n\nMolte di queste cose le avevo comprare 2-3 anni fa quando muovevo i primi passi e sicuramente non riprenderei più (nonostante siano andati molto bene), come ad esempio l’ETF tematico sull’AI, il NASDAQ100 e l’SP500 (capisco che sono troppo esposto e senza senso sull’America e sul settore tecnologico in particolare: mi è andata bene ma sono consapevole che nessuno mi garantisce che andrà per sempre così).\n\nUltimamente compro solo SWDA in base alla disponibilità (non mi piace fare un PAC con quota fissa, ma investo semplicemente quello che risparmio) e per pigrizia non ho mai dedicato tempo a riflettere su come modificare il mio portafoglio e quale strategia seguire per il futuro (forse se non avessi avuto i risultati ottenuti mi sarei svegliato prima).\n\nL’arrivo impresto di 60k mi ha fatto riflettere molto e ho il desiderio di pianificare meglio il portafoglio e scegliere la strategia da seguire. Voglio far crescere il capitale nel tempo (orizzonte lungo), ho una bona tolleranza al rischio, voglio mantenere un 5% di Bitcoin (fun money), voglio mantenere un’alta % di azionario. Per tutto il resto chiedo consiglio a voi (per un po’ ho anche pensato di rivolgermi ad un consulente, ma ho paura che mi “venda” portafogli inutilmente complessi per giustificare il suo costo): cosa mi consigliate di fare? Aggiungereste oro, small cap, mercati emergenti (che non mi sono mai piaciuti), etf fattoriali, etf obbligazionari o obbligazioni, ecc? Vorrei abbassare un po’ la volatilità (o meglio il max max drawdown) da non ritrovarmi per sfiga il giorno che voglio acquistare casa (se mai arriverà) di essere troppo in negativo: accetto comunque di esserlo. ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.7618000000000003,
                    "post_polarity": -0.13000000000000003,
                    "post_subjectivity": 5.86,
                    "comments_weighted_polarity": -3.5239333333333334,
                    "combined_sentiment": -3.5239333333333334
                },
                {
                    "reddit_id": "1n2brci",
                    "created_utc": 1756386481.0,
                    "date": "2025-08-28",
                    "title": "THX SP500",
                    "title_key": "thx sp500",
                    "body": "Spotted in Prague ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n27xq9",
                    "created_utc": 1756374581.0,
                    "date": "2025-08-28",
                    "title": "S&P 500 #stocks making 52 week highs as of 27 August 2025",
                    "title_key": "s&p 500 #stocks making 52 week highs as of 27 august 2025",
                    "body": "S&P 500 #stocks making 52 week highs as of 27 August 2025",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n27omj",
                    "created_utc": 1756373645.0,
                    "date": "2025-08-28",
                    "title": "Hello Guys, I am from a 3rd World country in the Pacific and I am very Interested in putting money into the S&P 500 and a Roth IRA Acc",
                    "title_key": "hello guys i am from a 3rd world country in the pacific and i am very interested in putting money into the s&p 500 and a roth ira acc",
                    "body": "\nIf I can put 100 USD every month into my account, Please I need advice on how I can go about the first step or even if it is possible for someone in my situation. \n\nAny advice that can be useful and insightful.\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.79975,
                    "post_polarity": 0.175,
                    "post_subjectivity": 4.57,
                    "comments_weighted_polarity": 0.5212957301885975,
                    "combined_sentiment": 0.5212957301885975
                },
                {
                    "reddit_id": "1n2n70o",
                    "created_utc": 1756412620.0,
                    "date": "2025-08-28",
                    "title": "Stocks close higher, S&P 500 and Dow notch record highs",
                    "title_key": "stocks close higher s&p 500 and dow notch record highs",
                    "body": "Stocks shook off a choppy morning of trading to end the day higher on Thursday as a [surprise 3.3% rise in US GDP](https://finance.yahoo.com/news/us-economy-grows-3-3-123811856.html) offset concerns about[ Fed independence](https://finance.yahoo.com/news/the-feds-lisa-cook-sues-trump-and-the-fed-in-an-effort-to-keep-her-job-141708429.html) and [Nvidia's data center revenue came up a bit short](https://finance.yahoo.com/news/nvidia-stock-sinks-after-data-center-sales-miss-forecasts-ceo-calls-blackwell-demand-extraordinary-162719461.html).\n\nThe S&P 500 ([\\^GSPC](https://finance.yahoo.com/quote/%5EGSPC)) notched its [second consecutive record high](https://finance.yahoo.com/news/live/stock-market-today-sp-500-crosses-6500-dow-hits-record-after-nvidia-earnings-surprise-gdp-jump-200200115.html) on Thursday, rising 0.2% and climbing above the 6,500 level for the first time.\n\nThe tech-heavy Nasdaq Composite ([\\^IXIC](https://finance.yahoo.com/quote/%5EIXIC)) led Thursday's gains, rising 0.65%, while the Dow Jones Industrial Average ([\\^DJI](https://finance.yahoo.com/quote/%5EDJI)) lagged but still ended the day in the green and with a record high of 45,636.90.",
                    "queries_hit": "^GSPC",
                    "post_weighted_polarity": 0.09557599999999997,
                    "post_polarity": 0.02599999999999999,
                    "post_subjectivity": 3.676,
                    "comments_weighted_polarity": 0.5970372109929077,
                    "combined_sentiment": 0.5970372109929077
                },
                {
                    "reddit_id": "1n2w0og",
                    "created_utc": 1756435811.0,
                    "date": "2025-08-28",
                    "title": "$SPY: Bears Booked It, Bulls Tiptoeing Back 📉📊",
                    "title_key": "$spy bears booked it bulls tiptoeing back 📉📊",
                    "body": "UltraShort signals on $SPY at 8/21 10:30, 8/22 13:00, and 8/23 09:30 triggered clean fades, bagging up to 2.9% — the bears clipped the index with precision 🐻. Meanwhile, UltraBuyers who stepped in at 8/23 14:00 and 8/24 09:30 rode a 2.4% bounce before price stalled near 648.82 resistance. Momentum’s still balancing — next UltraBuy or UltraShort signal could shift action around 650.40 or 646.00 👀.\n\n# Use [https://www.ultraalgo.com/](https://www.ultraalgo.com/) to optimize trades with backtesting algorithmic signals. Try now with a Free Trial. 🚀",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.6444444444444445,
                    "post_polarity": 0.16111111111111112,
                    "post_subjectivity": 4.0,
                    "comments_weighted_polarity": 0.6444444444444445,
                    "combined_sentiment": 0.6444444444444445
                },
                {
                    "reddit_id": "1n2vwel",
                    "created_utc": 1756435457.0,
                    "date": "2025-08-28",
                    "title": "Rate my portfolio",
                    "title_key": "rate my portfolio",
                    "body": "I’m 21 years old I have recurring positions set up of $200 a month on VOO. I am definitely going to be more aggressive when I start making more money. \n\nAlso have 8k in my Roth 17% of my paycheck is going into that as well. Before you all say it I know I should just have it all in VOO instead of spy, I bought the spy before I about VOO. \n\nLet me knowww. \n\n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 1.3268749999999998,
                    "post_polarity": 0.275,
                    "post_subjectivity": 4.824999999999999,
                    "comments_weighted_polarity": -0.11526041666666649,
                    "combined_sentiment": -0.11526041666666649
                },
                {
                    "reddit_id": "1n2pamn",
                    "created_utc": 1756417593.0,
                    "date": "2025-08-28",
                    "title": "Short-term holding, the problem is not big",
                    "title_key": "short term holding the problem is not big",
                    "body": "In short, SPY is relatively stable at present, and analysts say it feels like a ballet 🩰 dance around a 'medium and long-term goal'. Are you optimistic about this ETF tomorrow, or do you think it will make a small pullback first? Leave a message to talk about your reasons - I'm not ready to be rounded 😂 on the spot!",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -0.055357142857142855,
                    "post_polarity": -0.017857142857142856,
                    "post_subjectivity": 3.1,
                    "comments_weighted_polarity": -0.055357142857142855,
                    "combined_sentiment": -0.055357142857142855
                },
                {
                    "reddit_id": "1n2mj5x",
                    "created_utc": 1756411091.0,
                    "date": "2025-08-28",
                    "title": "SPY 今天创历史新高",
                    "title_key": "spy 今天创历史新高",
                    "body": "[No Content]",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n2l5og",
                    "created_utc": 1756407918.0,
                    "date": "2025-08-28",
                    "title": "GOOGL, AAPL, SNOW and Some SPY Gains over July and Aug'25.",
                    "title_key": "googl aapl snow and some spy gains over july and aug 25",
                    "body": "The only 1 regret of getting scared when OPEN Dropped and sold it too early else I would have made another 20K on Open. But anyways.. Still have SNOW Left and will hold for a while.\n\n[Gains](https://preview.redd.it/hrvqqdswlvlf1.png?width=1398&format=png&auto=webp&s=1cb91476d93721676291478877c9ccae6ef56643)\n\n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.1028,
                    "post_polarity": 0.02,
                    "post_subjectivity": 5.14,
                    "comments_weighted_polarity": 0.2432933333333333,
                    "combined_sentiment": 0.2432933333333333
                },
                {
                    "reddit_id": "1n2k1q4",
                    "created_utc": 1756405378.0,
                    "date": "2025-08-28",
                    "title": "Critique my portfolio (UK)",
                    "title_key": "critique my portfolio uk",
                    "body": "I am saving for long term, for retirement is not till a decade. What do you think of my portfolio\n\n\n\n|ETF/Fund||\n|:-|:-|\n|HSBC FTSE All World Index (Class C)|50%|\n|iShares MSCI World Small Cap (WLDS)|20%|\n|SPDR MSCI World Value UCITS ETF (VALW)|20%|\n|Vanguard Global Aggregate Bond (GBP Hedged)|10%|\n\nThanks",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -0.08124999999999999,
                    "post_polarity": -0.024999999999999994,
                    "post_subjectivity": 3.25,
                    "comments_weighted_polarity": 0.17835055555555557,
                    "combined_sentiment": 0.17835055555555557
                }
            ],
            "post_count": 15,
            "average_combined_sentiment": -0.03935982663236306
        },
        "2025-08-29": {
            "date": "2025-08-29",
            "posts": [
                {
                    "reddit_id": "1n3q9kg",
                    "created_utc": 1756520820.0,
                    "date": "2025-08-29",
                    "title": "My portfolio thought",
                    "title_key": "my portfolio thought",
                    "body": "Hey there,  what do you think of a 70:20:10 fxaix:VGT:vxus strategy in a tax deferred retirement account ? The reasoning is to have majority sp500 index funds, plus some technology funds since it’s its prime time now, plus some international index funds to balance the whole portfolio. Thanks in advance for your insights.  Note there is no bond in this portfolio since we have steady income for daily expenses. Thanks. ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.3769444444444444,
                    "post_polarity": 0.12777777777777777,
                    "post_subjectivity": 2.95,
                    "comments_weighted_polarity": 0.3769444444444444,
                    "combined_sentiment": 0.3769444444444444
                },
                {
                    "reddit_id": "1n3tbzx",
                    "created_utc": 1756530924.0,
                    "date": "2025-08-29",
                    "title": "Just turned 24",
                    "title_key": "just turned 24",
                    "body": "Single, renting, no kids. Been buying SP500 tracking ETFs since my first job at 19, first with CIBC and later transferred to Wealthsimple. No pension but company has a 3% RRSP match through Manulife (have about 2k now). Hoping to keep contributing 800 biweekly till I turn 46 and enjoy retirement (\\~1.6M without real estate assuming 7% interest). Does the math check out?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.6036734693877552,
                    "post_polarity": 0.17142857142857146,
                    "post_subjectivity": 3.5214285714285714,
                    "comments_weighted_polarity": 1.1227755816402052,
                    "combined_sentiment": 1.1227755816402052
                },
                {
                    "reddit_id": "1n3kmby",
                    "created_utc": 1756504964.0,
                    "date": "2025-08-29",
                    "title": "S&P stands for Standard & Poor lol",
                    "title_key": "s&p stands for standard & poor lol",
                    "body": "Don’t you guys think that’s weird? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.15437499999999996,
                    "post_polarity": -0.024999999999999994,
                    "post_subjectivity": 6.175,
                    "comments_weighted_polarity": 0.31160192566609973,
                    "combined_sentiment": 0.31160192566609973
                },
                {
                    "reddit_id": "1n3kjhw",
                    "created_utc": 1756504777.0,
                    "date": "2025-08-29",
                    "title": "Account under review",
                    "title_key": "account under review",
                    "body": "My father's traditional IRA account is \"under review\". Account is very vanilla, mostly CDs and 1 sp500 index fund with automatic recurring investments monthly.\n\nThere have no distribution ever as he isnt subject to RMDs yet. He funds it once annually.\n\nAgain very vanilla. \n\nThe only thing unusual in recent weeks is her purchased a whopping $100 of a penny stock and it went up 4x in a month and he sold it for like 415 dollars.\n\nThat is the first and only individual stock he has ever purchased to my knowledge.\n\nWe both called today because he gets frustrated getting through the robo screening process. We got a rep on the phone then after about a 10 minute hold she said the account is under review and couldnt/wouldn't give us any reason for the review, only someone would contact him in the near future.\n\nAny clues or is this typical behavior. I habe numerous accts with fidelity as does my mother and have had them for years and nothing like this has ever come up.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.13988610149942332,
                    "post_polarity": 0.02450980392156863,
                    "post_subjectivity": 5.707352941176471,
                    "comments_weighted_polarity": 0.31513378493744393,
                    "combined_sentiment": 0.31513378493744393
                },
                {
                    "reddit_id": "1n3jmai",
                    "created_utc": 1756502456.0,
                    "date": "2025-08-29",
                    "title": "Rotating out of Intl",
                    "title_key": "rotating out of intl",
                    "body": "I increased my international share to 20% of 401K back in January, as part of 60% SP500, 20% intl index, 20% bonds. \n\nToday, I rotated my 20% international into small cap value. I think we are more likely to see broadening across the still heavily discounted US small/mid caps rather than international outperforming at its current valuations over the next 6 to 12 months.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.017599999999999994,
                    "post_polarity": 0.004999999999999999,
                    "post_subjectivity": 3.5199999999999996,
                    "comments_weighted_polarity": 0.5784783502288385,
                    "combined_sentiment": 0.5784783502288385
                },
                {
                    "reddit_id": "1n3ogil",
                    "created_utc": 1756515417.0,
                    "date": "2025-08-29",
                    "title": "I made an app that finds undervalued SP500 stocks, and invested them in a demo account. These are the 2 months returns.",
                    "title_key": "i made an app that finds undervalued sp500 stocks and invested them in a demo account these are the 2 months returns",
                    "body": "I'm more on the momentum/growth and generally the higher beta side of investment. After doing some reading and listening to many Youtube videos about value investing. And especially after knowing the one of the richest men in the planet got so rich by value investing. I decided that I need to test it.\n\nThe first problem is that I have never done it before and I just can't dump cash into a strategy I have never tested. And the second problem was that it's not easy for me to find and read multiple DDs about hundreds of companies in order to find which ones fall into the value investing category.\n\nSo I made a web application that does just that. It goes through the SP500 companies and finds which ones are undervalued, mostly stable and profitable. I want to share with you the stocks that it picked for me. In which I invested in a paper account. And the return on the demo investment since the first of July 2025. (2 Months)\n\n|Ticker|Return (2 Months)|\n|:-|:-|\n|UAL|27.96%|\n|APA|25.86%|\n|DHI|24.29%|\n|BLDR|19.56%|\n|BKR|18.36%|\n|[VAL.US](http://VAL.US)|17.16%|\n|LEN|16.24%|\n|BK|16.14%|\n|CC|11.36%|\n|GM|10.73%|\n|MRK|6.17%|\n|BIIB|5.24%|\n|CINF|2.94%|\n|ADSK|2.01%|\n|F|0.09%|\n|ACGL|0.03%|\n|COR|\\-3.03%|\n|CMCSA|\\-5.16%|\n\nGiven that the portfolio is equal weight, the 2 months performance is **+10.89%**\n\nIf I had done some DD. I would've probably allocated more cash to some of the stocks.\n\nAnd the best thing is that my demo portfolio was mostly on the green most days. Sometimes even on day where both \\^SPX and \\^NDX were in the red.\n\nI'm posting this just to show the value of value investing. \"Boring\" undervalued stocks truly are the way to go.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.9574354166666665,
                    "post_polarity": 0.18791666666666668,
                    "post_subjectivity": 5.094999999999999,
                    "comments_weighted_polarity": 0.7954184584644258,
                    "combined_sentiment": 0.7954184584644258
                },
                {
                    "reddit_id": "1n3inp1",
                    "created_utc": 1756500098.0,
                    "date": "2025-08-29",
                    "title": "Buying SPY on margin vs SPY plus SSO (leveraged ETF)",
                    "title_key": "buying spy on margin vs spy plus sso leveraged etf",
                    "body": "Hello fellow argonauts!  First time, long time.\n\nI am working through the thought experiment of investing at 120% of my capital in SP500 ETFs. Is margin or leveraged ETFs the optimal approach, for longer term investing horizon (5-10 years)?\n\nAssuming $100k to invest, should I buy $120k of SPY (using $20k margin) OR buy $80k SPY and $20k SSO? Both give me approximately the same 120% exposure the SP500, but using SSO I don't have to pay margin interest, but I do have to be aware of SSO decay over time. SSO being a 2x SP500 ETF.\n\nI'm leaning towards the SPY/SSO mix to deliver best returns. Am I missing anything? Or is there a better strategy? Thanks!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.6681481481481482,
                    "post_polarity": 0.17777777777777778,
                    "post_subjectivity": 3.7583333333333333,
                    "comments_weighted_polarity": 2.079515054169816,
                    "combined_sentiment": 2.079515054169816
                },
                {
                    "reddit_id": "1n3gyi2",
                    "created_utc": 1756496062.0,
                    "date": "2025-08-29",
                    "title": "Overweight in RSU/ESPP Shares (loss) and Looking to Exit Individual Stock Holdings (gain) -- Tax Loss Harvesting Question",
                    "title_key": "overweight in rsu/espp shares loss and looking to exit individual stock holdings gain tax loss harvesting question",
                    "body": "I was looking a fairly recent Boglehead thread regarding tax-loss harvesting, and a comment came up similar to the situation I am in. I figured it might generate some good discussion. The thread and comment is here:\n\n[tax-loss harvest equity compensation](https://www.reddit.com/r/Bogleheads/comments/1lbkbtc/comment/mxtiuw3/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nHere's my situation and question: I have a bunch of RSU's and ESPP's due to not paying attention and the shares have taken a beating. I find that I am holding too many and would like to just place that money in a low-cost ETF like VOO or VTI, that will actually grow. I have a handful of individual company stock holdings that have made money that I'm looking to harvest profits from. Stuff like Nvidia and Apple that I'm already holding in total market or SP500 funds. So, I'm basically fine with exiting direct company investments for that reason. All of these are \"long term\" as they are at least a year old.\n\nAny reason to not do this? (offset my company RSU/ESPP losses with external company stock gains) It achieves me the goal of accessing the money locked away as RSU's and satisfies my desire to exit holding individual company stock?\n\nI also don't quite understand the \"wash sale\" rule yet. If I go in to my accounts and make sure I deactivate dividend reinvestment for at least 30 days, should that insulate me from a wash sale accident if I decide to dump these RSU/ESPP shares?\n\nThanks in advance Boglehead community.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.4244407894736844,
                    "post_polarity": 0.09166666666666667,
                    "post_subjectivity": 4.630263157894738,
                    "comments_weighted_polarity": 0.11675503015350892,
                    "combined_sentiment": 0.11675503015350892
                },
                {
                    "reddit_id": "1n3iir5",
                    "created_utc": 1756499768.0,
                    "date": "2025-08-29",
                    "title": "How do they track gains inside tax advantaged accounts?",
                    "title_key": "how do they track gains inside tax advantaged accounts",
                    "body": "If I put 10k in my 401k at age 30 and invest it in an SP500 index, then sell that for 60k at age 50 and put it into t bills, then sell at at age 90, how does the government know what my basis was?  Do they keep track across multiple transactions that are behind the wall?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.8300000000000001,
                    "post_polarity": -0.2,
                    "post_subjectivity": 4.15,
                    "comments_weighted_polarity": 0.03659090909090905,
                    "combined_sentiment": 0.03659090909090905
                },
                {
                    "reddit_id": "1n3a51y",
                    "created_utc": 1756480449.0,
                    "date": "2025-08-29",
                    "title": "Etf investing",
                    "title_key": "etf investing",
                    "body": "Hello. I plan to start invest money in etfs around 200-250€/m . \nBut i have no idea what to do i read US etf like VOAA or Sp500 have like currency penalty so i search for eu ones but cant find any good i plan to use revolut as invest app.\nWhat are your suggestion to do?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 4.4799999999999995,
                    "post_polarity": 0.7,
                    "post_subjectivity": 6.4,
                    "comments_weighted_polarity": -0.0606530612244899,
                    "combined_sentiment": -0.0606530612244899
                },
                {
                    "reddit_id": "1n3g7k5",
                    "created_utc": 1756494274.0,
                    "date": "2025-08-29",
                    "title": "Para una estrategia de trading de ETFs apalancados ¿qué broker tiene menores comisiones?",
                    "title_key": "para una estrategia de trading de etfs apalancados ¿qué broker tiene menores comisiones",
                    "body": "Quiero probar una estregia usando etfs apalancados (Nasdaq x3 o SP500 x3) + oro + bonos que he estado backtesteando desde 1970-Actualidad, que da mejores retornos que el SP500 y sin tener drawdowns mucho más agresivos (excepto en 1987, ya que ahí la caída fue muy rápida y con los ETFs apalancados hubiese sido jodido).\n\nLa cuestión es que necesito un broker de bajas comisiones ya que 1-3 veces al año giraría todo el capital de agresivo a defensivo o viceversa. ¿Cuáles tienen mejores comisiones y qué % por compra/venta sería?\n\nPor si alguien tiene curiosidad el backtest y estrategia es esta: [https://testfol.io/tactical?s=81rdYW5YxuB](https://testfol.io/tactical?s=81rdYW5YxuB), pero el hilo no va de eso, ni de los peligros de los etfs apalancados, ni del drag, volatility decay, etc. Ya sé los riesgos, solo pregunto por las comisiones.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -2.4729687499999997,
                    "post_polarity": -0.425,
                    "post_subjectivity": 5.81875,
                    "comments_weighted_polarity": -0.27477430555555554,
                    "combined_sentiment": -0.27477430555555554
                },
                {
                    "reddit_id": "1n3a0e8",
                    "created_utc": 1756480157.0,
                    "date": "2025-08-29",
                    "title": "European etf invest what to do.",
                    "title_key": "european etf invest what to do",
                    "body": "Hello. I plan to start invest money in etfs around 200-250€/m . \nBut i have no idea what to do i read US etf like VOAA or Sp500 have like currency penalty so i search for eu ones but cant find any good i plan to use revolut as invest app.\nWhat are your suggestion to do?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.295,
                    "post_polarity": 0.35,
                    "post_subjectivity": 3.7,
                    "comments_weighted_polarity": 0.4389441220238095,
                    "combined_sentiment": 0.4389441220238095
                },
                {
                    "reddit_id": "1n39w6g",
                    "created_utc": 1756479891.0,
                    "date": "2025-08-29",
                    "title": "Viabilidad en la creación de un portfolio.",
                    "title_key": "viabilidad en la creación de un portfolio",
                    "body": "Buenas tardes a todos. Se que quizá este post debería estar en un foro de finanzas generales pero quiero ver las opiniones que me dais ya que noto que sois muy educados tanto en modales como en conocimientos.\n\nBueno, el titulo ya lo dice todo. En vez de invertir en el SP500, donde hay empresas que no comparto valores o apoyan gobiernos bastante... ya sabeis, tampoco quiero entrar en política. Lo hago porque mis valores no se alinean a una empresa que por ejemplo se lucra de intereses excesivos. Sería como invertir en cofidís en muchos casos, siento que apoyar a esas empresas no me dejarían dormir tranquilo.\n\nAnte todo soy persona, y también quiero saber opiniones. Quiero crear directamente mi propio portfolio de compañias que consumo, que me gustan o que tienen buenos rendimientos en bolsa y actuan con fines éticos.  \nSoy consciente que es un post que rara vez esperaríais que se publique, pero aquí estoy yo. Ante todo, gracias y espero que se tome con el mayor respeto posible. Acepto cualquier opinión que sea respetuosa y educativa. Muchas gracias.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -1.4049107142857142,
                    "combined_sentiment": -1.4049107142857142
                },
                {
                    "reddit_id": "1n38eyj",
                    "created_utc": 1756476438.0,
                    "date": "2025-08-29",
                    "title": "SP500 down but Baba came through like",
                    "title_key": "sp500 down but baba came through like",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.56,
                    "post_polarity": -0.15555555555555556,
                    "post_subjectivity": 3.6,
                    "comments_weighted_polarity": 0.3859090909090908,
                    "combined_sentiment": 0.3859090909090908
                },
                {
                    "reddit_id": "1n34ree",
                    "created_utc": 1756466633.0,
                    "date": "2025-08-29",
                    "title": "Ce ETF ați ales? Aveți mai mult de unul",
                    "title_key": "ce etf ați ales aveți mai mult de unul",
                    "body": "Eu am pe cel de SP500, nu stiu daca ar avea rost sa mai bag bani in altul sau sa pastrez pe aceasta. Ma gandeam daca sa iau ceva pe partea de tech, dar imi e sa nu fiu aproape de spargerea unei bule acolo.\n\nPlanuiesc sa le tin pe termen lung.",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.44294117647058817,
                    "combined_sentiment": 0.44294117647058817
                },
                {
                    "reddit_id": "1n33er4",
                    "created_utc": 1756462157.0,
                    "date": "2025-08-29",
                    "title": "Как да започна с инвестиране ?",
                    "title_key": "как да започна с инвестиране",
                    "body": "Здравейте, надявам се задавам въпроса си на правилното място. Интересувам се как да започна с инвестиране, чувал съм разни неща, за SP500, VWCE, злато, сребро и тн., но нямам никаква представа от къде и как да започна. Имам търпението и желанието да се науча и развия някакво разбиране за пазарите и как функционират, прецених, че тук е правилното място да попитам, какъв може да е добрият начален подход сиреч, какво да чета, къде да гледам от какво да се уча, какви платформи ползвате вие. Също смятам, че правилното място да попитам тук е, защото се намирам на територията на България и предполагам това също е от някакво значение. \n\nБлагодаря предварително на всеки, който се отзове !  ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": -0.050170068027210885,
                    "combined_sentiment": -0.050170068027210885
                },
                {
                    "reddit_id": "1n33cq3",
                    "created_utc": 1756461951.0,
                    "date": "2025-08-29",
                    "title": "My investment thesis for SPX6900",
                    "title_key": "my investment thesis for spx6900",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 1.3369216742252457,
                    "combined_sentiment": 1.3369216742252457
                },
                {
                    "reddit_id": "1n32in4",
                    "created_utc": 1756458869.0,
                    "date": "2025-08-29",
                    "title": "NT investicijai su svertu",
                    "title_key": "nt investicijai su svertu",
                    "body": "Butu idomu isgirsti jusu nuomone del NT investicijai su svertu. Tarkim turiu 100k cash, ir perku kotedza geroje vietoje Vilniuje uz 400k, tai paskola butu 300k. Nuoma i menesi 1600eur. Paskolos imoka su 4% proc vidutinem palukanom apie 1400eur 30 metu (galima priimti kad nuoma tiesiog isperka paskola del lengvesnio skaiciavimo,). NT verte vidutiniskai per metus auga apie 5proc, tai gautusi +20k nuo NT visos kainos, kas iseitu jog nuo mano 100k cash, metine graza 20%. Tai realiai lenkia sp500 x2, zinoma yra ir darbo siuo atveju, likvidumo mazai, karo ar eskalacijos rizika, nuomos prastovos.\n\nZinoma procentine graza priklauso nuo infliacijos ir pasaulines situacijos. Jei infliacija yra didele, kaip covid metu, tai reiktu pasverti tikraja graza atmetus inflacija. Tai siuo atveju jeigu nuoma isperka paskola, vienintelis klausimas kiek NT brangimas lenkia infliacija. Jeigu Nt brangsta 5% per metus, o infliacija 3%, tai skirtumas tik apie 2%. Kas gautusi nuo 400k, tik 8k, arba kitaip nuo 100k casho, tikrasis augimas lieka tik 8% realus, kas yra panasiai realios grazos sp500.\n\nTai kai ziuri i nominalia graza, atrodo kad NT laimi pries sp500, taciau pasverus realia graza, skaiciai pasidaro labai panasus (+ gauni dar papildomo darbo su NT ir galvos skausmo). Taip pat ziurint i 30 metu laikotarpi, reiks kapitalinio remonto namui, kas dar atsieis nemazai pinigu, ir sumazins galutini pelna.\n\nTai isvada kad VWCE and chill vistiek laimi pries NT investicijai su svertu. Kokia jusu nuomone? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.8219531250000001,
                    "combined_sentiment": 0.8219531250000001
                },
                {
                    "reddit_id": "1n3pzib",
                    "created_utc": 1756519966.0,
                    "date": "2025-08-29",
                    "title": "SPY stats that support historical probable outcomes",
                    "title_key": "spy stats that support historical probable outcomes",
                    "body": "0DTE is not profitable long term especially if you do not have the odds in front of you to support where price is and where it wants to go.\n\nToday was a simple example of where price wanted to go off the first 30 minutes of market open. Not everyday is it this clean.\n\nNo, I do not trade 0 DTE everyday nor do I recommend to as that will absolutely gut you. But that does not mean it can't be traded every now and then when scenarios such as days like today have higher probability for the outcomes to occur when the statistics are behind it",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.3332671130952381,
                    "post_polarity": 0.058194444444444444,
                    "post_subjectivity": 5.726785714285715,
                    "comments_weighted_polarity": 0.9919347986516037,
                    "combined_sentiment": 0.9919347986516037
                },
                {
                    "reddit_id": "1n3n72u",
                    "created_utc": 1756511770.0,
                    "date": "2025-08-29",
                    "title": "SPY stats that support historically probable outcomes",
                    "title_key": "spy stats that support historically probable outcomes",
                    "body": "My post earlier this week received some skepticism which is completely understandable. 0 DTE is not profitable long term especially if you do not have the odds in front of you to support where price is and where it wants to go.\n\nToday was a simple example of where price wanted to go off the first 30 minutes of market open. Not everyday is it this clean.\n\nNo, I do not trade 0 DTE everyday nor do I recommend to as that will absolutely gut you. But that does not mean it can’t be traded every now and then when scenarios such as days like today have higher probability for the outcomes to occur when the statistics are behind it",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.3231894025992749,
                    "post_polarity": 0.057230392156862736,
                    "post_subjectivity": 5.647163865546218,
                    "comments_weighted_polarity": 0.3231894025992749,
                    "combined_sentiment": 0.3231894025992749
                },
                {
                    "reddit_id": "1n3ehme",
                    "created_utc": 1756490321.0,
                    "date": "2025-08-29",
                    "title": "$SPY PUMP",
                    "title_key": "$spy pump",
                    "body": "There’s the afternoon session pump off the bottom at 643.46 all the way up to 644.85\n\nI did not execute any trades trade but I mentioned earlier today that we would have to see what the afternoon session would bring. \n\nNow we know….\n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.41500000000000004,
                    "post_polarity": 0.1,
                    "post_subjectivity": 4.15,
                    "comments_weighted_polarity": 0.41500000000000004,
                    "combined_sentiment": 0.41500000000000004
                },
                {
                    "reddit_id": "1n3amuz",
                    "created_utc": 1756481570.0,
                    "date": "2025-08-29",
                    "title": "$SPY CHART 11:30am",
                    "title_key": "$spy chart 11 30am",
                    "body": "$SPY IS TRADING DOWN AND FLAT RIGHT NOW!!!!!\n\nWe will have to be patient and see what the afternoon session will bring. \n\nMy earlier sentiment of no trades this morning has proven true and wise. \n\nStay frosty my friends!!!!!\n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 1.637412836068739,
                    "post_polarity": 0.3201964640022676,
                    "post_subjectivity": 5.113775510204082,
                    "comments_weighted_polarity": 1.8939825672137478,
                    "combined_sentiment": 1.8939825672137478
                },
                {
                    "reddit_id": "1n3gxpt",
                    "created_utc": 1756496010.0,
                    "date": "2025-08-29",
                    "title": "I finally did something WSB worthy (SPY Puts)",
                    "title_key": "i finally did something wsb worthy spy puts",
                    "body": "I did it guys. Went full regard and am posting here for the first time. Yesterday, I had an itch, and the only thing that scratched it was putting approximately 25k on a SPY put exp 9/2.\n\nAs you guys know, we grinded up slowly all morning, well, I averaged down!! \n\nBy market close I was -20k and feelin some kind of ways but went about my night. \n\nWoke up and hey, market dropped!!! I wish I held longer but ultimately sold off in blocks to end up with an 8k gain. This could’ve probably been a 40k+ gain but you know how it is, when you’re down bad, you just want break even… so I did hold longer than that.\n\n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.07882185570987658,
                    "post_polarity": 0.011226851851851858,
                    "post_subjectivity": 7.020833333333334,
                    "comments_weighted_polarity": 0.9347807558591779,
                    "combined_sentiment": 0.9347807558591779
                },
                {
                    "reddit_id": "1n39xqn",
                    "created_utc": 1756479989.0,
                    "date": "2025-08-29",
                    "title": "Stocks with unusual options volume: $SPY $NVDA $QQQ $SPX $TSLA $BABA $OPEN $IWM $AAPL $AMD $PLTR $MRVL",
                    "title_key": "stocks with unusual options volume $spy $nvda $qqq $spx $tsla $baba $open $iwm $aapl $amd $pltr $mrvl",
                    "body": "[No Content]",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.775,
                    "post_polarity": 0.1,
                    "post_subjectivity": 7.75,
                    "comments_weighted_polarity": 0.775,
                    "combined_sentiment": 0.775
                },
                {
                    "reddit_id": "1n39swz",
                    "created_utc": 1756479694.0,
                    "date": "2025-08-29",
                    "title": "$SPY CHART 11:00am",
                    "title_key": "$spy chart 11 00am",
                    "body": "There’s the dreaded DEAT CROSS!!!!!!\n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.19,
                    "post_polarity": 0.1,
                    "post_subjectivity": 1.9,
                    "comments_weighted_polarity": -0.14499999999999982,
                    "combined_sentiment": -0.14499999999999982
                },
                {
                    "reddit_id": "1n38ttg",
                    "created_utc": 1756477415.0,
                    "date": "2025-08-29",
                    "title": "$SPY CHART 10:25am",
                    "title_key": "$spy chart 10 25am",
                    "body": "The chart has flattened out\n\nSellers letting up\n\nWatching for a retrace here\n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.5599999999999999,
                    "post_polarity": 0.2,
                    "post_subjectivity": 2.8,
                    "comments_weighted_polarity": 1.1846549614743855,
                    "combined_sentiment": 1.1846549614743855
                },
                {
                    "reddit_id": "1n38aeo",
                    "created_utc": 1756476136.0,
                    "date": "2025-08-29",
                    "title": "$SPY 647 CALLS",
                    "title_key": "$spy 647 calls",
                    "body": "Watching:\n\n$SPY 647 CALLS",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.5692592592592592,
                    "combined_sentiment": 0.5692592592592592
                },
                {
                    "reddit_id": "1n37zpm",
                    "created_utc": 1756475436.0,
                    "date": "2025-08-29",
                    "title": "$SPY Down TurN",
                    "title_key": "$spy down turn",
                    "body": "$SPY Looking for a bottom\n\nWatching for the turn into a retracement. \n\nI mentioned last night that $SPY is due for a bit of give back after being at all time highs. \n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -0.04309722222222222,
                    "post_polarity": -0.01611111111111111,
                    "post_subjectivity": 2.675,
                    "comments_weighted_polarity": -0.02154861111111111,
                    "combined_sentiment": -0.02154861111111111
                },
                {
                    "reddit_id": "1n386wr",
                    "created_utc": 1756475920.0,
                    "date": "2025-08-29",
                    "title": "$SPY Down Trend",
                    "title_key": "$spy down trend",
                    "body": "Trending down\n\nI said earlier, today will be more watching than trading\n\nFeeling like a sustained down day to end the week\n\nThanks C",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.15944444444444447,
                    "post_polarity": 0.03888888888888889,
                    "post_subjectivity": 4.1000000000000005,
                    "comments_weighted_polarity": 0.15944444444444447,
                    "combined_sentiment": 0.15944444444444447
                }
            ],
            "post_count": 29,
            "average_combined_sentiment": 0.4982783502318012
        },
        "2025-08-30": {
            "date": "2025-08-30",
            "posts": [
                {
                    "reddit_id": "1n4iob2",
                    "created_utc": 1756605257.0,
                    "date": "2025-08-30",
                    "title": "Dollar-Cost-Averaging %",
                    "title_key": "dollar cost averaging %",
                    "body": "Is their a percentage of your paycheck you use to invest in the S&P 500 using the dollar-cost averaging strategy?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.7255000793757698,
                    "combined_sentiment": 0.7255000793757698
                },
                {
                    "reddit_id": "1n4hk5j",
                    "created_utc": 1756601888.0,
                    "date": "2025-08-30",
                    "title": "SP500 Rebalancing? What it means this week.",
                    "title_key": "sp500 rebalancing what it means this week",
                    "body": "Hey folks. Hope everyone is having a good weekend.\n\nI wanted to get some help and understanding what it means for sp500 and the weighting.\n\nWhat are we likely to see happen to the top 10 stocks?\n\nI'm big in Amazon and Google. Would we see more or less of them interms of weighting?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.316111111111111,
                    "post_polarity": 0.25555555555555554,
                    "post_subjectivity": 5.15,
                    "comments_weighted_polarity": 0.32529023808592417,
                    "combined_sentiment": 0.32529023808592417
                },
                {
                    "reddit_id": "1n4f6jo",
                    "created_utc": 1756594928.0,
                    "date": "2025-08-30",
                    "title": "14 years of out of data SP500 backtesting.. I have finally done it.",
                    "title_key": "14 years of out of data sp500 backtesting i have finally done it",
                    "body": "https://preview.redd.it/y0xzo2k8m8mf1.png?width=748&format=png&auto=webp&s=e7dafc1ee1a175653f832e7d68281b3cee731089\n\nOut of sample**",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 10.0,
                    "comments_weighted_polarity": 0.3781695342356157,
                    "combined_sentiment": 0.3781695342356157
                },
                {
                    "reddit_id": "1n4d4d5",
                    "created_utc": 1756589350.0,
                    "date": "2025-08-30",
                    "title": "Analyse du Taux 10 ans US et de la courbe des taux US au 29-08-2025",
                    "title_key": "analyse du taux 10 ans us et de la courbe des taux us au 29 08 2025",
                    "body": "Hello, \n\nL'analyse hebdo du taux US à 10 ans, et de la courbe des taux US est en ligne.\n\nVous trouverez une comparaison de l'évolution des taux et de la courbe des taux, ainsi que les impacts potentiels sur les indices dont le SP500.\n\nSi vous investissez sur le SP500 (etf SP500) ou même un ETF monde, vous devriez vous intéresser à ces données pour tirer votre propre conclusion\n\n\n\nAnalyse complète ici : [https://epargnebourse.fr/taux-10-ans-us.html](https://epargnebourse.fr/taux-10-ans-us.html)\n\nhttps://preview.redd.it/1ya1qh0m58mf1.png?width=1032&format=png&auto=webp&s=419218c4f38ebd99a61e10d46021fe2b4619ab97\n\n  \n\n\n\n\n\\#S&P 500, #SP500, #SPY, #10yr Tbonds , #courbe des taux, #taux 10 ans US, #msci world\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -7.5,
                    "post_polarity": -0.75,
                    "post_subjectivity": 10.0,
                    "comments_weighted_polarity": -7.5,
                    "combined_sentiment": -7.5
                },
                {
                    "reddit_id": "1n4d9s5",
                    "created_utc": 1756589739.0,
                    "date": "2025-08-30",
                    "title": "Analysis of the US 10-Year Yield and the US Yield Curve as of 29-08-2025",
                    "title_key": "analysis of the us 10 year yield and the us yield curve as of 29 08 2025",
                    "body": "Hello, the weekly analysis of the US 10-year Treasury yield and the US yield curve is now online.\t\n\nYou’ll find a comparison of how rates and the yield curve have evolved, as well as the potential impacts on indices such as the S&P 500.\t\n\nIf you invest in the S&P 500 (SP500 ETF) or even a global ETF, you should take a look at this data to draw your own conclusions.\t\n\n\n\nFull analysis here: [10 Yr yield](https://epargnebourse.fr/taux-10-ans-us.html) (available in English, German, Spanish, Italian, French, ...\t\n\n  \nHello, the weekly analysis of the US 10-year Treasury yield and the US yield curve is now online.\n\nhttps://preview.redd.it/fl7iaco478mf1.png?width=1069&format=png&auto=webp&s=ed0b7ac528ed5277a2f2ecbed8696f397642bb24\n\n  \n\n\n\n\n\\#S&P500 #SP500 #SPY #10yrTbonds #yieldcurve #US10yr #msciworld\t\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.216875,
                    "post_polarity": 0.049999999999999996,
                    "post_subjectivity": 4.3375,
                    "comments_weighted_polarity": 0.216875,
                    "combined_sentiment": 0.216875
                },
                {
                    "reddit_id": "1n4bcbm",
                    "created_utc": 1756584739.0,
                    "date": "2025-08-30",
                    "title": "Top 10 $stocks #Stocks outperforming the $SPX $SPY S&P 500 in August 2025",
                    "title_key": "top 10 $stocks #stocks outperforming the $spx $spy s&p 500 in august 2025",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 2.75,
                    "post_polarity": 0.5,
                    "post_subjectivity": 5.5,
                    "comments_weighted_polarity": 1.3207024793388429,
                    "combined_sentiment": 1.3207024793388429
                },
                {
                    "reddit_id": "1n45vuc",
                    "created_utc": 1756571192.0,
                    "date": "2025-08-30",
                    "title": "Flip the stock market",
                    "title_key": "flip the stock market",
                    "body": "https://www.reddit.com/r/sp500/s/lYaOXEbSh4",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n42933",
                    "created_utc": 1756562170.0,
                    "date": "2025-08-30",
                    "title": "Semiconductor and tech funds vs SP500 diversified funds",
                    "title_key": "semiconductor and tech funds vs sp500 diversified funds",
                    "body": "The extremely impressing performance of semiconductor and tech sectors are showing a lot of interest to grow your portfolio even with increased volatility time to recover\n\nWould you prefer heavily semiconductor or tech fund with 350-400% growth in 6 years like FSELX and SOXX ( 23-24% CAGR , 40-50% drawdown )  or a diversified fund in different sectors trade high and mega cap stocks with 230% growth 6 years  ( 22% CAGR , 20-30% drawdown )?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -0.28627500000000006,
                    "post_polarity": -0.04125,
                    "post_subjectivity": 6.94,
                    "comments_weighted_polarity": -0.28627500000000006,
                    "combined_sentiment": -0.28627500000000006
                },
                {
                    "reddit_id": "1n3yz8z",
                    "created_utc": 1756552385.0,
                    "date": "2025-08-30",
                    "title": "Question about Roth Conversion",
                    "title_key": "question about roth conversion",
                    "body": "I recently did a Roth conversion within Fidelity. \nBoth the t-IRA and Roth IRA had FXAIX (sp500) that I transferred. \nMy question is about the mechanics of the transfer.\n\nAm I selling FXAIX from the t-IRA then buying FXAIX in the roth-IRA? \nOr are the shares and their ID just being moved from one account to another?\n\nThis is my first time doing it so I am making sure I am doing this correctly so I don't mess up the 5 year rule or pay unnecessary taxes\n\nI thought maybe it will go into a money market account in the Roth IRA and I would have to buy the FXAIX there but it seems that it was just a share transfer when I look at it now. Is this because it was done all within Fidelity? If it was between different brokerages, would the process be different?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.14544642857142853,
                    "post_polarity": 0.02499999999999999,
                    "post_subjectivity": 5.817857142857143,
                    "comments_weighted_polarity": 0.9125146076287657,
                    "combined_sentiment": 0.9125146076287657
                },
                {
                    "reddit_id": "1n40t09",
                    "created_utc": 1756558137.0,
                    "date": "2025-08-30",
                    "title": "SXR8",
                    "title_key": "sxr8",
                    "body": "Hej.\n\nJeg har fyldt min ASK op med SXR8 (sp500 etf)\n\nHvilken ticker bør jeg købe for at få sp500 på mit aktiedepot? For så vidt jeg kan forstå er det en dårlig idé at have ETF på aktiedepot.\n\nvenlig hilsen",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n3zbej",
                    "created_utc": 1756553533.0,
                    "date": "2025-08-30",
                    "title": "CORTE SUPREMA USA ANNNULLA DAZI A TRUMP",
                    "title_key": "corte suprema usa annnulla dazi a trump",
                    "body": "Li ha dichiarati illegali e entro il 14 Ottobre verranno tolti. Quelli settoriali (su auto acciaio ecc.) non vengono toccati dalla sentenza che invece incide su Dazi a tutti i paesi + quelli ad hoc per Cina Messico e Canada.  Questo ovviamente indebolisce ancora di piu l'autorita del presidente oltre che creare ulteriore destabilità alla politica USA. La domanda che interessa a noi scimmie scalatrici è: \"e mo? Che se fa?\" come reagira il mercato tech scimmiesco (nasdaq) ? Come reagiranno le 500 compagnie scimmiche che hanno le banane piu buone (sp500?). Non lo so, ma attendendo una vostra risposta, vado a visitare mio cugino scimmia che vive nella foresta amazzonica.\n\n  \nModifica: è la corte d'appello scimmie chiedo scusa W la giungla!!",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.2920432692307692,
                    "combined_sentiment": 0.2920432692307692
                },
                {
                    "reddit_id": "1n3ywyd",
                    "created_utc": 1756552166.0,
                    "date": "2025-08-30",
                    "title": "Portafoglio azionario per 46k",
                    "title_key": "portafoglio azionario per 46k",
                    "body": "Buongiorno soci,\n\nAvrei bisogno di investire 46k in etf azionari e volevo fare un portafoglio adeguato per il medio/lungo periodo.\n\nAl momento 6k sono già investiti nel DAX, gli altri 40k sono ancora liquidi. \n\nPensavo di fare circa così:\n\n15k - SP500\n15k - VWCE\n5k - MSCI\n5k - ancora indeciso, magari emergenti?\n\nCosa pensate? \n\nEdit: va bene ho capito, meno seghe mentali e via di un singolo etf ben diversificato",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.04286785714285715,
                    "combined_sentiment": 0.04286785714285715
                },
                {
                    "reddit_id": "1n3vzr7",
                    "created_utc": 1756540762.0,
                    "date": "2025-08-30",
                    "title": "Etf xtb - sp500 / nasdaq",
                    "title_key": "etf xtb sp500 / nasdaq",
                    "body": "Dużo tego. Które są według was najlepsze?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.0,
                    "combined_sentiment": 0.0
                },
                {
                    "reddit_id": "1n3w604",
                    "created_utc": 1756541435.0,
                    "date": "2025-08-30",
                    "title": "100k+ YOLO $APP",
                    "title_key": "100k+ yolo $app",
                    "body": "Very bullish this time, $APP is gonna get into the SP500, I have a feeling in my gut. I trust my gut. 🤘🏻🤘🏻",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.74,
                    "post_polarity": 0.2,
                    "post_subjectivity": 3.6999999999999997,
                    "comments_weighted_polarity": 0.6876916666666668,
                    "combined_sentiment": 0.6876916666666668
                },
                {
                    "reddit_id": "1n4koak",
                    "created_utc": 1756611612.0,
                    "date": "2025-08-30",
                    "title": "Best 3 Roth IRA stocks for an 18 YO according to AI",
                    "title_key": "best 3 roth ira stocks for an 18 yo according to ai",
                    "body": "For a 18-year-old looking to invest in a Roth IRA, the following ETFs are recommended based on their low expense ratios and potential for long-term growth:\nVanguard Total Stock Market ETF (VTI): This ETF tracks the CRSP US Total Market Index and has a low expense ratio of 0.03%. It includes a diverse range of domestic stocks and is suitable for those seeking broad market exposure. \n\n1\nVanguard 500 Index Fund (VFIAX): With a low expense ratio of 0.04%, this ETF provides a diversified portfolio of U.S. stocks and is a good choice for long-term investors. \n\n2\nSPDR S&P 500 ETF Trust (SPY): This ETF tracks the S&P 500 and has a low expense ratio of 0.0945%. It is a popular choice for those looking for exposure to the U.S. stock market. \n\n3\nThese ETFs are ideal for young investors as they offer the potential for long-term growth and are designed to be low-cost options for retirement savings. It's important to consider your investment goals and risk tolerance when selecting ETFs for your Roth IRA. \n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 1.4569661458333334,
                    "post_polarity": 0.23958333333333334,
                    "post_subjectivity": 6.08125,
                    "comments_weighted_polarity": 1.4569661458333334,
                    "combined_sentiment": 1.4569661458333334
                },
                {
                    "reddit_id": "1n4fs06",
                    "created_utc": 1756596612.0,
                    "date": "2025-08-30",
                    "title": "List of The Most Roth IRA friendly Stocks.",
                    "title_key": "list of the most roth ira friendly stocks",
                    "body": "Most Popular Funds for Roth IRAs (2025 Edition)\n🧠 Balanced & Conservative Picks\n\n• Vanguard Wellesley Income (VWINX) – Dividend stocks + bonds, low volatility\n• Vanguard Wellington (VWELX) – Classic 65/35 stock-bond blend, strong long-term return\n\n📊 Broad Market Exposure\n\n• Vanguard Total Stock Market ETF (VTI) – Covers the entire U.S. equity market\n• SPDR S&P 1500 Composite ETF (SPTM) – Total market exposure, ultra-low fees\n• Fidelity ZERO Total Market Index (FZROX) – No expense ratio, solid diversification\n• Vanguard S&P 500 ETF (VOO) – Tried-and-true large-cap exposure\n\n💰 Dividend & Income Machines\n\n• Schwab U.S. Dividend Equity ETF (SCHD) – Quality dividend growth\n• JPMorgan Equity Premium Income ETF (JEPI) – Covered call strategy, monthly income\n• Cohen & Steers Realty Fund (RQI) – REIT exposure with juicy yield\n• Vanguard Real Estate ETF (VNQ) – REITs = tax-inefficient, so Roth is ideal\n\n🚀 Growth & Specialty Picks\n\n• Vanguard Primecap (VPMCX) – Long-term capital appreciation\n• Simplify Volatility Premium ETF (SVOL) – Income from volatility premiums\n• iShares Bitcoin Trust ETF (IBIT) – Crypto exposure for the bold\n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 1.521593221028646,
                    "post_polarity": 0.25442708333333336,
                    "post_subjectivity": 5.98046875,
                    "comments_weighted_polarity": 1.521593221028646,
                    "combined_sentiment": 1.521593221028646
                },
                {
                    "reddit_id": "1n4d5xm",
                    "created_utc": 1756589459.0,
                    "date": "2025-08-30",
                    "title": "Basket of tickers that could be structured for \"de-correlation\" (as much as it can be)?",
                    "title_key": "basket of tickers that could be structured for de correlation as much as it can be",
                    "body": "I have a consistently-printing 1DTE-with-active-expiry-morning-management approach with RUT that is good for $300-$600+/day profit most of the time, never risking more than \\~1% of trading account per trade and with typical losses in the same magnitude ballpark as typical winners occurring <10% of the time and small-outcome \"ties\" about 20% of the time.  Statistics are over a high-double-digit number of trades from June 2025 to the present, and it has survived multiple FOMCs, macro releases, Trump-47 tweets, Israel-Iran war, etc.  And if I am badly wrong one time, chances are the loss can be made up within <1-2 weeks.\n\nThe problem I have is in scaling it up -- the \"edge\"=positive EV is really in the combination of voluntary overnight risk and early-next-day management (I have a rule set that has worked well), the trade structure merely reduces the cognitive load in doing so, and scaling the size up reduces the number of tools in my management toolbox and thus reduces the \"edge\".  If I had a $10M account this would not be an issue, but I don't, at least not yet.\n\nSo what I was thinking is to run the same approach on a baker's half-dozen of similar tickers to RUT that are correlated with it as little as possible -- remembering of course that \"everything is correlated in a crash\" which also means some delta-offsetting is needed (and I would look to my 65-70%-accurate custom ML as well as elementary-level TA for guidance on how to do that).\n\nBut am running into issues finding good tickers to do this on.  My broker doesn't do futures, and there is significant inertia in my case against switching brokers (partly because my trading account is owned by an LLC).\n\nHere are the tickers I have picked thus far -- some of them have known issues but they seem close enough that it is worth the effort to work through--\n\n\\* RUT (obviously, and it is also an ideal size)\n\n\\* NDX (can't do SPX because my IRAs are heavy on SPX and SPY) -- too large so I have reservations\n\n\\* USO (still figuring out the psych of the intraday volatility even though it doesn't move much except for relatively unpredictable macro events)\n\n\\* GLD\n\n\\* Have looked at the various SPDR sectors, but juice doesn't seem to be worth the squeeze IV-wise, made small profits when I dipped in\n\n\\* UVXY or more-options-friendly equivalent\n\n\\* TLT or more-options-friendly equivalent\n\n\\* One hand-selected hype stock (not sure yet what that is) that seems like it could mature soon into not-hype -- to take smaller positions on.\n\n  \nThoughts?",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.42768720260325416,
                    "post_polarity": 0.08083024118738405,
                    "post_subjectivity": 5.291178107606679,
                    "comments_weighted_polarity": 0.8870331153675067,
                    "combined_sentiment": 0.8870331153675067
                },
                {
                    "reddit_id": "1n4c21j",
                    "created_utc": 1756586588.0,
                    "date": "2025-08-30",
                    "title": "Global Diversified Portfolio Strategy",
                    "title_key": "global diversified portfolio strategy",
                    "body": "I’m planning a long-term investment strategy (20+ years) and would like feedback. The idea is to invest 100,000 in the first year, adding about 8,333 each month (DCA), and then continue with monthly contributions. My goal is to build a diversified portfolio that captures global market returns but also has some “airbags” for extreme scenarios.\n\nThe core is global equities: 60% in the SPDR MSCI ACWI IMI UCITS ETF (Acc, ISIN IE00B3YLTY66), which covers ~9,000 companies across 45 countries (large, mid, and small caps, developed + emerging). I split this between USD and GBP listings, with the plan to convert the GBP portion into EUR if €/GBP reaches 1.18.\n\nFor bonds, I allocate 15%: half in global aggregate investment grade (Vanguard Global Aggregate, GBP hedged) and half in euro inflation-linked government bonds (iShares Euro ILBs). This should provide diversification plus some protection against persistent inflation.\n\nAs an additional diversifier, I include 5% in European REITs (iShares European Property Yield). In real assets, I hold a larger block: 15% in gold and 3% in silver (both UCITS ETCs), mainly for crisis and inflation hedging. Finally, I add 2% in crypto (CoinShares Top10 ETP) as a small asymmetric bet.\n\nThe portfolio’s weighted average TER is very low (~0.18%), all UCITS domiciled in Ireland/Luxembourg, physical replication, accumulating share class. The plan is to rebalance annually or when any asset drifts ±5% from target.\n\nI’ve run this strategy through historical and hypothetical scenarios. In strong bull markets (AI boom, EM rally, soft landing), the portfolio captures 70–95% of global equity returns, ending up +14% to +19%. In severe crises (2008, stagflation, EU+US debt crisis), the estimated max drawdown is ~–25%, compared to –45% for pure ACWI. With monthly contributions, DCA helps smooth entry: in a simulated volatile year, the portfolio still finished +5.8%.\n\nDo you think this makes sense as a robust long-term strategy? Are the weights in bonds, gold, or REITs appropriate? Should I keep the multi-currency exposure (USD, GBP, EUR) or hedge everything to euros? Would you adjust the speculative sleeve (crypto) or the small cap exposure?\n\n(AI helped me with everything) ",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.1450100695845456,
                    "post_polarity": 0.03936251920122888,
                    "post_subjectivity": 3.6839631336405536,
                    "comments_weighted_polarity": 0.37301815361590207,
                    "combined_sentiment": 0.37301815361590207
                },
                {
                    "reddit_id": "1n43z46",
                    "created_utc": 1756566478.0,
                    "date": "2025-08-30",
                    "title": "Select Sector Spdr Trust",
                    "title_key": "select sector spdr trust",
                    "body": "# The Communication Services Select Sector SPDR Fund\nNet Value as of 2025-06-30: $24.0B\n\nTop Holdings by value:\n\n1. Meta Platforms Inc - 18.7%\n2. Alphabet Inc - 17.5%\n3. Netflix Inc - 8.8%\n4. Electronic Arts Inc - 4.7%\n5. Walt Disney Co/The - 4.5%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211160/xslFormNPORT-P_X01/primary_doc.xml)\n# The Consumer Discretionary Select Sector SPDR Fund\nNet Value as of 2025-06-30: $22.5B\n\nTop Holdings by value:\n\n1. Amazon.com Inc - 23.3%\n2. Tesla Inc - 16.4%\n3. Home Depot Inc/The - 6.7%\n4. Booking Holdings Inc - 4.7%\n5. McDonald's Corp - 4.3%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211224/xslFormNPORT-P_X01/primary_doc.xml)\n# The Consumer Staples Select Sector SPDR Fund\nNet Value as of 2025-06-30: $15.9B\n\nTop Holdings by value:\n\n1. Costco Wholesale Corp - 10.0%\n2. Walmart Inc - 9.6%\n3. Procter & Gamble Co/The - 8.5%\n4. Philip Morris International Inc - 6.4%\n5. Coca-Cola Co/The - 6.2%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211158/xslFormNPORT-P_X01/primary_doc.xml)\n# The Energy Select Sector SPDR Fund\nNet Value as of 2025-06-30: $26.8B\n\nTop Holdings by value:\n\n1. Exxon Mobil Corp - 22.9%\n2. Chevron Corp - 14.9%\n3. ConocoPhillips - 7.2%\n4. Williams Cos Inc/The - 4.8%\n5. EOG Resources Inc - 4.5%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211030/xslFormNPORT-P_X01/primary_doc.xml)\n# The Financial Select Sector SPDR Fund\nNet Value as of 2025-06-30: $49.8B\n\nTop Holdings by value:\n\n1. Berkshire Hathaway Inc - 12.1%\n2. JPMorgan Chase & Co - 10.9%\n3. Visa Inc - 8.2%\n4. Mastercard Inc - 6.2%\n5. Bank of America Corp - 4.2%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211084/xslFormNPORT-P_X01/primary_doc.xml)\n# The Health Care Select Sector SPDR Fund\nNet Value as of 2025-06-30: $34.4B\n\nTop Holdings by value:\n\n1. Eli Lilly & Co - 12.5%\n2. Johnson & Johnson - 7.5%\n3. AbbVie Inc - 6.7%\n4. UnitedHealth Group Inc - 5.8%\n5. Abbott Laboratories - 4.8%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211029/xslFormNPORT-P_X01/primary_doc.xml)\n# The Industrial Select Sector SPDR Fund\nNet Value as of 2025-06-30: $22.0B\n\nTop Holdings by value:\n\n1. General Electric Co - 6.1%\n2. Uber Technologies Inc - 4.3%\n3. RTX Corp - 4.3%\n4. Caterpillar Inc - 4.0%\n5. Boeing Co/The - 3.5%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211044/xslFormNPORT-P_X01/primary_doc.xml)\n# The Materials Select Sector SPDR Fund\nNet Value as of 2025-06-30: $5.3B\n\nTop Holdings by value:\n\n1. Linde PLC - 16.5%\n2. Sherwin-Williams Co/The - 5.9%\n3. Ecolab Inc - 5.1%\n4. Newmont Corp - 4.9%\n5. Freeport-McMoRan Inc - 4.7%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211041/xslFormNPORT-P_X01/primary_doc.xml)\n# The Real Estate Select Sector SPDR Fund\nNet Value as of 2025-06-30: $7.4B\n\nTop Holdings by value:\n\n1. American Tower Corp - 9.6%\n2. Prologis Inc - 9.0%\n3. Welltower Inc - 8.9%\n4. Equinix Inc - 7.2%\n5. Digital Realty Trust Inc - 5.1%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211033/xslFormNPORT-P_X01/primary_doc.xml)\n# The Technology Select Sector SPDR Fund\nNet Value as of 2025-06-30: $79.8B\n\nTop Holdings by value:\n\n1. NVIDIA Corp - 14.7%\n2. Microsoft Corp - 14.1%\n3. Apple Inc - 11.7%\n4. Broadcom Inc - 4.9%\n5. Oracle Corp - 3.5%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211209/xslFormNPORT-P_X01/primary_doc.xml)\n# The Utilities Select Sector SPDR Fund\nNet Value as of 2025-06-30: $19.0B\n\nTop Holdings by value:\n\n1. NextEra Energy Inc - 11.4%\n2. Constellation Energy Corp - 8.0%\n3. Southern Co/The - 8.0%\n4. Duke Energy Corp - 7.3%\n5. Vistra Corp - 5.2%\n\n[Source](https://www.sec.gov/Archives/edgar/data/0001064641/000175272425211062/xslFormNPORT-P_X01/primary_doc.xml)\n\n*Select Sector Spdr Trust is headquartered in Boston, MA.*",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.5859393579072533,
                    "post_polarity": 0.19827586206896552,
                    "post_subjectivity": 2.9551724137931035,
                    "comments_weighted_polarity": 0.5859393579072533,
                    "combined_sentiment": 0.5859393579072533
                },
                {
                    "reddit_id": "1n45lcd",
                    "created_utc": 1756570479.0,
                    "date": "2025-08-30",
                    "title": "BoursoBank CTO : implémentation du MSCI ACWI IMI",
                    "title_key": "boursobank cto implémentation du msci acwi imi",
                    "body": "Tout d'abord un petit rappel sur ce qu'est le **MSCI ACWI IMI** :\n\n[justETF : MSCI ACWI IMI](https://preview.redd.it/wlox6cglk6mf1.png?width=2575&format=png&auto=webp&s=4266d67f5ffd6676934fa770f910b67bb4828999)\n\nSur PEA, je possède le WPEA, qui est l'ETF suivant l'indice le plus large éligible au PEA (MSCI World).\n\nJe réfléchis à l'après PEA, c'est à dire à une stratégie identique \"je prends l'ETF le plus large\" mais pour CTO. Par conséquent, je cherche à obtenir un fond suivant l'indice MSCI ACWI IMI sur mon CTO BoursoBank.\n\nChallenges :  \n\\- BoursoBank applique différentes restrictions d'accès à certains ETF en CTO. A titre d'exemple, l'ACWI IMI n'est pas directement achetable (notamment le SPDR à 0.17% de frais). Tout ce qui est FTSE (VWCE) semble aussi blacklisté.  \n\\- Je souhaite privilégier BlackRock lorsque c'est possible (pour des raisons de frais de courtage mais pas que)  \n\\- Je souhaite éviter tout ce qui est ESG (NTSG par exemple)\n\nQuestion : avez-vous réussi à répliquer le MSCI ACWI IMI sur CTO BoursoBank, et avec quels ETFs ?",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.33163265306122447,
                    "post_polarity": 0.04464285714285714,
                    "post_subjectivity": 7.428571428571429,
                    "comments_weighted_polarity": 0.16103710002519522,
                    "combined_sentiment": 0.16103710002519522
                },
                {
                    "reddit_id": "1n4c7cv",
                    "created_utc": 1756586970.0,
                    "date": "2025-08-30",
                    "title": "Which All-World ETF Do You Prefer?",
                    "title_key": "which all world etf do you prefer",
                    "body": "Hi all,\nI see that there are three different All-World funds from Invesco, Vanguard, and SPDR, and I’m curious to know which one you invest in and why?",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -0.41,
                    "post_polarity": -0.05,
                    "post_subjectivity": 8.2,
                    "comments_weighted_polarity": 0.28506134913850895,
                    "combined_sentiment": 0.28506134913850895
                },
                {
                    "reddit_id": "1n43540",
                    "created_utc": 1756564446.0,
                    "date": "2025-08-30",
                    "title": "ETFs portfolio advised needed (absolute newb here).",
                    "title_key": "etfs portfolio advised needed absolute newb here",
                    "body": "Hi all esteemed experts here, I have a question. I am looking at creating an ETF portfolio which I can: 1) buy and hold, 2) doesn't need monitoring, and 3) **with an investment horizon of about 15 years**.\n\nI am thinking of creating a portfolio (maybe \\~$50K?) that consist of:  \n1. Vanguard S&P 500 ETF (VOO)  \n2. Invesqo QQQ Trust (QQQ)  \n3. iShares Core S&P Small-Cap ETF (IJR)  \n4. iShares Core S&P Mid-Cap ETF (IJH)  \n5. Vanguard Total Bond Market ETF (BND)  \n6. Vanguard Total International Stock ETF (VXUS)  \n7. VanEck Semiconductor ETF (SMH)  \n8. SPDR Gold Shares (GLD)\n\nSidenote: Vanguard Dividend Appreciation ETF (VIG) to replace GLD?\n\nI understand that some will say, \"less is more\".\n\nObjectively, is it a fool's decision to create a massive portfolio like that? If it is, what is wrong with it? I do not mind diversifying if it means lesser potential gains but a \"safer\" portfolio, because I know that it is already a win by not putting it in a bank. (Some background info: I am one of those who have never started investing till my 40s. Was always parking my cash in bank accounts. Just a regular job holder with kids and housing commitments. Was preposterously risk-adverse; but not anymore. Maybe because I know how much I have been missing out). I am very new to this, and I am extremely open to constructive criticisms. Hopefully some of ya'll can throw me some words of wisdom.",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.32017849692511535,
                    "post_polarity": 0.05944741532976828,
                    "post_subjectivity": 5.385911147675853,
                    "comments_weighted_polarity": 0.48214676885034385,
                    "combined_sentiment": 0.48214676885034385
                },
                {
                    "reddit_id": "1n41o0a",
                    "created_utc": 1756560549.0,
                    "date": "2025-08-30",
                    "title": "Which ETF to buy to allow an in-specie ISA transfer",
                    "title_key": "which etf to buy to allow an in specie isa transfer",
                    "body": "Hi all, currently looking to switch my ISA from AJ Bell to Dodl for lower fees. I plan to do an in-specie transfer to avoid time out of the market. That means I have to switch my existing ISA into something offered by Dodl. I settled on an S&P ETF, and found the ISIN... IE000XZSV718 the SPDR S&P 500 ETF, referred to by Dodl as \"Across the pond\".\n\nHowever, when searching for this ISIN on AJ Bell, it gives 2 results - LSE:SPXL and LSE:SPYL, the difference appears to be the former is in GBP, the latter is in USD. The KIIDs for both appear to be the same, which is also the same as the KIID on Dodl.\n\nAny ideas on which one buy to allow an in-specie transfer? Haven't had any joy from Dodl support...\n\nThanks in advance!",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.3524999999999999,
                    "post_polarity": 0.15,
                    "post_subjectivity": 2.3499999999999996,
                    "comments_weighted_polarity": 0.5649386509806876,
                    "combined_sentiment": 0.5649386509806876
                },
                {
                    "reddit_id": "1n3yomp",
                    "created_utc": 1756551363.0,
                    "date": "2025-08-30",
                    "title": "Estrategia avanzada de inversión",
                    "title_key": "estrategia avanzada de inversión",
                    "body": "Estoy planteando una estrategia de inversión a largo plazo (20+ años) y me gustaría conocer opiniones. La idea es invertir 100.000 GBP (ya que trabajamos en UK varios años) el primer año, aportando cada mes alrededor de 8.333 (DCA), y luego continuar con aportaciones mensuales recurrentes (2.000 € en ppio). He tratado de construir una cartera diversificada que capture la rentabilidad del mercado global pero con algunos “airbags” para escenarios extremos.\n\nEl núcleo es renta variable global: un 60% en el SPDR MSCI ACWI IMI UCITS ETF (Acc, ISIN IE00B3YLTY66), que cubre unas 9.000 empresas en 45 países, incluyendo large, mid y small caps, desarrollados y emergentes. Lo he dividido entre cotización en USD y GBP, con idea de convertir la parte en GBP a euros si el tipo €/GBP llega a 1,18.\n\nEn renta fija, destino un 15%: la mitad a bonos globales investment grade (Vanguard Global Aggregate, cubierto a GBP) y la otra mitad a bonos europeos ligados a la inflación (iShares Euro Inflation Linked). Con esto busco tanto diversificación como cierta protección ante inflación sostenida.\n\nComo diversificador adicional, incluyo un 5% en inmobiliario cotizado europeo vía REITs (iShares European Property Yield). Y en activos reales tengo un bloque importante: un 15% en oro físico y un 3% en plata, ambos vía ETCs UCITS, pensando en cobertura frente a inflación y crisis de deuda. Como toque especulativo, pongo un 2% en un ETP de las 10 criptomonedas principales (CoinShares Top10), más como opción de largo plazo que como apuesta central.\n\nEl coste medio de la cartera es muy bajo (TER ponderado ~0,18%), todos son fondos UCITS domiciliados en Irlanda o Luxemburgo, de réplica física y en versión acumulación (reinvierte dividendos). El plan es rebalancear una vez al año o si algún activo se desvía más de ±5% de su objetivo.\n\nHe probado la estrategia con distintos escenarios históricos y ficticios. En subidas fuertes (IA, emergentes, soft landing) la cartera captura entre el 70 y el 95% de la rentabilidad del mercado global, acabando en rangos del +14 al +19%. En crisis severas (2008, estanflación, crisis de deuda EU+USA) la caída máxima se estima en torno al –25%, frente a caídas del –45% de un ACWI puro. Además, al hacer aportaciones mensuales, el DCA ayuda a suavizar la entrada. \n\nMi pregunta es si este planteamiento tiene sentido como estrategia robusta de largo plazo. ¿Veis adecuado el peso en bonos, oro o REITs? ¿Tiene sentido mantener la diversificación en divisas (USD, GBP, EUR) o sería mejor cubrir todo a euros? ¿Haríais algún ajuste en la parte especulativa (cripto) o en la exposición a small caps?\n\n(me he ayudado de la IA para todo esto) ",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -0.042142013830325516,
                    "post_polarity": -0.016883116883116885,
                    "post_subjectivity": 2.4961038961038957,
                    "comments_weighted_polarity": -0.007023668971720919,
                    "combined_sentiment": -0.007023668971720919
                },
                {
                    "reddit_id": "1n3waqs",
                    "created_utc": 1756541963.0,
                    "date": "2025-08-30",
                    "title": "How safe is DWS?",
                    "title_key": "how safe is dws",
                    "body": "Like title say. I always see or Ishares, Vanguard or SPDR.\n\nWhat about how security is DWS?\n\nI was thinking stop putting in VWCE \n\nAnd do the combo XD9U and EXUS since become half of TER per year and in long run night have some real affect in my €€€\n\nThansk.",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.4923958333333334,
                    "post_polarity": 0.12083333333333335,
                    "post_subjectivity": 4.075,
                    "comments_weighted_polarity": 0.563857780968273,
                    "combined_sentiment": 0.563857780968273
                }
            ],
            "post_count": 25,
            "average_combined_sentiment": 0.15959790825796566
        },
        "2025-08-31": {
            "date": "2025-08-31",
            "posts": [
                {
                    "reddit_id": "1n53ybt",
                    "created_utc": 1756669163.0,
                    "date": "2025-08-31",
                    "title": "How Expensive is the S&P 500 ? on [29-Aug-2025]",
                    "title_key": "how expensive is the s&p 500 on 29 aug 2025",
                    "body": "Hello everyone,\n\nI just published the latest weekly update on the S&P 500’s valuation — including the Price-to-Earnings (P/E) ratio and Earnings Per Share (EPS).\"\n\nYou'll get (for free) A detailed comparison of valuation metrics from 2016 to 2025 as well as two very unique data viz.\n\nFull analysis : [https://epargnebourse.fr/sp-500-per-eps.html](https://epargnebourse.fr/sp-500-per-eps.html) (available in **English, German, French**, …)\n\n\n\nhttps://preview.redd.it/5kowjzs4remf1.png?width=1096&format=png&auto=webp&s=1f00e2a212c72332117b1214b7021216cee09eaf\n\n  \nWould love to hear your thoughts or feedback!\n\n\\#S&P 500, #SP500, #SPY, #pe ratio spy, #PE ratio S&P 500, PE ratio SP500, msci world",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.9602343750000002,
                    "post_polarity": 0.15937500000000002,
                    "post_subjectivity": 6.025,
                    "comments_weighted_polarity": 0.9602343750000002,
                    "combined_sentiment": 0.9602343750000002
                },
                {
                    "reddit_id": "1n5hl7g",
                    "created_utc": 1756709103.0,
                    "date": "2025-08-31",
                    "title": "Jos jedan SP500 post, mozda mrvicu drugaciju",
                    "title_key": "jos jedan sp500 post mozda mrvicu drugaciju",
                    "body": "Pozdrav svima,\n\nOdlucio sam ulagati u SP500, takoder odredio sam iznos i platformu.\n\nIz HR sam, i nije mi jasno, odnosno ne mogu odluciti koji fond da izaberem, sto je uobicajeno i \"najsigurnije\", da li je to VVCE? ",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 1.0238095238095237,
                    "combined_sentiment": 1.0238095238095237
                },
                {
                    "reddit_id": "1n5gso7",
                    "created_utc": 1756706238.0,
                    "date": "2025-08-31",
                    "title": "what stocks r good to buy",
                    "title_key": "what stocks r good to buy",
                    "body": "hello, im a new investor and im wondering if anyone has any stocks that are good for long term, im thinking about sp500 and qqqm but let me know",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 2.089354338842975,
                    "post_polarity": 0.371590909090909,
                    "post_subjectivity": 5.622727272727273,
                    "comments_weighted_polarity": 0.893590252653388,
                    "combined_sentiment": 0.893590252653388
                },
                {
                    "reddit_id": "1n53x28",
                    "created_utc": 1756669080.0,
                    "date": "2025-08-31",
                    "title": "Analyse du niveau de cherté du S&P 500 au 29-08-2025",
                    "title_key": "analyse du niveau de cherté du s&p 500 au 29 08 2025",
                    "body": "Hello, L'analyse hebdo du per, de la progression des EPS du S&P 500 est en ligne.\n\nVous trouverez une comparaison avec les données depuis 2016, ainsi qu'une synthèse très visuelle du risque actuel sur les marchés.\n\nSi vous investissez sur le SP500 (etf SP500) ou même un ETF monde, vous devriez vous intéresser à ces données pour tirer votre propre conclusion\n\nhttps://preview.redd.it/bheluw90remf1.png?width=1096&format=png&auto=webp&s=b880bf501f5471f6fa2c6b3d213010e36b6b7138\n\n\n\nAnalyse complète ici : [https://epargnebourse.fr/sp-500-per-eps.html](https://epargnebourse.fr/sp-500-per-eps.html)\n\n\\#S&P 500, #SP500, #SPY, #pe ratio spy, #PE ratio S&P 500, PE ratio SP500, msci world\n\n",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": -7.5,
                    "post_polarity": -0.75,
                    "post_subjectivity": 10.0,
                    "comments_weighted_polarity": -7.5,
                    "combined_sentiment": -7.5
                },
                {
                    "reddit_id": "1n4ycag",
                    "created_utc": 1756655782.0,
                    "date": "2025-08-31",
                    "title": "PEA, besoin d'avis...",
                    "title_key": "pea besoin d avis",
                    "body": "Bonjour à tous. (H23)\n\nJ'investis actuellement chaque mois en DCA pour environ 300€ et parfois 500€ sur mon PEA via bourso. \n\nEn lisant les divers sujets sur la question, j'ai été convaincu de n'investir par la suite que sur le MSCI malgré le fait que j'investis depuis quelque temps sur le sp500. On m'a déconseillé de revendre mes positions pour les racheter en MSCI.\n\nVous voyez venir ma question... Comme vous le savez depuis les différents changements sur bourso, la limite de transaction sur le MSCI world Bourneau market est limitée à 500€. \n\nMais pour la suite, selon vous, quelle est la meilleure décision entre :\n\n-continuer d'investir mes 300€ et parfois plus sur mon SP500 ?\n-Attendre de cumuler les 500€ pour investir sur le MSCI ?\n-Jongler au cas par cas selon l'épargne mensuelle ? (Cela me semble dérisoire)\n\nMerci à tous ceux qui prendront le temps de me répondre. 🙏🏻",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 0.19642857142857142,
                    "combined_sentiment": 0.19642857142857142
                },
                {
                    "reddit_id": "1n5he9w",
                    "created_utc": 1756708390.0,
                    "date": "2025-08-31",
                    "title": "$100 of GOLD (in red) vs SP500 with dividends reinvested (in blue)",
                    "title_key": "$100 of gold in red vs sp500 with dividends reinvested in blue",
                    "body": "[No Content]",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.45,
                    "comments_weighted_polarity": 0.5017135768436295,
                    "combined_sentiment": 0.5017135768436295
                },
                {
                    "reddit_id": "1n4y7n5",
                    "created_utc": 1756655460.0,
                    "date": "2025-08-31",
                    "title": "Revente Bnp easy sp500€ chez TR pour un ETF MSCI WORLD ?",
                    "title_key": "revente bnp easy sp500€ chez tr pour un etf msci world",
                    "body": "Bonjour !\nCela fait deux mois que j'ai un ouvert un PEA sur TR avec 3k€ d'apport et 300€ de DCA mensuels.\nActuellement je n'ai qu'une seule ligne est donc exposée tech us : FR0011550185\n\nJ'ai l'impression ( je suis novice, h38a) que du Msci world reste l'etf le plus recommandé.\nPourtant quand je compare au SP500,  c'est ce dernier qui semble le mieux performé.\n\nMais pour du long terme, 15/20a, que pensez-vous de revendre mes etfs sp500 pour les switcher vers du Msci world ?\n\nOpération inutile qui vous fait penser que je cherche à timer le marché ? Reste sur sp500 mais avec moins de diversification géographique...\n\nMerci à tous pour vos avis et conseils !",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.5692708333333338,
                    "post_polarity": 0.23958333333333337,
                    "post_subjectivity": 6.550000000000001,
                    "comments_weighted_polarity": 0.39231770833333346,
                    "combined_sentiment": 0.39231770833333346
                },
                {
                    "reddit_id": "1n4s0kp",
                    "created_utc": 1756638757.0,
                    "date": "2025-08-31",
                    "title": "Markets: S&P 500 Made New All Time Highs. Gold rises, 2-Year Treasury Yields fell and Dollar was pretty much unchanged for the week",
                    "title_key": "markets s&p 500 made new all time highs gold rises 2 year treasury yields fell and dollar was pretty much unchanged for the week",
                    "body": "[https://marketchartpattern.substack.com/p/markets-s-and-p-500-made-new-all](https://marketchartpattern.substack.com/p/markets-s-and-p-500-made-new-all)",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 1.1656198347107438,
                    "post_polarity": 0.19545454545454546,
                    "post_subjectivity": 5.963636363636364,
                    "comments_weighted_polarity": 1.1656198347107438,
                    "combined_sentiment": 1.1656198347107438
                },
                {
                    "reddit_id": "1n4z5cr",
                    "created_utc": 1756657707.0,
                    "date": "2025-08-31",
                    "title": "Can you generate 10-15% returns annually in a rather safe way?",
                    "title_key": "can you generate 10 15% returns annually in a rather safe way",
                    "body": "New to dividends and I've got a question. SP500 averages 10% a year so I'm looking to see if there's something with a somewhat bigger % return that holds low risk? I just stumbled across QQQI which I can see returns 12-14% but I'm a bit unsure on how reliable it is? Any other good options that would be better than the good old boring SP500?",
                    "queries_hit": "SP500",
                    "post_weighted_polarity": 0.8352688533057852,
                    "post_polarity": 0.15113636363636362,
                    "post_subjectivity": 5.52659090909091,
                    "comments_weighted_polarity": 0.7310370269206624,
                    "combined_sentiment": 0.7310370269206624
                },
                {
                    "reddit_id": "1n51dq9",
                    "created_utc": 1756663047.0,
                    "date": "2025-08-31",
                    "title": "$SPY: Bears Trimmed the Index, Bulls Rebalancing the Weight 📊📉",
                    "title_key": "$spy bears trimmed the index bulls rebalancing the weight 📊📉",
                    "body": "UltraShort signals at 8/08 10:30 and 8/09 13:00 clipped the climb, bagging up to 3.8% — the bears leaned into macro fatigue with precision 🐻. UltraBuyers who stepped in at 8/10 10:30 and 8/11 09:30 caught a 2.9% bounce before price stalled near $644.05 resistance. Momentum’s still consolidating — next UltraBuy or UltraShort signal could spark action around $646.20 or $641.60 👀.\n\n# Use [https://www.ultraalgo.com/](https://www.ultraalgo.com/) to optimize trades with backtesting algorithmic signals. Try now with a Free Trial. 🚀",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.5887500000000001,
                    "post_polarity": 0.15000000000000002,
                    "post_subjectivity": 3.9250000000000003,
                    "comments_weighted_polarity": 0.5887500000000001,
                    "combined_sentiment": 0.5887500000000001
                },
                {
                    "reddit_id": "1n5d2r5",
                    "created_utc": 1756694074.0,
                    "date": "2025-08-31",
                    "title": "feedback: pre-retirement net income optimized high yield portfolio plan",
                    "title_key": "feedback pre retirement net income optimized high yield portfolio plan",
                    "body": "Hi - I'm doing the FIRE type plan here and planning to start retiring early. As such, my main plan is to obtain significant post-tax income via a dividend portfolio in a taxable brokerage account.\n\nMy own research and a little help from chat GPT produced this portfolio plan netting about 6-6.% pre-tax and 5.5% after taxes. I specifically avoided covered call funds and dedicated only a small portion of the portfolio to higher risk investments like SCHD and VYM.\n\n**I'd love if you guys could weigh in and point out any pitfalls, errors, or advice including criticisms of current asset selections or suggestions for how we could do better. My next step would be to run it by a fiduciary financial advisor.**\n\n**Main idea:**\n\n1. maximize yield up front for first 5 years with flat dividends using the following portfolio.\n2. avoid capital erosion risk from scammy assets like covered call funds,etc\n3. minimize tax liability through asset types like MLPS (tax deferred?)\n4. favor ETFs so not too reliant on any one company's success/failure\n5. balance risk in a market downturn with highest possible returns. We're not planning to sell the underlying assets in this portfolio except to rebalance (see below) so OK to ride out recessions as long as we still have \\~70% of our payouts intact.\n6. At year 5 or 6, gradually rebalance (\\~20% per year) into growth dividend assets historically proven to increase their payouts annually 7-8% - in so doing, gradually track into beating inflation even if we can't buy more underlying shares - without reducing our yield too much. **I won't go into the details of how much I'm rebalancing each year as long as this overall plan seems viable. I'll list the ending growth portfolio assets goal. Obviously it's a LONG TERM plan so the best assets may change in the next 5-10 years.**\n\n**Year 1-5 assets - 100% Yield:**\n\n• AMLP (Alerian MLP ETF) – 45%\n\n• PFF (iShares Preferred & Income Securities) – 15%\n\n• PSK (SPDR Wells Fargo Preferred Stock ETF) – 15%\n\n• SCHD (Schwab U.S. Dividend Equity) – 8.3%• SPYD (SPDR Portfolio High Dividend) – 8.3%\n\n• VYM (Vanguard High Dividend Yield) – 8.4%\n\n**Year 6-10:**\n\n• each year, trim 3-5% of yield holdings and put into growth ETFs.\n\n• end up with 50% growth, 50% yield\n\n**Year 11-15:**\n\n• end up with 60-70% growth, 30-40% yield\n\n**Year 16-20:**\n\n• end up with 80% growth, 20% yield\n\n**Trim these first:**\n\n* **Hold/reinvest into these (Growth side):**\n   * SCHD (core holding)\n   * DGRO\n   * VIG\n   * NOBL\n\nI won't get too much into tax arrangements but I am doing this with my partner (we each have our own share but plan to duplicate the portfolio for now unless we marry soon). \n\nThe main idea is that my partner will work in his job roughly another 5 years before retiring himself with full benefits. I am currently unemployed and may remain so as our dividends via this portfolio look like they could replace my income. \n\nAs I understand it (correct me if I'm wrong), he can withhold the per-paycheck portion of his annual tax liability (annual tax owed / # paychecks) on w4 during this time to avoid having to pay quarterly estimated taxes (who wants to deal with that if you don't have to).",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.6888936046511629,
                    "post_polarity": 0.14750000000000002,
                    "post_subjectivity": 4.67046511627907,
                    "comments_weighted_polarity": 0.4841733772756913,
                    "combined_sentiment": 0.4841733772756913
                },
                {
                    "reddit_id": "1n4z360",
                    "created_utc": 1756657560.0,
                    "date": "2025-08-31",
                    "title": "Mental freedom investing through dividend ETF",
                    "title_key": "mental freedom investing through dividend etf",
                    "body": "This is a brilliant text I found from Nick Maggiulli\n\nhttps://ofdollarsanddata.com/you-cant-put-a-price-on-mental-freedom/\n\nAnd following that passive investing idea applied to a dividend ETF, I was just wondering if it wouldn’t be easier for me just to throw a monthly amount of 1-2k€ to some dividend growing ETFs and forget the single company selection, which one to buy and which to sell. \n\nSo and if the market just goes suddenly down then buy the dip loading more in those ETFs\n\nExamples of European dividend ETFs that I like:\n\nSPYD / IE00B6YX5D40 / SPDR S&P US Dividend Aristocrats ETF\n\nTDIV / VanEck Morningstar Developed Markets Dividend Leaders\" (WKN A2JAHJ) / NL0011683594\n\nVGWL / Vanguard FTSE All-World UCITS ETF (USD) Distributing / IE00B3RBWM25\n\nCompany selection is something that I enjoy but kids and family duties as well as work consume most of my daily time so I am just wondering if it would not be more reasonable to just go passive and instead of invest that time of selecting single companies and buy/sell activities, go and enjoy other life aspects or even let more energy and time assigned instead of go to choose the individual company, go to side projects that can add up to the monthly income. \n\nWhat do you think? \n",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.8394471433120573,
                    "post_polarity": 0.19314373897707232,
                    "post_subjectivity": 4.346230158730158,
                    "comments_weighted_polarity": 0.34973979689944634,
                    "combined_sentiment": 0.34973979689944634
                },
                {
                    "reddit_id": "1n4y6uv",
                    "created_utc": 1756655407.0,
                    "date": "2025-08-31",
                    "title": "Question on selling ETF to buy another ETF.",
                    "title_key": "question on selling etf to buy another etf",
                    "body": "Hi guys,\n\nI’ve been investing for a year now and have put around £4000 into VUAG. I’ve been considering selling it and transferring it into something like SPDR All World (ACWI).\n\nMy question is, is there any disadvantage to sell VUAG and switch it now? I’m just wondering if there is some tax disadvantage or capital gains or something. Or is this a completely normal trade?\n\nAlso for context I have a Stocks & Shares ISA.\n\nCheers!",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 1.2843749999999998,
                    "post_polarity": 0.1875,
                    "post_subjectivity": 6.85,
                    "comments_weighted_polarity": 1.2207249149659862,
                    "combined_sentiment": 1.2207249149659862
                },
                {
                    "reddit_id": "1n4vzsf",
                    "created_utc": 1756650139.0,
                    "date": "2025-08-31",
                    "title": "Tervetuloa /r/omatalouteen! -- (UUDET LUKIJAT JA UUDET SIJOITTAJAT ALOITA TÄSTÄ)",
                    "title_key": "tervetuloa /r/omatalouteen uudet lukijat ja uudet sijoittajat aloita tästä",
                    "body": "**Esteettömyys: [sijoituksen aloittaminen podcast-muodossa](https://youtu.be/OicxPVQhFnQ)**\n\n\nHeippa ja hyvää syksyn alkua!\n\n\n\nPyyntö tuli sijoituksen aloittamisen megaketjuun, minkä tarkoitus on vähentää \"mihin sijoitan 1000e\", \"ETF vai rahasto\", ymv. low-effort postauksia. Modet ohjailee tämän ryhmän käyttöä eniten poistamalla ketjuja ja kommentoimalla/modmaililla viestillä OPlle, että kysyisi saman täällä. Tämä ketju pysyy samana, koska kuukausittainen megaketju saa alle 5 kommenttia per kk.\n\n\n\n\n\nHäpeämätön lainaus  u/vandamstranger :lta:\n\n\n\nSijoittaminen on yksinkertaista, mutta se vaatii johdonmukaisuutta ja pitkäjänteisyyttä. Se on yksi niistä harvoista aloista, jossa menestys ei välttämättä vaadi syvällistä asiantuntemusta. Voit toki syventää tietämystäsi lukemalla aiheesta, kuten \"A Random Walk Down Wall Street\" -kirjasta, mutta se ei ole pakollista.\n\n\n\n**Sijoittamisen perusteet:**\n\n\n\n1. **Säännöllisyys ja pitkäjänteisyys** ovat avainasemassa. Sijoita säännöllisesti, esimerkiksi kuukausittain, riippumatta markkinoiden tilanteesta.\n\n2. Avaa arvo-osuustili luotettavalle välittäjälle. Nordnet on käyttäjäystävällinen vaihtoehto, vaikkakin hieman kalliimpi, ellei käytä heidän kuukausisäästöohjelmaansa.\n\n3. Valitse **matalakuluisia, laajasti hajautettuja passiivisia indeksirahastoja tai ETF:iä**, jotka sijoittavat osingot uudelleen.\n\n4. Pidä **kaupankäyntikulut alle 1 %** sijoitetusta summasta. Esimerkiksi 10 € kaupankäyntikuluilla sijoita vähintään 1000 € kerrallaan.\n\n5. Valitse rahastot tai ETF:t, joiden **hallinnointipalkkio on alle 0,3 %**. Parhaat vaihtoehdot löytyvät jopa alle 0,2 % palkkiolla. (Yleensä tälläisiä ei ole pankin rahastot)\n\n6. **Mitä enemmän voit sijoittaa kuukausittain, sitä parempi.** Ajan myötä (yli 10 vuotta) korkoa korolle -ilmiö kasvattaa sijoituksiasi. Voit netistä löytyvillä laskureilla kokeilla minkälainen salkku sinulla olisi esimerkiksi 40 vuoden päästä. Käytä niissä tuottoprosenttina 4-7%, inflaatio on tällöin huomioituna. \n\n\n\n**Sijoitusvaihtoehtoja:**\n\n\n\n- **IUSQ** tarjoaa globaalin hajautuksen suuriin ja keskisuuriin yhtiöihin sekä kehittyneillä että kehittyvillä markkinoilla. Saatavilla Nordnetin kuukausisäästössä.\n\n- **EUNL, IS3N ja IUSN** (80/10/10 jaolla) antavat kattavan hajautuksen kaikenkokoisiin yhtiöihin, myös pieniin. Kaikki kolme ovat osa Nordnetin kuukausisäästöä.\n\n- **SPYI (SPDR MSCI ACWI IMI)** sisältää käytännössä koko osakemarkkinan yhdessä ETF:ssä. Kuuluu Nordnetin kuukausisäästöön.\n\n- Rahastoina saa **USA-indeksirahastot (Nordnet USA Indeksi, Handelsbanken USA Indeksi)**\n\n- Maailma indeksirahastot mm. **Nordnet Maailma Indeksi / Storebrand Global All Countries A EUR**.\n\n\n\n**Vakautta ja tuottoja:**\n\n\n\n- Jos haluat vakaampaa menoa, yleensä tuottojen kustannuksella, harkitse **V60A ETF:ää**, joka sisältää 60 % osakkeita ja 40 % korkoja. Ei myöskään kuulu nordnetin kuukausisäästöön. \n\n\n\n**Vältettävät sijoitusmuodot:**\n\n\n\n- Unohda suorat osakepoiminnat, osakesäästötilit, krytovaluutat, johdannaiset, megatrendit, ja treidaus. Nämä yleensä häviävät passiiviselle indeksisijoittamiselle pitkällä aikavälillä.\n\n\n\n**Sijoittamisen riskit:**\n\n\n\n- Ole valmis siihen, että osakesalkun arvo voi laskea merkittävästi. Varaudu henkisesti ainakin 50% romahdukseen, jos sijoituksesi ovat 100% osakkeissa. On myös mahdollista, että osakkeiden tuotto on nolla prosenttia yli kymmenen vuoden ajanjaksona.\n\n- Kuulostaako silti liian vaikeelta? Entä jos [selitettäisiin kuin lapselle](https://www.reddit.com/r/Omatalous/comments/1ekimwl/selitt%C3%A4k%C3%A4%C3%A4_mulle_niinkuin_lapselle/) ?\n\n\n**Entäs asunnon ostaminen?**\n\n>[Mietityttääkö ASP-Tilin korko?](https://www.reddit.com/r/Omatalous/comments/1efs1gl/asptili_ja_ylivertainen_riskit%C3%B6n_korko/)\n\n\n**Mietityttääkö oman talouden hallinta?**\n\n>Tässä simppeli [kaavio mistä aloittaa!](https://www.reddit.com/r/Omatalous/comments/1etk50k/oma_talous_hallintaan_kaavio_versio_2_julkaistu/)\n\n**Sijoitusta aloittelevien postauksia poistellaan ja ne ohjataan tänne**, joten mikset vain suoraa kysy kysymystäsi täällä? Tai käytä hakutoimintoa! Se löytyy oikealta puolelta, käyttäjänimesi alapuolelta.\n\nTietoa uusille käyttäjille: Redditin automode laittaa uusien käyttäjien kommentit moderointijonoon ja laittaa ne modejen manuaaliseen hyväksyntäjonoon. Kommentteja ja ketjuja ei poisteta, vaan ne hyväksytään manuaalisesti, koska tosi moni uusi käyttäjä spämmii onlyfans-kontenttia tänne.",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": -2.001276041666667,
                    "post_polarity": -0.39826388888888886,
                    "post_subjectivity": 5.025,
                    "comments_weighted_polarity": -0.1906584821428572,
                    "combined_sentiment": -0.1906584821428572
                },
                {
                    "reddit_id": "1n4ulbm",
                    "created_utc": 1756646545.0,
                    "date": "2025-08-31",
                    "title": "Spy's weekend time",
                    "title_key": "spy s weekend time",
                    "body": "When you're resting, you also need to pay attention to information at all times.",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.0,
                    "post_polarity": 0.0,
                    "post_subjectivity": 1.0,
                    "comments_weighted_polarity": 1.695,
                    "combined_sentiment": 1.695
                },
                {
                    "reddit_id": "1n4u31p",
                    "created_utc": 1756645229.0,
                    "date": "2025-08-31",
                    "title": "Making sense of tracking difference / choosing ETF",
                    "title_key": "making sense of tracking difference / choosing etf",
                    "body": "I've come to learn that TER is not really the important number to look at when choosing an ETF, but that the *real* cost is actually the tracking difference from the underlying index.\n\nI'm making a decision between **SWRD** (SPDR MSCI World) and **SPYY** (SPDR MSCI All Country World). Basically developed vs developed / emerging.\n\nI like the extra diversification adding EM gives, but if I [look at the tracking differences](https://www.trackingdifferences.com/) I see that **SWRD consistently outperforms the index** (which makes sense, since the withholding tax is overestimated vs what Ireland-based funds need to pay) and **SPYY underperforms**.\n\nhttps://preview.redd.it/nk75hzeircmf1.png?width=2628&format=png&auto=webp&s=7d3dfba74a17299718bfb5b3a7313e20ce4be7bb\n\nThis gives an extra cost of 0.16% that adding emerging markets hopefully earns back on the long term.\n\nI know that we can't know how EM vs developed will grow in the coming years, but do we expect, in general that it outperforms enough to offset the \"extra cost\" / tracking difference.\n\nI'm also assuming that any of these 2 ETFs will be good, and it won't make a big difference in the long run since they're both very broadly diversified.\n\nAny input / thoughts on this?",
                    "queries_hit": "SPDR",
                    "post_weighted_polarity": 0.3582545230263157,
                    "post_polarity": 0.09374999999999999,
                    "post_subjectivity": 3.821381578947368,
                    "comments_weighted_polarity": 0.1202146724232456,
                    "combined_sentiment": 0.1202146724232456
                }
            ],
            "post_count": 16,
            "average_combined_sentiment": 0.16454344682008532
        }
    }
}